package util

var City = map[int]map[int]string{
	3568: {
		0: "阿巴嘎旗",
		1: "abagaqi",
		2: "ABG",
	},
	255: {
		0: "阿坝",
		1: "aba",
		2: "AB",
	},
	1704: {
		0: "阿坝县",
		1: "abaxian",
		2: "ABX",
	},
	4133: {
		0: "阿比斯库",
		1: "abisko",
		2: "ABK",
	},
	4331: {
		0: "阿伯丁",
		1: "aberdeen",
		2: "ABD",
	},
	3146: {
		0: "阿布扎比",
		1: "abudhabi",
		2: "ABD",
	},
	765: {
		0: "阿城区",
		1: "acheng",
		2: "AC",
	},
	4107: {
		0: "阿德莱德",
		1: "adelaide",
		2: "ADL",
	},
	4382: {
		0: "阿尔巴尼亚",
		1: "albania",
		2: "ALB",
	},
	4381: {
		0: "阿尔及利亚",
		1: "algeria",
		2: "DZ",
	},
	4059: {
		0: "阿尔勒",
		1: "arles",
		2: "ARL",
	},
	4057: {
		0: "阿尔萨斯",
		1: "alsace",
		2: "ALS",
	},
	680: {
		0: "阿尔山市",
		1: "aershan",
		2: "AES",
	},
	4380: {
		0: "阿富汗",
		1: "afghanistan",
		2: "AFG",
	},
	2410: {
		0: "阿格拉",
		1: "agra",
		2: "AGL",
	},
	4385: {
		0: "阿根廷",
		1: "argentina",
		2: "AGR",
	},
	2238: {
		0: "阿合奇县",
		1: "aheqi",
		2: "AHQ",
	},
	4038: {
		0: "阿卡罗阿",
		1: "akaroa",
		2: "AKR",
	},
	2107: {
		0: "阿克塞哈萨克族自治县",
		1: "akesai",
		2: "AKS",
	},
	332: {
		0: "阿克苏地区",
		1: "akesudiqu",
		2: "AKS",
	},
	2213: {
		0: "阿克苏市",
		1: "akesu",
		2: "AKS",
	},
	2237: {
		0: "阿克陶县",
		1: "aketao",
		2: "AKT",
	},
	389: {
		0: "阿拉尔",
		1: "alaer",
		2: "ALE",
	},
	4371: {
		0: "阿拉贡自治区",
		1: "aragon",
		2: "ARG",
	},
	3594: {
		0: "阿拉山口市",
		1: "alashankoushi",
		2: "ALS",
	},
	57: {
		0: "阿拉善",
		1: "alashan",
		2: "ALS",
	},
	3578: {
		0: "阿拉善右旗",
		1: "ayouqi",
		2: "AYQ",
	},
	3577: {
		0: "阿拉善左旗",
		1: "azuoqi",
		2: "AZQ",
	},
	15129: {
		0: "阿拉斯加",
		1: "Alaska",
		2: "ALA",
	},
	338: {
		0: "阿勒泰地区",
		1: "aletaidiqu",
		2: "ALT",
	},
	2275: {
		0: "阿勒泰市",
		1: "aletai",
		2: "ALT",
	},
	288: {
		0: "阿里",
		1: "ali",
		2: "AL",
	},
	4386: {
		0: "阿联酋",
		1: "arabemirates",
		2: "AE",
	},
	4388: {
		0: "阿鲁巴",
		1: "aruba",
		2: "ABW",
	},
	3531: {
		0: "阿鲁科尔沁旗",
		1: "aluqinqi",
		2: "ALQ",
	},
	3366: {
		0: "阿鲁沙",
		1: "arusha",
		2: "ARK",
	},
	3487: {
		0: "阿马尔菲",
		1: "amalfi",
		2: "AMF",
	},
	4384: {
		0: "阿曼",
		1: "oman",
		2: "OMA",
	},
	3320: {
		0: "阿姆利则",
		1: "amritsar",
		2: "AMS",
	},
	2428: {
		0: "阿姆斯特丹",
		1: "amsterdam",
		2: "AMS",
	},
	4064: {
		0: "阿讷西",
		1: "annecy",
		2: "ANC",
	},
	3550: {
		0: "阿荣旗",
		1: "arongqi",
		2: "ARQ",
	},
	4379: {
		0: "阿塞拜疆",
		1: "azerbaijan",
		2: "AZE",
	},
	2236: {
		0: "阿图什市",
		1: "atushi",
		2: "AST",
	},
	2220: {
		0: "阿瓦提县",
		1: "awati",
		2: "AWT",
	},
	4373: {
		0: "阿维拉",
		1: "avila",
		2: "AVI",
	},
	3100: {
		0: "阿维尼翁",
		1: "avignon",
		2: "AVN",
	},
	3499: {
		0: "阿西西",
		1: "assisi",
		2: "ASS",
	},
	3299: {
		0: "埃德蒙顿",
		1: "edmonton",
		2: "ADM",
	},
	3367: {
		0: "埃及",
		1: "egypt",
		2: "EGY",
	},
	2496: {
		0: "埃塞俄比亚",
		1: "ethiopia",
		2: "ASE",
	},
	3456: {
		0: "埃森",
		1: "essen",
		2: "ESN",
	},
	4330: {
		0: "埃文河畔斯特拉特福",
		1: "stratford",
		2: "SUA",
	},
	4343: {
		0: "埃因霍温",
		1: "eindhoven",
		2: "EIN",
	},
	15246: {
		0: "艾伯塔",
		1: "Alberta",
		2: "ALB",
	},
	4066: {
		0: "艾克斯",
		1: "aix",
		2: "AIX",
	},
	15121: {
		0: "爱达荷州",
		1: "Idaho",
		2: "IDA",
	},
	2465: {
		0: "爱丁堡",
		1: "edinburgh",
		2: "ADB",
	},
	4122: {
		0: "爱尔兰",
		1: "ireland",
		2: "IRL",
	},
	15125: {
		0: "爱荷华州",
		1: "Iowa",
		2: "IOW",
	},
	4124: {
		0: "爱沙尼亚",
		1: "estonia",
		2: "EST",
	},
	3188: {
		0: "爱知",
		1: "aichi",
		2: "AIC",
	},
	15258: {
		0: "安达卢西亚",
		1: "Andalucia",
		2: "AND",
	},
	815: {
		0: "安达市",
		1: "anda",
		2: "AD",
	},
	3287: {
		0: "安大略",
		1: "ontario",
		2: "ADL",
	},
	3402: {
		0: "安道尔",
		1: "andorra",
		2: "AND",
	},
	1943: {
		0: "安多县",
		1: "anduo",
		2: "AD",
	},
	1116: {
		0: "安福县",
		1: "anfu",
		2: "AF",
	},
	3399: {
		0: "安哥拉",
		1: "angola",
		2: "AGO",
	},
	3400: {
		0: "安圭拉",
		1: "anguilla",
		2: "AIA",
	},
	499: {
		0: "安国市",
		1: "anguo",
		2: "AG",
	},
	1392: {
		0: "安化县",
		1: "anhua",
		2: "AH",
	},
	875: {
		0: "安吉县",
		1: "anji",
		2: "AJ",
	},
	2446: {
		0: "安卡拉",
		1: "ankara",
		2: "AKL",
	},
	297: {
		0: "安康",
		1: "ankang",
		2: "AK",
	},
	4278: {
		0: "安克雷奇",
		1: "anchorage",
		2: "ACL",
	},
	1814: {
		0: "安龙县",
		1: "anliu",
		2: "AL",
	},
	1332: {
		0: "安陆市",
		1: "anlu",
		2: "AL",
	},
	4173: {
		0: "安曼",
		1: "amman",
		2: "AMM",
	},
	1815: {
		0: "安宁市",
		1: "anning",
		2: "AN",
	},
	524: {
		0: "安平县",
		1: "anping",
		2: "AP",
	},
	117: {
		0: "安庆",
		1: "anqing",
		2: "AQ",
	},
	1145: {
		0: "安丘市",
		1: "anqiu",
		2: "AQ",
	},
	1422: {
		0: "安仁县",
		1: "anren",
		2: "AR",
	},
	2011: {
		0: "安塞区",
		1: "ansai",
		2: "AS",
	},
	261: {
		0: "安顺",
		1: "anshun",
		2: "AS",
	},
	2445: {
		0: "安塔利亚",
		1: "antalya",
		2: "ATL",
	},
	2422: {
		0: "安特卫普",
		1: "antwerp",
		2: "ATW",
	},
	3401: {
		0: "安提瓜和巴布达",
		1: "antigandbarbuda",
		2: "ATG",
	},
	761: {
		0: "安图县",
		1: "antu",
		2: "AT",
	},
	1012: {
		0: "安溪县",
		1: "anxi",
		2: "AX",
	},
	1383: {
		0: "安乡县",
		1: "anxiang",
		2: "AX",
	},
	512: {
		0: "安新县",
		1: "anxin",
		2: "AX",
	},
	164: {
		0: "安阳",
		1: "anyang",
		2: "AY",
	},
	1246: {
		0: "安阳县",
		1: "anyangxian",
		2: "AYX",
	},
	1040: {
		0: "安义县",
		1: "anyi",
		2: "AY",
	},
	1067: {
		0: "安远县",
		1: "anyuan",
		2: "AY",
	},
	1681: {
		0: "安岳县",
		1: "anyue",
		2: "AY",
	},
	637: {
		0: "安泽县",
		1: "anzhe",
		2: "AZ",
	},
	1621: {
		0: "安州区",
		1: "anxian",
		2: "AX",
	},
	58: {
		0: "鞍山",
		1: "anshan",
		2: "AS",
	},
	1985: {
		0: "昂仁县",
		1: "angren",
		2: "AR",
	},
	3537: {
		0: "敖汉旗",
		1: "aohanqi",
		2: "AHQ",
	},
	3391: {
		0: "奥地利",
		1: "austria",
		2: "AUT",
	},
	3460: {
		0: "奥格斯堡",
		1: "augsburg",
		2: "AGB",
	},
	3237: {
		0: "奥胡斯",
		1: "arhus",
		2: "AHS",
	},
	2384: {
		0: "奥克兰",
		1: "auckland",
		2: "AKL",
	},
	10517: {
		0: "奥克兰",
		1: "Oakland",
		2: "OAK",
	},
	2401: {
		0: "奥兰多",
		1: "orlando",
		2: "ORL",
	},
	3428: {
		0: "奥林匹亚",
		1: "olympia",
		2: "OLY",
	},
	4030: {
		0: "奥马鲁",
		1: "oamaru",
		2: "OAM",
	},
	3163: {
		0: "奥斯陆",
		1: "oslo",
		2: "OSL",
	},
	4233: {
		0: "奥斯汀",
		1: "austin",
		2: "ASD",
	},
	2318: {
		0: "澳大利亚",
		1: "australia",
		2: "AU",
	},
	342: {
		0: "澳门",
		1: "macau",
		2: "AM",
	},
	1955: {
		0: "八宿县",
		1: "basu",
		2: "BS",
	},
	3417: {
		0: "巴巴多斯",
		1: "barbados",
		2: "BRB",
	},
	3418: {
		0: "巴布亚新几内亚",
		1: "papuanewguinea",
		2: "PNG",
	},
	2211: {
		0: "巴楚县",
		1: "bachu",
		2: "BC",
	},
	3328: {
		0: "巴淡岛",
		1: "batam",
		2: "BTM",
	},
	3410: {
		0: "巴德岗",
		1: "bhaktapur",
		2: "BDG",
	},
	3393: {
		0: "巴德伊舍",
		1: "badischl",
		2: "BDI",
	},
	3446: {
		0: "巴登-巴登",
		1: "badenbaden",
		2: "BBN",
	},
	1371: {
		0: "巴东县",
		1: "badong",
		2: "BD",
	},
	4193: {
		0: "巴尔的摩",
		1: "baltimore",
		2: "BLD",
	},
	15257: {
		0: "巴伐利亚",
		1: "Bavaria",
		2: "BAV",
	},
	3415: {
		0: "巴哈马",
		1: "bahamas",
		2: "BAH",
	},
	3416: {
		0: "巴基斯坦",
		1: "pakistan",
		2: "PAK",
	},
	3338: {
		0: "巴拉德罗",
		1: "varadero",
		2: "VDO",
	},
	2357: {
		0: "巴拉望",
		1: "palawan",
		2: "PAL",
	},
	3413: {
		0: "巴勒斯坦",
		1: "palestine",
		2: "PLE",
	},
	3330: {
		0: "巴厘巴板",
		1: "balikpapan",
		2: "BPN",
	},
	2351: {
		0: "巴厘岛",
		1: "bali",
		2: "DPS",
	},
	2388: {
		0: "巴黎",
		1: "paris",
		2: "PAR",
	},
	2235: {
		0: "巴里坤哈萨克自治县",
		1: "balikun",
		2: "BLK",
	},
	4369: {
		0: "巴利阿里群岛",
		1: "balearicislands",
		2: "BID",
	},
	3421: {
		0: "巴林",
		1: "bahrain",
		2: "BRN",
	},
	3533: {
		0: "巴林右旗",
		1: "bayouqi",
		2: "BYQ",
	},
	3532: {
		0: "巴林左旗",
		1: "bazuoqi",
		2: "BZQ",
	},
	1591: {
		0: "巴马瑶族自治县",
		1: "bama",
		2: "BM",
	},
	3420: {
		0: "巴拿马",
		1: "panama",
		2: "PAN",
	},
	1947: {
		0: "巴青县",
		1: "baqing",
		2: "BQ",
	},
	4142: {
		0: "巴塞尔",
		1: "basel",
		2: "BSE",
	},
	2449: {
		0: "巴塞罗那",
		1: "barcelona",
		2: "BSL",
	},
	3222: {
		0: "巴色",
		1: "pakse",
		2: "PKZ",
	},
	3125: {
		0: "巴斯",
		1: "bath",
		2: "BS",
	},
	4367: {
		0: "巴斯克自治区",
		1: "basquecountry",
		2: "TBC",
	},
	1720: {
		0: "巴塘县",
		1: "batang",
		2: "BT",
	},
	3422: {
		0: "巴西",
		1: "brazil",
		2: "BRA",
	},
	56: {
		0: "巴彦淖尔",
		1: "bayannaoer",
		2: "BY",
	},
	769: {
		0: "巴彦县",
		1: "bayan",
		2: "BY",
	},
	1960: {
		0: "巴宜区",
		1: "linzhixian",
		2: "BY",
	},
	331: {
		0: "巴音郭楞",
		1: "bayinguoleng",
		2: "BYG",
	},
	253: {
		0: "巴中",
		1: "bazhong",
		2: "BZ",
	},
	3510: {
		0: "巴州区",
		1: "bazhouqu",
		2: "BZQ",
	},
	2344: {
		0: "芭堤雅",
		1: "Pattaya",
		2: "PAT",
	},
	489: {
		0: "霸州市",
		1: "bazhou",
		2: "BZ",
	},
	15079: {
		0: "白滨",
		1: "Shirahama",
		2: "SHI",
	},
	77: {
		0: "白城",
		1: "baicheng",
		2: "BC",
	},
	4161: {
		0: "白俄罗斯",
		1: "belarus",
		2: "BLR",
	},
	2080: {
		0: "白河县",
		1: "baihe",
		2: "BH",
	},
	1987: {
		0: "白朗县",
		1: "bailang",
		2: "BL",
	},
	390: {
		0: "白沙",
		1: "baisha",
		2: "BS",
	},
	75: {
		0: "白山",
		1: "baishan",
		2: "BS",
	},
	2028: {
		0: "白水县",
		1: "baishui",
		2: "BS",
	},
	302: {
		0: "白银",
		1: "baiyin",
		2: "BY",
	},
	1716: {
		0: "白玉县",
		1: "baiyu",
		2: "BY",
	},
	3626: {
		0: "白云山",
		1: "baiyunshan",
		2: "BYS",
	},
	4163: {
		0: "百慕大",
		1: "bermuda",
		2: "BM",
	},
	233: {
		0: "百色",
		1: "baise",
		2: "BS",
	},
	2423: {
		0: "柏林",
		1: "berlin",
		2: "BL",
	},
	547: {
		0: "柏乡县",
		1: "boxiang",
		2: "BX",
	},
	2218: {
		0: "拜城县",
		1: "baichengxian",
		2: "BC",
	},
	4119: {
		0: "拜伦湾",
		1: "byronbay",
		2: "QYN",
	},
	782: {
		0: "拜泉县",
		1: "baiquan",
		2: "BQ",
	},
	2349: {
		0: "拜县",
		1: "pai",
		2: "PAI",
	},
	3457: {
		0: "班贝格",
		1: "bamberg",
		2: "BMB",
	},
	3291: {
		0: "班夫国家公园",
		1: "banffpark",
		2: "BFP",
	},
	1946: {
		0: "班戈县",
		1: "bange",
		2: "BG",
	},
	3323: {
		0: "班加罗尔",
		1: "bangalore",
		2: "BLR",
	},
	2174: {
		0: "班玛县",
		1: "banma",
		2: "BM",
	},
	112: {
		0: "蚌埠",
		1: "bengbu",
		2: "BB",
	},
	47: {
		0: "包头",
		1: "baotou",
		2: "BT",
	},
	4462: {
		0: "宝坻区",
		1: "baodi",
		2: "BD",
	},
	1276: {
		0: "宝丰县",
		1: "baofeng",
		2: "BF",
	},
	291: {
		0: "宝鸡",
		1: "baoji",
		2: "BJ",
	},
	804: {
		0: "宝清县",
		1: "baoqing",
		2: "BQ",
	},
	1693: {
		0: "宝兴县",
		1: "baoxing",
		2: "BX",
	},
	852: {
		0: "宝应县",
		1: "baoying",
		2: "BY",
	},
	618: {
		0: "保德县",
		1: "baode",
		2: "BD",
	},
	29: {
		0: "保定",
		1: "baoding",
		2: "BD",
	},
	3265: {
		0: "保加利亚",
		1: "bulgarian",
		2: "BGR",
	},
	1460: {
		0: "保靖县",
		1: "baojing",
		2: "BJ",
	},
	1327: {
		0: "保康县",
		1: "baokang",
		2: "BK",
	},
	270: {
		0: "保山",
		1: "baoshan",
		2: "BS",
	},
	391: {
		0: "保亭",
		1: "baoting",
		2: "BT",
	},
	4006: {
		0: "卑尔根",
		1: "bergen",
		2: "BRG",
	},
	783: {
		0: "北安市",
		1: "beian",
		2: "BA",
	},
	1623: {
		0: "北川羌族自治县",
		1: "beichuan",
		2: "BC",
	},
	228: {
		0: "北海",
		1: "beihai",
		2: "BH",
	},
	2375: {
		0: "北海道",
		1: "hokkaido",
		2: "HOK",
	},
	2: {
		0: "北京",
		1: "beijing",
		2: "BJ",
	},
	15150: {
		0: "北卡罗来纳州",
		1: "NorthCarolina",
		2: "NC",
	},
	3440: {
		0: "北莱茵-威斯特法伦",
		1: "westphalia",
		2: "NRW",
	},
	1559: {
		0: "北流市",
		1: "beiliu",
		2: "BL",
	},
	3306: {
		0: "北马里亚纳",
		1: "northernmariana",
		2: "MP",
	},
	688: {
		0: "北票市",
		1: "beipiao",
		2: "BP",
	},
	346: {
		0: "北屯",
		1: "beitun",
		2: "BT",
	},
	718: {
		0: "北镇市",
		1: "beining",
		2: "BN",
	},
	4300: {
		0: "贝尔法斯特",
		1: "belfast",
		2: "BEL",
	},
	3380: {
		0: "贝尔格莱德",
		1: "belgrade",
		2: "BEG",
	},
	4376: {
		0: "贝宁",
		1: "benin",
		2: "BEN",
	},
	3444: {
		0: "贝希特斯加登",
		1: "berchtesgaden",
		2: "BSG",
	},
	60: {
		0: "本溪",
		1: "benxi",
		2: "BX",
	},
	703: {
		0: "本溪满族自治县",
		1: "benxixian",
		2: "BXX",
	},
	2480: {
		0: "比勒陀利亚",
		1: "pretoria",
		2: "BLT",
	},
	4043: {
		0: "比利时",
		1: "belgium",
		2: "BEL",
	},
	1941: {
		0: "比如县",
		1: "biru",
		2: "BR",
	},
	2462: {
		0: "比萨",
		1: "pisa",
		2: "BS",
	},
	4372: {
		0: "毕尔巴鄂",
		1: "bilbao",
		2: "BIO",
	},
	264: {
		0: "毕节市",
		1: "bijieshi",
		2: "BJS",
	},
	1770: {
		0: "碧江区",
		1: "tongren",
		2: "BJ",
	},
	2287: {
		0: "璧山区",
		1: "bishan",
		2: "BS",
	},
	1959: {
		0: "边坝县",
		1: "bianba",
		2: "BB",
	},
	3198: {
		0: "别府",
		1: "beppu",
		2: "BEP",
	},
	1888: {
		0: "宾川县",
		1: "binchuan",
		2: "BC",
	},
	15156: {
		0: "宾夕法尼亚州",
		1: "Pennsylvania",
		2: "PEN",
	},
	768: {
		0: "宾县",
		1: "binxian",
		2: "BX",
	},
	1531: {
		0: "宾阳县",
		1: "binyang",
		2: "BY",
	},
	2037: {
		0: "彬州市",
		1: "binxianshi",
		2: "BZS",
	},
	849: {
		0: "滨海县",
		1: "binhai",
		2: "BH",
	},
	158: {
		0: "滨州",
		1: "binzhou",
		2: "BZ",
	},
	2360: {
		0: "槟城",
		1: "penang",
		2: "PEN",
	},
	3273: {
		0: "冰岛",
		1: "iceland",
		2: "ISL",
	},
	3189: {
		0: "兵库",
		1: "hyogo",
		2: "HYO",
	},
	3447: {
		0: "波茨坦",
		1: "potsdam",
		2: "POT",
	},
	4092: {
		0: "波多黎各",
		1: "puertorico",
		2: "PUR",
	},
	3435: {
		0: "波恩",
		1: "bonn",
		2: "BON",
	},
	4062: {
		0: "波尔多",
		1: "bordeaux",
		2: "BOR",
	},
	2435: {
		0: "波尔图",
		1: "porto",
		2: "BET",
	},
	4094: {
		0: "波黑",
		1: "bohei",
		2: "GDS",
	},
	4089: {
		0: "波兰",
		1: "poland",
		2: "POL",
	},
	1964: {
		0: "波密县",
		1: "bomi",
		2: "BM",
	},
	2403: {
		0: "波士顿",
		1: "boston",
		2: "BOS",
	},
	4194: {
		0: "波特兰",
		1: "portland",
		2: "BTL",
	},
	4128: {
		0: "玻利维亚",
		1: "bolivia",
		2: "BOL",
	},
	4332: {
		0: "伯恩茅斯",
		1: "bournemouth",
		2: "BNM",
	},
	2443: {
		0: "伯尔尼",
		1: "bern",
		2: "BEN",
	},
	4139: {
		0: "伯尔尼高地",
		1: "berneseoberland",
		2: "BOD",
	},
	4250: {
		0: "伯克利",
		1: "CityofBerkeley",
		2: "BKL",
	},
	4301: {
		0: "伯明翰",
		1: "birmingham",
		2: "BMH",
	},
	528: {
		0: "泊头市",
		1: "botou",
		2: "BT",
	},
	4065: {
		0: "勃艮第",
		1: "burgundy",
		2: "BAG",
	},
	773: {
		0: "勃利县",
		1: "boli",
		2: "BL",
	},
	124: {
		0: "亳州",
		1: "bozhou",
		2: "BZ",
	},
	1232: {
		0: "博爱县",
		1: "boai",
		2: "BA",
	},
	3618: {
		0: "博鳌",
		1: "boao",
		2: "BA",
	},
	1563: {
		0: "博白县",
		1: "bobai",
		2: "BB",
	},
	3309: {
		0: "博茨瓦纳",
		1: "botswana",
		2: "BWA",
	},
	3353: {
		0: "博德鲁姆",
		1: "bodrum",
		2: "BDM",
	},
	330: {
		0: "博尔塔拉",
		1: "boertala",
		2: "BET",
	},
	2257: {
		0: "博湖县",
		1: "bohu",
		2: "BH",
	},
	3409: {
		0: "博卡拉",
		1: "pokhara",
		2: "BKL",
	},
	2240: {
		0: "博乐市",
		1: "bole",
		2: "BL",
	},
	1500: {
		0: "博罗县",
		1: "boluo",
		2: "BL",
	},
	3481: {
		0: "博洛尼亚",
		1: "bologna",
		2: "BLQ",
	},
	4433: {
		0: "博山",
		1: "boshan",
		2: "BS",
	},
	1199: {
		0: "博兴县",
		1: "boxing",
		2: "BX",
	},
	516: {
		0: "博野县",
		1: "boye",
		2: "BY",
	},
	2358: {
		0: "薄荷岛",
		1: "bohol",
		2: "TAG",
	},
	3231: {
		0: "不丹",
		1: "bhutan",
		2: "BHU",
	},
	3434: {
		0: "不来梅",
		1: "bremen",
		2: "BLM",
	},
	3288: {
		0: "不列颠哥伦比亚省",
		1: "britishcolumbia",
		2: "BRC",
	},
	15234: {
		0: "布城",
		1: "put",
		2: "PUT",
	},
	2457: {
		0: "布达佩斯",
		1: "budapest",
		2: "BDP",
	},
	2276: {
		0: "布尔津县",
		1: "buerjin",
		2: "BEJ",
	},
	2433: {
		0: "布尔诺",
		1: "brno",
		2: "BEN",
	},
	3424: {
		0: "布基纳法索",
		1: "burkinafaso",
		2: "BFA",
	},
	4181: {
		0: "布加勒斯特",
		1: "bucharest",
		2: "BJL",
	},
	4020: {
		0: "布拉迪斯拉发",
		1: "bratislava",
		2: "BTA",
	},
	2431: {
		0: "布拉格",
		1: "prague",
		2: "BLG",
	},
	4306: {
		0: "布莱顿",
		1: "brighton",
		2: "BLD",
	},
	4151: {
		0: "布里恩茨",
		1: "brienz",
		2: "BR",
	},
	2381: {
		0: "布里斯班",
		1: "brisbane",
		2: "BNE",
	},
	4312: {
		0: "布里斯托",
		1: "bristol",
		2: "BRS",
	},
	4061: {
		0: "布列塔尼",
		1: "brittany",
		2: "BRB",
	},
	3425: {
		0: "布隆迪",
		1: "burundi",
		2: "BDI",
	},
	4051: {
		0: "布卢瓦",
		1: "blois",
		2: "BLI",
	},
	2421: {
		0: "布鲁日",
		1: "bruges",
		2: "BLR",
	},
	2420: {
		0: "布鲁塞尔",
		1: "brussels",
		2: "BLS",
	},
	1730: {
		0: "布拖县",
		1: "butuo",
		2: "BT",
	},
	2485: {
		0: "布宜诺斯艾利斯",
		1: "buenosaires",
		2: "BYN",
	},
	1308: {
		0: "泌阳县",
		1: "miyang",
		2: "MY",
	},
	4168: {
		0: "秘鲁",
		1: "peru",
		2: "PER",
	},
	4138: {
		0: "采尔马特",
		1: "zermatt",
		2: "CEM",
	},
	15051: {
		0: "仓敷",
		1: "Kurashiki",
		2: "KUR",
	},
	532: {
		0: "沧县",
		1: "cangxian",
		2: "CX",
	},
	1873: {
		0: "沧源佤族自治县",
		1: "changyuanxian",
		2: "CY",
	},
	32: {
		0: "沧州",
		1: "cangzhou",
		2: "CZ",
	},
	911: {
		0: "苍南",
		1: "cangnan",
		2: "CN",
	},
	1554: {
		0: "苍梧县",
		1: "cangwu",
		2: "CW",
	},
	1617: {
		0: "苍溪县",
		1: "cangxi",
		2: "CX",
	},
	4479: {
		0: "曹妃甸区",
		1: "caofeidian",
		2: "CFD",
	},
	1201: {
		0: "曹县",
		1: "caoxian",
		2: "CX",
	},
	1813: {
		0: "册亨县",
		1: "ceheng",
		2: "CH",
	},
	2227: {
		0: "策勒县",
		1: "cele",
		2: "CL",
	},
	1784: {
		0: "岑巩县",
		1: "cengong",
		2: "CG",
	},
	1553: {
		0: "岑溪市",
		1: "cenxi",
		2: "CX",
	},
	1402: {
		0: "茶陵县",
		1: "chaling",
		2: "CL",
	},
	4469: {
		0: "茶山镇",
		1: "chashan",
		2: "CS",
	},
	2267: {
		0: "察布查尔锡伯自治县",
		1: "chabuchaer",
		2: "CBC",
	},
	3563: {
		0: "察哈尔右翼后旗",
		1: "chayouhouqi",
		2: "CYH",
	},
	3561: {
		0: "察哈尔右翼前旗",
		1: "chayouqianqi",
		2: "CYQ",
	},
	3562: {
		0: "察哈尔右翼中旗",
		1: "chayouzhongqi",
		2: "CYZ",
	},
	1954: {
		0: "察雅县",
		1: "chaya",
		2: "CY",
	},
	1965: {
		0: "察隅县",
		1: "chayu",
		2: "CY",
	},
	284: {
		0: "昌都市",
		1: "changdudiqu",
		2: "CDD",
	},
	2243: {
		0: "昌吉市",
		1: "changji",
		2: "CJ",
	},
	329: {
		0: "昌吉州",
		1: "changjizhou",
		2: "CJ",
	},
	392: {
		0: "昌江",
		1: "changjiang",
		2: "CJ",
	},
	1152: {
		0: "昌乐县",
		1: "cangle",
		2: "CL",
	},
	477: {
		0: "昌黎县",
		1: "cangli",
		2: "CL",
	},
	1843: {
		0: "昌宁县",
		1: "cangning",
		2: "CN",
	},
	699: {
		0: "昌图县",
		1: "cangtu",
		2: "CT",
	},
	1146: {
		0: "昌邑市",
		1: "cangyi",
		2: "CY",
	},
	755: {
		0: "长白朝鲜族自治县",
		1: "chengbai",
		2: "CB",
	},
	3596: {
		0: "长白山",
		1: "changbaishan",
		2: "CBS",
	},
	70: {
		0: "长春",
		1: "changchun",
		2: "CC",
	},
	4259: {
		0: "长岛",
		1: "longisland",
		2: "LIC",
	},
	1160: {
		0: "长岛县",
		1: "changdao",
		2: "CD",
	},
	920: {
		0: "长丰县",
		1: "changfeng",
		2: "CF",
	},
	1268: {
		0: "长葛市",
		1: "changge",
		2: "CG",
	},
	432: {
		0: "长海县",
		1: "changhai",
		2: "CH",
	},
	981: {
		0: "长乐",
		1: "changle",
		2: "CL",
	},
	733: {
		0: "长岭县",
		1: "changling",
		2: "CL",
	},
	1662: {
		0: "长宁县",
		1: "changningxian",
		2: "CN",
	},
	3191: {
		0: "长崎",
		1: "nagasaki",
		2: "NGS",
	},
	4457: {
		0: "长清区",
		1: "changqing",
		2: "CQ",
	},
	344: {
		0: "长沙",
		1: "changsha",
		2: "CS",
	},
	1377: {
		0: "长沙县",
		1: "changshaxian",
		2: "CSX",
	},
	4428: {
		0: "长寿区",
		1: "changshou",
		2: "CS",
	},
	1803: {
		0: "长顺县",
		1: "changshun",
		2: "CS",
	},
	1019: {
		0: "长泰县",
		1: "changtai",
		2: "CT",
	},
	2355: {
		0: "长滩岛",
		1: "boracay",
		2: "BOR",
	},
	1025: {
		0: "长汀县",
		1: "changting",
		2: "CT",
	},
	2038: {
		0: "长武县",
		1: "changwu",
		2: "CW",
	},
	873: {
		0: "长兴县",
		1: "changxing",
		2: "CX",
	},
	1365: {
		0: "长阳土家族自治县",
		1: "changyang",
		2: "CY",
	},
	3199: {
		0: "长野",
		1: "nagano",
		2: "QNG",
	},
	1242: {
		0: "长垣县",
		1: "changyuan",
		2: "CY",
	},
	38: {
		0: "长治",
		1: "changzhi",
		2: "CZ",
	},
	598: {
		0: "长子县",
		1: "changzi",
		2: "CZ",
	},
	197: {
		0: "常德",
		1: "changde",
		2: "CD",
	},
	1407: {
		0: "常宁市",
		1: "changning",
		2: "CN",
	},
	889: {
		0: "常山县",
		1: "changshan",
		2: "CS",
	},
	417: {
		0: "常熟",
		1: "changshu",
		2: "CS",
	},
	93: {
		0: "常州",
		1: "changzhou",
		2: "CZ",
	},
	122: {
		0: "巢湖",
		1: "chaohu",
		2: "CH",
	},
	3179: {
		0: "朝鲜",
		1: "northkorea",
		2: "PRK",
	},
	68: {
		0: "朝阳",
		1: "chaoyang",
		2: "CY",
	},
	690: {
		0: "朝阳县",
		1: "chaoyangxian",
		2: "CYX",
	},
	1490: {
		0: "潮安区",
		1: "chaoan",
		2: "CA",
	},
	4438: {
		0: "潮阳",
		1: "chaoyangshantou",
		2: "CY",
	},
	221: {
		0: "潮州",
		1: "chaozhou",
		2: "CZ",
	},
	200: {
		0: "郴州",
		1: "chenzhou",
		2: "CZ",
	},
	1443: {
		0: "辰溪县",
		1: "chenxi",
		2: "CX",
	},
	3554: {
		0: "陈巴尔虎旗",
		1: "chenhuqi",
		2: "CBE",
	},
	2181: {
		0: "称多县",
		1: "chenduo",
		2: "CD",
	},
	562: {
		0: "成安县",
		1: "chengan",
		2: "CA",
	},
	8: {
		0: "成都",
		1: "chengdu",
		2: "CD",
	},
	1203: {
		0: "成武县",
		1: "chengwu",
		2: "CW",
	},
	2132: {
		0: "成县",
		1: "chengxian",
		2: "CX",
	},
	1816: {
		0: "呈贡区",
		1: "chenggong",
		2: "CG",
	},
	31: {
		0: "承德",
		1: "chengde",
		2: "CD",
	},
	469: {
		0: "承德县",
		1: "chengdexian",
		2: "CDX",
	},
	1440: {
		0: "城步苗族自治县",
		1: "chengbu",
		2: "CB",
	},
	2052: {
		0: "城固县",
		1: "chenggu",
		2: "CG",
	},
	2291: {
		0: "城口县",
		1: "chengkou",
		2: "CK",
	},
	2027: {
		0: "澄城县",
		1: "chengcheng",
		2: "CC",
	},
	4439: {
		0: "澄海",
		1: "chenghai",
		2: "CH",
	},
	1833: {
		0: "澄江县",
		1: "chengjian",
		2: "CJ",
	},
	393: {
		0: "澄迈县",
		1: "chengmai",
		2: "CM",
	},
	125: {
		0: "池州",
		1: "chizhou",
		2: "CZ",
	},
	1125: {
		0: "茌平县",
		1: "chiping",
		2: "CP",
	},
	1348: {
		0: "赤壁市",
		1: "chibi",
		2: "CB",
	},
	467: {
		0: "赤城县",
		1: "chicheng",
		2: "CC",
	},
	4378: {
		0: "赤道几内亚",
		1: "equatorialguine",
		2: "BSG",
	},
	49: {
		0: "赤峰",
		1: "chifeng",
		2: "CF",
	},
	1745: {
		0: "赤水市",
		1: "chishui",
		2: "CS",
	},
	2377: {
		0: "冲绳",
		1: "okinawa",
		2: "OKA",
	},
	468: {
		0: "崇礼区",
		1: "chongli",
		2: "CL",
	},
	3580: {
		0: "崇明区",
		1: "chongmingqu",
		2: "CMX",
	},
	1091: {
		0: "崇仁县",
		1: "chongren",
		2: "CR",
	},
	2122: {
		0: "崇信县",
		1: "chongxin",
		2: "CX",
	},
	1351: {
		0: "崇阳县",
		1: "chongyang",
		2: "CY",
	},
	1066: {
		0: "崇义县",
		1: "chongyi",
		2: "CY",
	},
	1607: {
		0: "崇州市",
		1: "chongzhou",
		2: "CZ",
	},
	394: {
		0: "崇左",
		1: "chongzuo",
		2: "CZ",
	},
	119: {
		0: "滁州",
		1: "chuzhou",
		2: "CZ",
	},
	1898: {
		0: "楚雄市",
		1: "chuxiong",
		2: "CX",
	},
	272: {
		0: "楚雄州",
		1: "chuxiongzhou",
		2: "CXZ",
	},
	15053: {
		0: "钏路",
		1: "Kushiro City",
		2: "KC",
	},
	12867: {
		0: "春川",
		1: "Chuncheon",
		2: "CHC",
	},
	4099: {
		0: "春蓬",
		1: "chumphon",
		2: "CHP",
	},
	10725: {
		0: "春武里",
		1: "Chon-Buri",
		2: "CHO",
	},
	872: {
		0: "淳安县",
		1: "chunan",
		2: "CA",
	},
	2040: {
		0: "淳化县",
		1: "chunhua",
		2: "CH",
	},
	3203: {
		0: "茨城",
		1: "ibaraki",
		2: "GSI",
	},
	1380: {
		0: "慈利县",
		1: "cili",
		2: "CL",
	},
	421: {
		0: "慈溪",
		1: "cixi",
		2: "CX",
	},
	565: {
		0: "磁县",
		1: "cixian",
		2: "CX",
	},
	413: {
		0: "从化区",
		1: "conghua",
		2: "CH",
	},
	1791: {
		0: "从江县",
		1: "congjian",
		2: "CJ",
	},
	1973: {
		0: "措美县",
		1: "cuomei",
		2: "CM",
	},
	2003: {
		0: "措勤县",
		1: "cuoqin",
		2: "CQ",
	},
	1977: {
		0: "错那县",
		1: "cuona",
		2: "CN",
	},
	9: {
		0: "重庆",
		1: "chongqing",
		2: "CQ",
	},
	3530: {
		0: "达尔罕茂明安联合旗",
		1: "daerhanqi",
		2: "DEH",
	},
	10236: {
		0: "达卡",
		1: "Dhaka",
		2: "DHA",
	},
	4257: {
		0: "达拉斯",
		1: "dallas",
		2: "DAL",
	},
	3543: {
		0: "达拉特旗",
		1: "dalateqi",
		2: "DLT",
	},
	11097: {
		0: "达勒姆",
		1: "Durham",
		2: "DUR",
	},
	4026: {
		0: "达尼丁",
		1: "dunedin",
		2: "DUD",
	},
	2176: {
		0: "达日县",
		1: "dari",
		2: "DR",
	},
	251: {
		0: "达州",
		1: "dazhou",
		2: "DZ",
	},
	1937: {
		0: "达孜区",
		1: "dazi",
		2: "DZ",
	},
	728: {
		0: "大安市",
		1: "daan",
		2: "DA",
	},
	2374: {
		0: "大阪",
		1: "osaka",
		2: "OSA",
	},
	15239: {
		0: "大堡礁",
		1: "gre-1",
		2: "GRE",
	},
	496: {
		0: "大厂回族自治县",
		1: "dachang",
		2: "DC",
	},
	3228: {
		0: "大城",
		1: "ayutthaya",
		2: "AYT",
	},
	494: {
		0: "大城县",
		1: "dacheng",
		2: "DC",
	},
	15117: {
		0: "大岛",
		1: "IslandofHawai",
		2: "IOH",
	},
	1763: {
		0: "大方县",
		1: "dafang",
		2: "DF",
	},
	3193: {
		0: "大分",
		1: "oita",
		2: "OIT",
	},
	846: {
		0: "大丰区",
		1: "dafeng",
		2: "DF",
	},
	1847: {
		0: "大关县",
		1: "daguan",
		2: "DG",
	},
	1593: {
		0: "大化瑶族自治县",
		1: "dahua",
		2: "DH",
	},
	15073: {
		0: "大津",
		1: "Otsu",
		2: "OTS",
	},
	3097: {
		0: "大叻",
		1: "dalat",
		2: "DL",
	},
	3590: {
		0: "大理市",
		1: "dalishi",
		2: "DLS",
	},
	277: {
		0: "大理州",
		1: "dali",
		2: "DL",
	},
	2025: {
		0: "大荔县",
		1: "dalixian",
		2: "DL",
	},
	19: {
		0: "大连",
		1: "dalian",
		2: "DL",
	},
	563: {
		0: "大名县",
		1: "daming",
		2: "DM",
	},
	642: {
		0: "大宁县",
		1: "daning",
		2: "DN",
	},
	1485: {
		0: "大埔县",
		1: "dapu",
		2: "DP",
	},
	84: {
		0: "大庆",
		1: "daqing",
		2: "DQ",
	},
	3183: {
		0: "大邱",
		1: "daegu",
		2: "DAG",
	},
	713: {
		0: "大石桥市",
		1: "dashiqiao",
		2: "DSQ",
	},
	15227: {
		0: "大提顿国家公园",
		1: "gra-3",
		2: "GRA",
	},
	10870: {
		0: "大田",
		1: "dae",
		2: "DAE",
	},
	1002: {
		0: "大田县",
		1: "datian",
		2: "DT",
	},
	2156: {
		0: "大通回族土族自治县",
		1: "datongzzxian",
		2: "DT",
	},
	3503: {
		0: "大通区",
		1: "datongqu",
		2: "DTQ",
	},
	36: {
		0: "大同",
		1: "datong",
		2: "DT",
	},
	715: {
		0: "大洼区",
		1: "dawa",
		2: "DW",
	},
	1335: {
		0: "大悟县",
		1: "dawu",
		2: "DW",
	},
	4195: {
		0: "大西洋城",
		1: "atlanticcity",
		2: "DXY",
	},
	2405: {
		0: "大溪地",
		1: "tahiti",
		2: "DXD",
	},
	15229: {
		0: "大峡谷国家公园",
		1: "gra-4",
		2: "GRA",
	},
	1571: {
		0: "大新县",
		1: "daxin",
		2: "DX",
	},
	91: {
		0: "大兴安岭",
		1: "daxinganling",
		2: "DXA",
	},
	15240: {
		0: "大洋路",
		1: "gre-2",
		2: "GRE",
	},
	1903: {
		0: "大姚县",
		1: "dayao",
		2: "DY",
	},
	1346: {
		0: "大冶市",
		1: "daye",
		2: "DY",
	},
	1611: {
		0: "大邑县",
		1: "dayi",
		2: "DY",
	},
	1642: {
		0: "大英县",
		1: "daying",
		2: "DY",
	},
	1064: {
		0: "大余县",
		1: "dayu",
		2: "DY",
	},
	1677: {
		0: "大竹县",
		1: "dazhu",
		2: "DZ",
	},
	2285: {
		0: "大足区",
		1: "dazu",
		2: "DZ",
	},
	4340: {
		0: "代尔夫特",
		1: "delft",
		2: "DEL",
	},
	610: {
		0: "代县",
		1: "daixian",
		2: "DX",
	},
	881: {
		0: "岱山县",
		1: "daishan",
		2: "DS",
	},
	1708: {
		0: "丹巴县",
		1: "danba",
		2: "DB",
	},
	10893: {
		0: "丹布勒",
		1: "Dambulla",
		2: "DAM",
	},
	61: {
		0: "丹东",
		1: "dandong",
		2: "DD",
	},
	2082: {
		0: "丹凤县",
		1: "danfeng",
		2: "DF",
	},
	4189: {
		0: "丹佛",
		1: "denver",
		2: "DAF",
	},
	10586: {
		0: "丹吉尔",
		1: "Tangier",
		2: "TAN",
	},
	1316: {
		0: "丹江口市",
		1: "danjiangkou",
		2: "DJK",
	},
	1685: {
		0: "丹棱县",
		1: "danleng",
		2: "DL",
	},
	3234: {
		0: "丹麦",
		1: "denmark",
		2: "DNK",
	},
	864: {
		0: "丹阳市",
		1: "danyang",
		2: "DY",
	},
	1794: {
		0: "丹寨县",
		1: "danzhai",
		2: "DZ",
	},
	1304: {
		0: "郸城县",
		1: "dancheng",
		2: "DC",
	},
	358: {
		0: "儋州",
		1: "danzhou",
		2: "DZ",
	},
	15105: {
		0: "淡路岛",
		1: "Awajishima",
		2: "AS",
	},
	946: {
		0: "当涂县",
		1: "dangtou",
		2: "DT",
	},
	1933: {
		0: "当雄县",
		1: "dangxiong",
		2: "DX",
	},
	1361: {
		0: "当阳市",
		1: "dangyang",
		2: "DY",
	},
	2133: {
		0: "宕昌县",
		1: "dangcang",
		2: "DC",
	},
	923: {
		0: "砀山县",
		1: "dangshan",
		2: "DS",
	},
	1711: {
		0: "道孚县",
		1: "daofu",
		2: "DF",
	},
	1424: {
		0: "道县",
		1: "daoxian",
		2: "DX",
	},
	1755: {
		0: "道真仡佬族苗族自治县",
		1: "daozhen",
		2: "DZ",
	},
	1722: {
		0: "稻城县",
		1: "daocheng",
		2: "DC",
	},
	1723: {
		0: "得荣县",
		1: "derong",
		2: "DR",
	},
	1047: {
		0: "德安县",
		1: "dean",
		2: "DA",
	},
	1578: {
		0: "德保县",
		1: "debao",
		2: "DB",
	},
	1725: {
		0: "德昌县",
		1: "decang",
		2: "DC",
	},
	1715: {
		0: "德格县",
		1: "dege",
		2: "DG",
	},
	3431: {
		0: "德国",
		1: "germany",
		2: "DEU",
	},
	3251: {
		0: "德黑兰",
		1: "tehran",
		2: "DHL",
	},
	278: {
		0: "德宏",
		1: "dehong",
		2: "DH",
	},
	1014: {
		0: "德化县",
		1: "dehua",
		2: "DH",
	},
	724: {
		0: "德惠市",
		1: "dehui",
		2: "DH",
	},
	1774: {
		0: "德江县",
		1: "dejian",
		2: "DJ",
	},
	15162: {
		0: "德克萨斯州",
		1: "Texas",
		2: "TEX",
	},
	3442: {
		0: "德累斯顿",
		1: "dresden",
		2: "DSD",
	},
	3317: {
		0: "德里",
		1: "delhi",
		2: "DEL",
	},
	2185: {
		0: "德令哈市",
		1: "delingha",
		2: "DLH",
	},
	1884: {
		0: "德钦县",
		1: "deqin",
		2: "DQ",
	},
	874: {
		0: "德清县",
		1: "deqing",
		2: "DQ",
	},
	1512: {
		0: "德庆县",
		1: "deqingxian",
		2: "DQ",
	},
	1077: {
		0: "德兴市",
		1: "dexing",
		2: "DX",
	},
	241: {
		0: "德阳",
		1: "deyang",
		2: "DY",
	},
	156: {
		0: "德州",
		1: "dezhou",
		2: "DZ",
	},
	705: {
		0: "灯塔市",
		1: "dengta",
		2: "DT",
	},
	15099: {
		0: "登别",
		1: "Noboribetsu",
		2: "NOB",
	},
	1210: {
		0: "登封市",
		1: "dengfeng",
		2: "DF",
	},
	4401: {
		0: "登嘉楼",
		1: "terengganu",
		2: "TCG",
	},
	1280: {
		0: "邓州市",
		1: "dengzhou",
		2: "DZ",
	},
	679: {
		0: "磴口县",
		1: "dengkou",
		2: "DK",
	},
	3145: {
		0: "迪拜",
		1: "dubai",
		2: "DXB",
	},
	281: {
		0: "迪庆",
		1: "diqing",
		2: "DQ",
	},
	4183: {
		0: "底特律",
		1: "detroit",
		2: "DTL",
	},
	4383: {
		0: "地拉那",
		1: "tirana",
		2: "DLN",
	},
	2394: {
		0: "第戎",
		1: "dijon",
		2: "DIJ",
	},
	4035: {
		0: "蒂马鲁",
		1: "timaru",
		2: "TIU",
	},
	15255: {
		0: "点评境外实验室",
		1: "dia",
		2: "DPF",
	},
	4432: {
		0: "点评实验室",
		1: "dplab",
		2: "DP",
	},
	1523: {
		0: "电白区",
		1: "dianbai",
		2: "DB",
	},
	2288: {
		0: "垫江县",
		1: "dianjian",
		2: "DJ",
	},
	695: {
		0: "调兵山市",
		1: "diaobingshan",
		2: "DBS",
	},
	2152: {
		0: "迭部县",
		1: "diebu",
		2: "DB",
	},
	1953: {
		0: "丁青县",
		1: "dingqing",
		2: "DQ",
	},
	395: {
		0: "定安县",
		1: "dingan",
		2: "DA",
	},
	2065: {
		0: "定边县",
		1: "dingbian",
		2: "DB",
	},
	1990: {
		0: "定结县",
		1: "dingjie",
		2: "DJ",
	},
	1069: {
		0: "定南县",
		1: "dingnan",
		2: "DN",
	},
	1982: {
		0: "定日县",
		1: "dingri",
		2: "DR",
	},
	1202: {
		0: "定陶区",
		1: "dingtao",
		2: "DT",
	},
	309: {
		0: "定西",
		1: "dingxi",
		2: "DX",
	},
	608: {
		0: "定襄县",
		1: "dingxiang",
		2: "DX",
	},
	506: {
		0: "定兴县",
		1: "dingxing",
		2: "DX",
	},
	944: {
		0: "定远县",
		1: "dingyuan",
		2: "DY",
	},
	497: {
		0: "定州市",
		1: "dingzhou",
		2: "DZ",
	},
	1126: {
		0: "东阿县",
		1: "donga",
		2: "DA",
	},
	1423: {
		0: "东安县",
		1: "dongan",
		2: "DA",
	},
	3232: {
		0: "东帝汶",
		1: "easttimor",
		2: "TLS",
	},
	396: {
		0: "东方",
		1: "dongfang",
		2: "DF",
	},
	745: {
		0: "东丰县",
		1: "dongfeng",
		2: "DF",
	},
	711: {
		0: "东港市",
		1: "donggang",
		2: "DG",
	},
	534: {
		0: "东光县",
		1: "dongguang",
		2: "DG",
	},
	836: {
		0: "东海县",
		1: "donghai",
		2: "DH",
	},
	2372: {
		0: "东京",
		1: "tokyo",
		2: "TYO",
	},
	4465: {
		0: "东坑镇",
		1: "dongkeng",
		2: "DK",
	},
	1590: {
		0: "东兰县",
		1: "donglan",
		2: "DL",
	},
	746: {
		0: "东辽县",
		1: "dongliao",
		2: "DL",
	},
	1208: {
		0: "东明县",
		1: "dongming",
		2: "DM",
	},
	813: {
		0: "东宁市",
		1: "dongning",
		2: "DN",
	},
	1194: {
		0: "东平县",
		1: "dongping",
		2: "DP",
	},
	1020: {
		0: "东山县",
		1: "dongshan",
		2: "DS",
	},
	845: {
		0: "东台市",
		1: "dongtai",
		2: "DT",
	},
	219: {
		0: "东莞",
		1: "dongguan",
		2: "DG",
	},
	3571: {
		0: "东乌珠穆沁旗",
		1: "dongwuqinqi",
		2: "DWQ",
	},
	1096: {
		0: "东乡区",
		1: "dongxiang",
		2: "DX",
	},
	2146: {
		0: "东乡族自治县",
		1: "dongxiangzu",
		2: "DXZ",
	},
	1567: {
		0: "东兴市",
		1: "dongxing",
		2: "DX",
	},
	894: {
		0: "东阳",
		1: "dongyang",
		2: "DY",
	},
	147: {
		0: "东营",
		1: "dongying",
		2: "DY",
	},
	1482: {
		0: "东源县",
		1: "dongyuan",
		2: "DY",
	},
	972: {
		0: "东至县",
		1: "dongzhi",
		2: "DZ",
	},
	1437: {
		0: "洞口县",
		1: "dongkou",
		2: "DK",
	},
	910: {
		0: "洞头区",
		1: "dongtou",
		2: "DT",
	},
	15088: {
		0: "洞爷湖",
		1: "Toyako",
		2: "TOY",
	},
	1592: {
		0: "都安瑶族自治县",
		1: "duan",
		2: "DA",
	},
	2470: {
		0: "都柏林",
		1: "dublin",
		2: "DBL",
	},
	1049: {
		0: "都昌县",
		1: "ducang",
		2: "DC",
	},
	1604: {
		0: "都江堰市",
		1: "dujiangyan",
		2: "DJY",
	},
	2187: {
		0: "都兰县",
		1: "dulan",
		2: "DL",
	},
	2463: {
		0: "都灵",
		1: "turin",
		2: "DL",
	},
	1795: {
		0: "都匀市",
		1: "duyun",
		2: "DY",
	},
	4442: {
		0: "斗门",
		1: "doumen",
		2: "DM",
	},
	1800: {
		0: "独山县",
		1: "dushan",
		2: "DS",
	},
	3269: {
		0: "杜布罗夫尼克",
		1: "dubrovnik",
		2: "DBV",
	},
	791: {
		0: "杜尔伯特蒙古族自治县",
		1: "duerbote",
		2: "DEB",
	},
	3210: {
		0: "杜马盖地",
		1: "dumaguete",
		2: "DMG",
	},
	3118: {
		0: "杜塞尔多夫",
		1: "dusseldorf",
		2: "DUS",
	},
	3469: {
		0: "杜伊斯堡",
		1: "duisburg",
		2: "DU",
	},
	1936: {
		0: "堆龙德庆区",
		1: "duilongdeqing",
		2: "DLD",
	},
	757: {
		0: "敦化市",
		1: "dunhua",
		2: "DH",
	},
	2103: {
		0: "敦煌市",
		1: "dunhuang",
		2: "DH",
	},
	3388: {
		0: "多哥",
		1: "togo",
		2: "TGO",
	},
	10163: {
		0: "多哈",
		1: "Doha",
		2: "DOH",
	},
	2413: {
		0: "多伦多",
		1: "toronto",
		2: "DLD",
	},
	683: {
		0: "多伦县",
		1: "duolun",
		2: "DL",
	},
	3390: {
		0: "多米尼加",
		1: "dominican",
		2: "DOM",
	},
	3389: {
		0: "多米尼克",
		1: "dominica",
		2: "DMA",
	},
	3459: {
		0: "多特蒙德",
		1: "dortmund",
		2: "DOT",
	},
	15152: {
		0: "俄亥俄州",
		1: "Ohio",
		2: "OHI",
	},
	15155: {
		0: "俄勒冈州",
		1: "Oregon",
		2: "ORE",
	},
	3258: {
		0: "俄罗斯",
		1: "russia",
		2: "RUS",
	},
	1651: {
		0: "峨边彝族自治县",
		1: "ebian",
		2: "EB",
	},
	1646: {
		0: "峨眉山市",
		1: "emeishan",
		2: "EMS",
	},
	1837: {
		0: "峨山彝族自治县",
		1: "eshan",
		2: "ES",
	},
	671: {
		0: "额尔古纳市",
		1: "eerguna",
		2: "EEG",
	},
	3579: {
		0: "额济纳旗",
		1: "ejinaqi",
		2: "EJN",
	},
	2270: {
		0: "额敏县",
		1: "emin",
		2: "EM",
	},
	3333: {
		0: "厄瓜多尔",
		1: "ecuador",
		2: "ECU",
	},
	3334: {
		0: "厄立特里亚",
		1: "eritrea",
		2: "ERI",
	},
	51: {
		0: "鄂尔多斯",
		1: "eerduosi",
		2: "EE",
	},
	3552: {
		0: "鄂伦春自治旗",
		1: "elunchunqi",
		2: "ELC",
	},
	3546: {
		0: "鄂托克旗",
		1: "eqi",
		2: "EQ",
	},
	3545: {
		0: "鄂托克前旗",
		1: "eqianqi",
		2: "EQQ",
	},
	3553: {
		0: "鄂温克族自治旗",
		1: "ewenkeqi",
		2: "EWK",
	},
	181: {
		0: "鄂州",
		1: "ezhou",
		2: "EZ",
	},
	1503: {
		0: "恩平市",
		1: "enping",
		2: "EP",
	},
	188: {
		0: "恩施",
		1: "enshizhou",
		2: "ESZ",
	},
	1368: {
		0: "恩施市",
		1: "enshi",
		2: "ES",
	},
	1892: {
		0: "洱源县",
		1: "eryuan",
		2: "EY",
	},
	682: {
		0: "二连浩特市",
		1: "erlianhaote",
		2: "ELH",
	},
	2331: {
		0: "法国",
		1: "france",
		2: "FRA",
	},
	687: {
		0: "法库县",
		1: "fakun",
		2: "FK",
	},
	2426: {
		0: "法兰克福",
		1: "frankfurt",
		2: "FLK",
	},
	4088: {
		0: "法罗群岛",
		1: "faroeislands",
		2: "FAI",
	},
	4087: {
		0: "法属波利尼西亚",
		1: "frenchpolynesia",
		2: "PF",
	},
	4086: {
		0: "法属圭亚那",
		1: "frenchguiana",
		2: "GF",
	},
	3216: {
		0: "藩切",
		1: "phanthiet",
		2: "PTH",
	},
	948: {
		0: "繁昌县",
		1: "fancang",
		2: "FC",
	},
	611: {
		0: "繁峙县",
		1: "fanzhi",
		2: "FZ",
	},
	1252: {
		0: "范县",
		1: "fanxian",
		2: "FX",
	},
	1282: {
		0: "方城县",
		1: "fangcheng",
		2: "FC",
	},
	652: {
		0: "方山县",
		1: "fangshan",
		2: "FS",
	},
	767: {
		0: "方正县",
		1: "fangzheng",
		2: "FZ",
	},
	229: {
		0: "防城港",
		1: "fangchenggang",
		2: "FCG",
	},
	1319: {
		0: "房县",
		1: "fangxian",
		2: "FX",
	},
	15100: {
		0: "飞驒高山",
		1: "Hida Takayama",
		2: "HT",
	},
	2327: {
		0: "菲律宾",
		1: "philippines",
		2: "PHL",
	},
	4017: {
		0: "菲斯",
		1: "fes",
		2: "FES",
	},
	1192: {
		0: "肥城市",
		1: "feicheng",
		2: "FC",
	},
	921: {
		0: "肥东县",
		1: "feidong",
		2: "FD",
	},
	922: {
		0: "肥西县",
		1: "feixi",
		2: "FX",
	},
	566: {
		0: "肥乡区",
		1: "feixiang",
		2: "FX",
	},
	2328: {
		0: "斐济",
		1: "fiji",
		2: "FJI",
	},
	3108: {
		0: "费城",
		1: "philadelphia",
		2: "PL",
	},
	11130: {
		0: "费尔班克斯",
		1: "Fairbanks",
		2: "FAI",
	},
	3349: {
		0: "费特希耶",
		1: "fethiye",
		2: "FTY",
	},
	1177: {
		0: "费县",
		1: "feixian",
		2: "FX",
	},
	1056: {
		0: "分宜县",
		1: "fenyi",
		2: "FY",
	},
	4294: {
		0: "芬兰",
		1: "finland",
		2: "FIN",
	},
	645: {
		0: "汾西县",
		1: "fenxi",
		2: "FX",
	},
	647: {
		0: "汾阳市",
		1: "fengyang",
		2: "FY",
	},
	1098: {
		0: "丰城市",
		1: "fengchengshi",
		2: "FC",
	},
	2290: {
		0: "丰都县",
		1: "fengdu",
		2: "FD",
	},
	474: {
		0: "丰宁满族自治县",
		1: "fengning",
		2: "FN",
	},
	15089: {
		0: "丰桥",
		1: "Toyohashi",
		2: "TOY",
	},
	1486: {
		0: "丰顺县",
		1: "fengshun",
		2: "FS",
	},
	833: {
		0: "丰县",
		1: "fengxian",
		2: "FX",
	},
	672: {
		0: "丰镇市",
		1: "fengzhen",
		2: "FZ",
	},
	1511: {
		0: "封开县",
		1: "fengkai",
		2: "FK",
	},
	1241: {
		0: "封丘县",
		1: "fengqiu",
		2: "FQ",
	},
	710: {
		0: "凤城市",
		1: "fengcheng",
		2: "FC",
	},
	1751: {
		0: "凤冈县",
		1: "fenggang",
		2: "FG",
	},
	4258: {
		0: "凤凰城",
		1: "phoenix",
		2: "FHC",
	},
	1458: {
		0: "凤凰县",
		1: "fenghuang",
		2: "FH",
	},
	1867: {
		0: "凤庆县",
		1: "fengqing",
		2: "FQ",
	},
	1589: {
		0: "凤山县",
		1: "fengshan",
		2: "FS",
	},
	939: {
		0: "凤台县",
		1: "fengtai",
		2: "FT",
	},
	2049: {
		0: "凤县",
		1: "fengxianxian",
		2: "FX",
	},
	2042: {
		0: "凤翔县",
		1: "fengxiang",
		2: "FX",
	},
	945: {
		0: "凤阳县",
		1: "fengyangxian",
		2: "FY",
	},
	422: {
		0: "奉化",
		1: "fenghua",
		2: "FH",
	},
	2296: {
		0: "奉节县",
		1: "fengjie",
		2: "FJ",
	},
	1101: {
		0: "奉新县",
		1: "fengxin",
		2: "FX",
	},
	3257: {
		0: "佛得角",
		1: "capeverde",
		2: "CPV",
	},
	1466: {
		0: "佛冈县",
		1: "fogang",
		2: "FG",
	},
	4255: {
		0: "佛罗里达群岛",
		1: "floridakeys",
		2: "FK",
	},
	15114: {
		0: "佛罗里达州",
		1: "Florida",
		2: "FLO",
	},
	2459: {
		0: "佛罗伦萨",
		1: "florence",
		2: "FLL",
	},
	2060: {
		0: "佛坪县",
		1: "fopin",
		2: "FP",
	},
	208: {
		0: "佛山",
		1: "foshan",
		2: "FS",
	},
	15165: {
		0: "弗吉尼亚州",
		1: "Virginia",
		2: "VIR",
	},
	3263: {
		0: "弗拉基米尔",
		1: "vladimir",
		2: "VDM",
	},
	3432: {
		0: "弗莱堡",
		1: "freiburg",
		2: "FLB",
	},
	10410: {
		0: "弗雷斯诺",
		1: "Fresno",
		2: "FRE",
	},
	2044: {
		0: "扶风县",
		1: "fufeng",
		2: "FF",
	},
	1299: {
		0: "扶沟县",
		1: "fugou",
		2: "FG",
	},
	1570: {
		0: "扶绥县",
		1: "fusui",
		2: "FS",
	},
	732: {
		0: "扶余市",
		1: "fuyu",
		2: "FY",
	},
	1053: {
		0: "浮梁县",
		1: "fuliang",
		2: "FL",
	},
	638: {
		0: "浮山县",
		1: "fushan",
		2: "FS",
	},
	4427: {
		0: "涪陵区",
		1: "fuling",
		2: "FL",
	},
	1030: {
		0: "福安市",
		1: "fuan",
		2: "FA",
	},
	1031: {
		0: "福鼎",
		1: "fuding",
		2: "FD",
	},
	2505: {
		0: "福冈",
		1: "fukuoka",
		2: "FG",
	},
	1880: {
		0: "福贡县",
		1: "fugong",
		2: "FG",
	},
	2278: {
		0: "福海县",
		1: "fuhai",
		2: "FH",
	},
	4345: {
		0: "福伦丹",
		1: "volendam",
		2: "VOL",
	},
	433: {
		0: "福清",
		1: "fuqing",
		2: "FQ",
	},
	1796: {
		0: "福泉市",
		1: "fuquan",
		2: "FQ",
	},
	3116: {
		0: "福森",
		1: "fussen",
		2: "FS",
	},
	14: {
		0: "福州",
		1: "fuzhou",
		2: "FZ",
	},
	478: {
		0: "抚宁区",
		1: "funingqu",
		2: "FN",
	},
	59: {
		0: "抚顺",
		1: "fushun",
		2: "FS",
	},
	700: {
		0: "抚顺县",
		1: "lnfushunxian",
		2: "FSX",
	},
	753: {
		0: "抚松县",
		1: "fusong",
		2: "FS",
	},
	801: {
		0: "抚远市",
		1: "fuyuan",
		2: "FY",
	},
	143: {
		0: "抚州",
		1: "jiangxifuzhou",
		2: "FZ",
	},
	2062: {
		0: "府谷县",
		1: "fugu",
		2: "FG",
	},
	2370: {
		0: "釜山",
		1: "busan",
		2: "PUS",
	},
	527: {
		0: "阜城县",
		1: "fucheng",
		2: "FC",
	},
	2244: {
		0: "阜康市",
		1: "fukang",
		2: "FK",
	},
	934: {
		0: "阜南县",
		1: "funan",
		2: "FN",
	},
	848: {
		0: "阜宁县",
		1: "funingxian",
		2: "FN",
	},
	515: {
		0: "阜平县",
		1: "fuping",
		2: "FP",
	},
	64: {
		0: "阜新",
		1: "fuxin",
		2: "FX",
	},
	694: {
		0: "阜新蒙古族自治县",
		1: "fuxinxian",
		2: "FXX",
	},
	120: {
		0: "阜阳",
		1: "fuyang",
		2: "FY",
	},
	1603: {
		0: "富川瑶族自治县",
		1: "fuchuan",
		2: "FC",
	},
	3601: {
		0: "富春江",
		1: "fuchunjiang",
		2: "FCJ",
	},
	10037: {
		0: "富国岛",
		1: "Phu-Quoc",
		2: "PHU",
	},
	797: {
		0: "富锦市",
		1: "fujin",
		2: "FJ",
	},
	4478: {
		0: "富拉尔基区",
		1: "fulaerji",
		2: "FLE",
	},
	15101: {
		0: "富良野",
		1: "Furano",
		2: "FUR",
	},
	1818: {
		0: "富民县",
		1: "fumin",
		2: "FM",
	},
	1931: {
		0: "富宁县",
		1: "wszfuning",
		2: "FN",
	},
	2030: {
		0: "富平县",
		1: "fupingxian",
		2: "FP",
	},
	2376: {
		0: "富士山",
		1: "fujisan",
		2: "FJS",
	},
	1654: {
		0: "富顺县",
		1: "fushunxian",
		2: "FS",
	},
	2015: {
		0: "富县",
		1: "fuxian",
		2: "FX",
	},
	869: {
		0: "富阳区",
		1: "fuyangfy",
		2: "FYH",
	},
	779: {
		0: "富裕县",
		1: "fuyuxian",
		2: "FY",
	},
	1827: {
		0: "富源县",
		1: "fuyuanxian",
		2: "FY",
	},
	2277: {
		0: "富蕴县",
		1: "fuyun",
		2: "FY",
	},
	1997: {
		0: "噶尔县",
		1: "geer",
		2: "GE",
	},
	2002: {
		0: "改则县",
		1: "gaize",
		2: "GZ",
	},
	714: {
		0: "盖州市",
		1: "gaizhou",
		2: "GZ",
	},
	2175: {
		0: "甘德县",
		1: "gande",
		2: "GD",
	},
	2096: {
		0: "甘谷县",
		1: "gangu",
		2: "GG",
	},
	1736: {
		0: "甘洛县",
		1: "ganluo",
		2: "GL",
	},
	312: {
		0: "甘南",
		1: "gannanzhou",
		2: "GNZ",
	},
	778: {
		0: "甘南县",
		1: "gannan",
		2: "GN",
	},
	2014: {
		0: "甘泉县",
		1: "ganquan",
		2: "GQ",
	},
	1713: {
		0: "甘孜县",
		1: "ganzixian",
		2: "GZX",
	},
	256: {
		0: "甘孜州",
		1: "ganzi",
		2: "GZ",
	},
	1062: {
		0: "赣县",
		1: "ganxian",
		2: "GX",
	},
	834: {
		0: "赣榆区",
		1: "ganyu",
		2: "GY",
	},
	140: {
		0: "赣州",
		1: "ganzhou",
		2: "GZ",
	},
	3272: {
		0: "冈比亚",
		1: "gambia",
		2: "GMB",
	},
	15012: {
		0: "冈山",
		1: "Okayama",
		2: "OKA",
	},
	2167: {
		0: "刚察县",
		1: "gangcha",
		2: "GC",
	},
	3281: {
		0: "刚果共和国",
		1: "rpblicthecongo",
		2: "CGO",
	},
	3282: {
		0: "刚果民主共和国",
		1: "Democraticcongo",
		2: "COD",
	},
	1996: {
		0: "岗巴县",
		1: "gangba",
		2: "GB",
	},
	2088: {
		0: "皋兰县",
		1: "gaolan",
		2: "GL",
	},
	1100: {
		0: "高安市",
		1: "gaoan",
		2: "GA",
	},
	500: {
		0: "高碑店市",
		1: "gaopaidian",
		2: "GPD",
	},
	2230: {
		0: "高昌区",
		1: "tulufan",
		2: "GC",
	},
	827: {
		0: "高淳区",
		1: "gaochun",
		2: "GC",
	},
	2007: {
		0: "高陵区",
		1: "gaoling",
		2: "GL",
	},
	1147: {
		0: "高密市",
		1: "gaomi",
		2: "GM",
	},
	4481: {
		0: "高明区",
		1: "gaoming",
		2: "GM",
	},
	602: {
		0: "高平市",
		1: "gaoping",
		2: "GP",
	},
	1143: {
		0: "高青县",
		1: "gaoqing",
		2: "GQ",
	},
	15111: {
		0: "高松",
		1: "Takamatsu",
		2: "TAK",
	},
	2110: {
		0: "高台县",
		1: "gaotai",
		2: "GT",
	},
	1128: {
		0: "高唐县",
		1: "gaotang",
		2: "GT",
	},
	1663: {
		0: "高县",
		1: "gaoxian",
		2: "GX",
	},
	2337: {
		0: "高雄",
		1: "kaohsiung",
		2: "KHH",
	},
	511: {
		0: "高阳县",
		1: "gaoyang",
		2: "GY",
	},
	1507: {
		0: "高要区",
		1: "gaoyao",
		2: "GY",
	},
	449: {
		0: "高邑县",
		1: "gaoyi",
		2: "GY",
	},
	426: {
		0: "高邮市",
		1: "gaoyou",
		2: "GY",
	},
	15008: {
		0: "高知",
		1: "Kochi",
		2: "KOC",
	},
	1522: {
		0: "高州市",
		1: "gaozhou",
		2: "GZ",
	},
	440: {
		0: "藁城区",
		1: "gaocheng",
		2: "GC",
	},
	4123: {
		0: "戈尔韦",
		1: "galway",
		2: "GLW",
	},
	3149: {
		0: "哥本哈根",
		1: "copenhagen",
		2: "COP",
	},
	2437: {
		0: "哥德堡",
		1: "gothenburg",
		2: "GDB",
	},
	3342: {
		0: "哥伦比亚",
		1: "colombia",
		2: "COL",
	},
	10243: {
		0: "哥伦比亚",
		1: "Columbia",
		2: "COL",
	},
	4225: {
		0: "哥伦布",
		1: "columbus",
		2: "GLB",
	},
	2500: {
		0: "哥斯达黎加",
		1: "costarica",
		2: "GSD",
	},
	3453: {
		0: "哥廷根",
		1: "goettingen",
		2: "GTG",
	},
	2001: {
		0: "革吉县",
		1: "geji",
		2: "GJ",
	},
	353: {
		0: "格尔木市",
		1: "geermu",
		2: "GME",
	},
	3395: {
		0: "格拉茨",
		1: "graz",
		2: "GAZ",
	},
	4374: {
		0: "格拉纳达",
		1: "granada",
		2: "BLN",
	},
	4074: {
		0: "格拉斯",
		1: "grasse",
		2: "GRS",
	},
	4308: {
		0: "格拉斯哥",
		1: "glasgow",
		2: "GSG",
	},
	4082: {
		0: "格勒诺布尔",
		1: "grenoble",
		2: "GRB",
	},
	4029: {
		0: "格雷茅斯",
		1: "greymouth",
		2: "GMN",
	},
	3348: {
		0: "格雷梅",
		1: "goreme",
		2: "GRM",
	},
	4148: {
		0: "格林德瓦",
		1: "grindelwald",
		2: "GDW",
	},
	4040: {
		0: "格林纳达",
		1: "grenada",
		2: "GRD",
	},
	4042: {
		0: "格鲁吉亚",
		1: "georgia",
		2: "GE",
	},
	4344: {
		0: "格罗宁根",
		1: "groningen",
		2: "GRQ",
	},
	1912: {
		0: "个旧市",
		1: "gejiu",
		2: "GJ",
	},
	670: {
		0: "根河市",
		1: "genhe",
		2: "GH",
	},
	4044: {
		0: "根特",
		1: "ghent",
		2: "GHE",
	},
	1872: {
		0: "耿马傣族佤族自治县",
		1: "genma",
		2: "GM",
	},
	1961: {
		0: "工布江达县",
		1: "gongbujiangda",
		2: "GBJ",
	},
	1357: {
		0: "公安县",
		1: "gongan",
		2: "GA",
	},
	742: {
		0: "公主岭市",
		1: "gongzhuling",
		2: "GZL",
	},
	11518: {
		0: "宫古岛",
		1: "Miyakojima-shi",
		2: "MIY",
	},
	15010: {
		0: "宫崎",
		1: "Miyazaki",
		2: "MIY",
	},
	1546: {
		0: "恭城瑶族自治县",
		1: "gongcheng",
		2: "GC",
	},
	2262: {
		0: "巩留县",
		1: "gongliu",
		2: "GL",
	},
	1212: {
		0: "巩义市",
		1: "gongyi",
		2: "GY",
	},
	1665: {
		0: "珙县",
		1: "gongxian",
		2: "GX",
	},
	2303: {
		0: "共和县",
		1: "gonghe",
		2: "GH",
	},
	3585: {
		0: "共青城市",
		1: "gongqingcheng",
		2: "GQC",
	},
	1969: {
		0: "贡嘎县",
		1: "gongga",
		2: "GG",
	},
	1951: {
		0: "贡觉县",
		1: "gongjue",
		2: "GJ",
	},
	1881: {
		0: "贡山独龙族怒族自治县",
		1: "gongshan",
		2: "GS",
	},
	459: {
		0: "沽源县",
		1: "guyuanxian",
		2: "GY",
	},
	3336: {
		0: "古巴",
		1: "cuba",
		2: "CUB",
	},
	574: {
		0: "古交市",
		1: "gujiao",
		2: "GJ",
	},
	4407: {
		0: "古晋",
		1: "kuching",
		2: "KCH",
	},
	2100: {
		0: "古浪县",
		1: "gulang",
		2: "GL",
	},
	1658: {
		0: "古蔺县",
		1: "gulin",
		2: "GL",
	},
	1036: {
		0: "古田县",
		1: "gutian",
		2: "GT",
	},
	636: {
		0: "古县",
		1: "guxian",
		2: "GX",
	},
	1461: {
		0: "古丈县",
		1: "guzhang",
		2: "GZ",
	},
	1326: {
		0: "谷城县",
		1: "guchengxian",
		2: "GC",
	},
	3613: {
		0: "鼓浪屿",
		1: "gulangyu",
		2: "GLY",
	},
	491: {
		0: "固安县",
		1: "guan",
		2: "GA",
	},
	1294: {
		0: "固始县",
		1: "gushi",
		2: "GS",
	},
	662: {
		0: "固阳县",
		1: "guyang",
		2: "GY",
	},
	324: {
		0: "固原",
		1: "guyuan",
		2: "GY",
	},
	938: {
		0: "固镇县",
		1: "guzhen",
		2: "GZ",
	},
	525: {
		0: "故城县",
		1: "gucheng",
		2: "GC",
	},
	4157: {
		0: "瓜德罗普",
		1: "guadeloupe",
		2: "GP",
	},
	2105: {
		0: "瓜州县",
		1: "anxixian",
		2: "GZ",
	},
	3271: {
		0: "关岛",
		1: "guam",
		2: "GUM",
	},
	1759: {
		0: "关岭布依族苗族自治县",
		1: "guanling",
		2: "GL",
	},
	1127: {
		0: "冠县",
		1: "guanxian",
		2: "GX",
	},
	571: {
		0: "馆陶县",
		1: "guantao",
		2: "GT",
	},
	837: {
		0: "灌南县",
		1: "guannan",
		2: "GN",
	},
	1541: {
		0: "灌阳县",
		1: "guanyang",
		2: "GY",
	},
	835: {
		0: "灌云县",
		1: "guanyun",
		2: "GY",
	},
	1293: {
		0: "光山县",
		1: "guangshan",
		2: "GS",
	},
	994: {
		0: "光泽县",
		1: "guangze",
		2: "GZ",
	},
	10992: {
		0: "光州",
		1: "gwa",
		2: "GWA",
	},
	250: {
		0: "广安",
		1: "guangan",
		2: "GA",
	},
	1097: {
		0: "广昌县",
		1: "guangcang",
		2: "GC",
	},
	3209: {
		0: "广岛",
		1: "hiroshima",
		2: "HRS",
	},
	977: {
		0: "广德县",
		1: "guangde",
		2: "GD",
	},
	1079: {
		0: "广丰区",
		1: "guangfeng",
		2: "GF",
	},
	1626: {
		0: "广汉市",
		1: "guanghan",
		2: "GH",
	},
	2144: {
		0: "广河县",
		1: "guanghe",
		2: "GH",
	},
	584: {
		0: "广灵县",
		1: "guangling",
		2: "GL",
	},
	1930: {
		0: "广南县",
		1: "guangnan",
		2: "GN",
	},
	1509: {
		0: "广宁县",
		1: "guangning",
		2: "GN",
	},
	570: {
		0: "广平县",
		1: "guangping",
		2: "GP",
	},
	1141: {
		0: "广饶县",
		1: "guangrao",
		2: "GR",
	},
	1367: {
		0: "广水市",
		1: "guangshui",
		2: "GS",
	},
	243: {
		0: "广元",
		1: "guangyuan",
		2: "GY",
	},
	4: {
		0: "广州",
		1: "guangzhou",
		2: "GZ",
	},
	554: {
		0: "广宗县",
		1: "guangzong",
		2: "GP",
	},
	3363: {
		0: "圭亚那",
		1: "guyana",
		2: "GUY",
	},
	15180: {
		0: "硅谷",
		1: "SiliconValley",
		2: "SV",
	},
	2305: {
		0: "贵德县",
		1: "guide",
		2: "GD",
	},
	1798: {
		0: "贵定县",
		1: "guiding",
		2: "GD",
	},
	231: {
		0: "贵港",
		1: "guigang",
		2: "GG",
	},
	2307: {
		0: "贵南县",
		1: "guinan",
		2: "GN",
	},
	1054: {
		0: "贵溪市",
		1: "guixi",
		2: "GX",
	},
	258: {
		0: "贵阳",
		1: "guiyang",
		2: "GY",
	},
	1421: {
		0: "桂东县",
		1: "guidong",
		2: "GD",
	},
	226: {
		0: "桂林",
		1: "guilin",
		2: "GL",
	},
	1557: {
		0: "桂平市",
		1: "guiping",
		2: "GP",
	},
	1415: {
		0: "桂阳县",
		1: "guiyangxian",
		2: "GY",
	},
	16000: {
		0: "国外其他",
		1: "guowaiqita",
		2: "GWQ",
	},
	318: {
		0: "果洛",
		1: "guoluo",
		2: "GL",
	},
	928: {
		0: "涡阳县",
		1: "woyang",
		2: "GY",
	},
	2279: {
		0: "哈巴河县",
		1: "habahe",
		2: "HBH",
	},
	79: {
		0: "哈尔滨",
		1: "haerbin",
		2: "HB",
	},
	3396: {
		0: "哈尔施塔特",
		1: "hallstatt",
		2: "HES",
	},
	2233: {
		0: "哈密市",
		1: "hami",
		2: "HM",
	},
	3341: {
		0: "哈萨克斯坦",
		1: "kazakhstan",
		2: "KAZ",
	},
	3337: {
		0: "哈瓦那",
		1: "havana",
		2: "HAV",
	},
	862: {
		0: "海安市",
		1: "haian",
		2: "HAS",
	},
	315: {
		0: "海北",
		1: "haibei",
		2: "HB",
	},
	3259: {
		0: "海参崴",
		1: "vladivostok",
		2: "HSW",
	},
	707: {
		0: "海城市",
		1: "haicheng",
		2: "HC",
	},
	3112: {
		0: "海德堡",
		1: "heidelberg",
		2: "HDB",
	},
	314: {
		0: "海东",
		1: "haidong",
		2: "HD",
	},
	3248: {
		0: "海法",
		1: "haifa",
		2: "HAF",
	},
	1498: {
		0: "海丰县",
		1: "haifeng",
		2: "HF",
	},
	23: {
		0: "海口",
		1: "haikou",
		2: "HK",
	},
	811: {
		0: "海林市",
		1: "hailin",
		2: "HL",
	},
	817: {
		0: "海伦市",
		1: "hailun",
		2: "HL",
	},
	857: {
		0: "海门市",
		1: "haimen",
		2: "HM",
	},
	411: {
		0: "海南州",
		1: "hainanzhou",
		2: "HNZ",
	},
	877: {
		0: "海宁市",
		1: "haining",
		2: "HN",
	},
	320: {
		0: "海西",
		1: "haixi",
		2: "HX",
	},
	535: {
		0: "海兴县",
		1: "haixing",
		2: "HX",
	},
	2430: {
		0: "海牙",
		1: "thehague",
		2: "HY",
	},
	880: {
		0: "海盐县",
		1: "haiyan",
		2: "HY",
	},
	2165: {
		0: "海晏县",
		1: "haiyanxian",
		2: "HY",
	},
	1154: {
		0: "海阳市",
		1: "haiyang",
		2: "HY",
	},
	3593: {
		0: "海原县",
		1: "haiyuanxian",
		2: "HYX",
	},
	970: {
		0: "含山县",
		1: "hanshan",
		2: "HS",
	},
	27: {
		0: "邯郸",
		1: "handan",
		2: "HD",
	},
	15036: {
		0: "函馆",
		1: "Hakodate",
		2: "HAK",
	},
	2022: {
		0: "韩城市",
		1: "hancheng",
		2: "HC",
	},
	2314: {
		0: "韩国",
		1: "korea",
		2: "KR",
	},
	2424: {
		0: "汉堡",
		1: "hamburg",
		2: "HB",
	},
	1333: {
		0: "汉川市",
		1: "hanchuan",
		2: "HC",
	},
	4032: {
		0: "汉密尔顿",
		1: "hamilton",
		2: "HMT",
	},
	4471: {
		0: "汉南区",
		1: "hannan",
		2: "HN",
	},
	3433: {
		0: "汉诺威",
		1: "hannover",
		2: "HNW",
	},
	1384: {
		0: "汉寿县",
		1: "hanshou",
		2: "HS",
	},
	2072: {
		0: "汉阴县",
		1: "hanyin",
		2: "HY",
	},
	1689: {
		0: "汉源县",
		1: "hanyuan",
		2: "HY",
	},
	295: {
		0: "汉中",
		1: "hanzhong",
		2: "HZ",
	},
	3560: {
		0: "杭锦后旗",
		1: "hangjinhouqi",
		2: "HJH",
	},
	3547: {
		0: "杭锦旗",
		1: "hangjinqi",
		2: "HJQ",
	},
	3: {
		0: "杭州",
		1: "hangzhou",
		2: "HZ",
	},
	4097: {
		0: "合艾",
		1: "hatyai",
		2: "HAY",
	},
	4429: {
		0: "合川区",
		1: "hechuan",
		2: "HC",
	},
	110: {
		0: "合肥",
		1: "hefei",
		2: "HF",
	},
	1656: {
		0: "合江县",
		1: "hejianxian",
		2: "HJ",
	},
	1566: {
		0: "合浦县",
		1: "hepu",
		2: "HP",
	},
	1596: {
		0: "合山市",
		1: "heshanshi",
		2: "HS",
	},
	2116: {
		0: "合水县",
		1: "heshui",
		2: "HS",
	},
	2029: {
		0: "合阳县",
		1: "heyang",
		2: "HY",
	},
	2148: {
		0: "合作市",
		1: "hezuo",
		2: "HZ",
	},
	2274: {
		0: "和布克赛尔蒙古自治县",
		1: "hebukesaier",
		2: "HBK",
	},
	3201: {
		0: "和歌山",
		1: "wakayama",
		2: "QKY",
	},
	2255: {
		0: "和静县",
		1: "hejing",
		2: "HJ",
	},
	660: {
		0: "和林格尔县",
		1: "helingeer",
		2: "HLG",
	},
	759: {
		0: "和龙市",
		1: "heliu",
		2: "HL",
	},
	1481: {
		0: "和平县",
		1: "heping",
		2: "HP",
	},
	623: {
		0: "和顺县",
		1: "heshun",
		2: "HS",
	},
	2256: {
		0: "和硕县",
		1: "heshuo",
		2: "HS",
	},
	335: {
		0: "和田地区",
		1: "hetiandiqu",
		2: "HTD",
	},
	2222: {
		0: "和田市",
		1: "hetian",
		2: "HT",
	},
	2223: {
		0: "和田县",
		1: "hetianxian",
		2: "HTX",
	},
	971: {
		0: "和县",
		1: "hexian",
		2: "HX",
	},
	2145: {
		0: "和政县",
		1: "hezheng",
		2: "HZ",
	},
	235: {
		0: "河池",
		1: "hechi",
		2: "HC",
	},
	531: {
		0: "河间市",
		1: "hejian",
		2: "HJ",
	},
	3502: {
		0: "河津市",
		1: "hejin",
		2: "HJ",
	},
	4434: {
		0: "河口",
		1: "hekou",
		2: "HK",
	},
	1922: {
		0: "河口瑶族自治县",
		1: "helou",
		2: "HK",
	},
	2367: {
		0: "河内",
		1: "hanoi",
		2: "HAN",
	},
	2172: {
		0: "河南蒙古族自治县",
		1: "henanxian",
		2: "HNX",
	},
	617: {
		0: "河曲县",
		1: "hequ",
		2: "HQ",
	},
	216: {
		0: "河源",
		1: "heyuan",
		2: "HY",
	},
	4337: {
		0: "荷兰",
		1: "netherlands",
		2: "NLD",
	},
	159: {
		0: "菏泽",
		1: "heze",
		2: "HZ",
	},
	2191: {
		0: "贺兰县",
		1: "helan",
		2: "HL",
	},
	234: {
		0: "贺州",
		1: "hezhou",
		2: "HZ",
	},
	3371: {
		0: "赫尔格达",
		1: "hurghada",
		2: "HRG",
	},
	4132: {
		0: "赫尔辛堡",
		1: "helsingborg",
		2: "HLS",
	},
	3235: {
		0: "赫尔辛格",
		1: "helsingor",
		2: "HES",
	},
	3154: {
		0: "赫尔辛基",
		1: "helsinki",
		2: "HEL",
	},
	1768: {
		0: "赫章县",
		1: "hezhang",
		2: "HZ",
	},
	165: {
		0: "鹤壁",
		1: "hebi",
		2: "HB",
	},
	1375: {
		0: "鹤峰县",
		1: "hefeng",
		2: "HF",
	},
	82: {
		0: "鹤岗",
		1: "hegang",
		2: "HG",
	},
	1894: {
		0: "鹤庆县",
		1: "heqing",
		2: "HQ",
	},
	1506: {
		0: "鹤山市",
		1: "heshan",
		2: "HS",
	},
	89: {
		0: "黑河",
		1: "heihe",
		2: "HH",
	},
	15260: {
		0: "黑山",
		1: "Montenegro",
		2: "MON",
	},
	719: {
		0: "黑山县",
		1: "heishan",
		2: "HS",
	},
	1702: {
		0: "黑水县",
		1: "heishui",
		2: "HS",
	},
	15243: {
		0: "恒春",
		1: "Hengchun",
		2: "HEN",
	},
	3082: {
		0: "横滨",
		1: "yokohama",
		2: "YOK",
	},
	3606: {
		0: "横店",
		1: "hengdian",
		2: "HD",
	},
	1082: {
		0: "横峰县",
		1: "hengfeng",
		2: "HF",
	},
	2063: {
		0: "横山区",
		1: "hengshanqu",
		2: "HS",
	},
	1530: {
		0: "横县",
		1: "hengxian",
		2: "HX",
	},
	1412: {
		0: "衡东县",
		1: "hengdong",
		2: "HD",
	},
	1410: {
		0: "衡南县",
		1: "hengnan",
		2: "HN",
	},
	1411: {
		0: "衡山县",
		1: "hengshan",
		2: "HS",
	},
	34: {
		0: "衡水",
		1: "hengshui",
		2: "HS",
	},
	194: {
		0: "衡阳",
		1: "hengyang",
		2: "HY",
	},
	1409: {
		0: "衡阳县",
		1: "hengyangxian",
		2: "HYX",
	},
	15039: {
		0: "弘前",
		1: "Hirosaki",
		2: "HIR",
	},
	1339: {
		0: "红安县",
		1: "hongan",
		2: "HA",
	},
	273: {
		0: "红河",
		1: "honghe",
		2: "HH",
	},
	1920: {
		0: "红河县",
		1: "honghexian",
		2: "HHX",
	},
	1706: {
		0: "红原县",
		1: "hongyuan",
		2: "HY",
	},
	3610: {
		0: "宏村",
		1: "hongcun",
		2: "HC",
	},
	635: {
		0: "洪洞县",
		1: "hongdong",
		2: "HD",
	},
	1354: {
		0: "洪湖市",
		1: "honghu",
		2: "HH",
	},
	1441: {
		0: "洪江市",
		1: "hongjian",
		2: "HJ",
	},
	1684: {
		0: "洪雅县",
		1: "hongya",
		2: "HY",
	},
	843: {
		0: "洪泽区",
		1: "hongze",
		2: "HZ",
	},
	630: {
		0: "侯马市",
		1: "houma",
		2: "HM",
	},
	46: {
		0: "呼和浩特",
		1: "huhehaote",
		2: "HH",
	},
	52: {
		0: "呼伦贝尔",
		1: "hulunbeier",
		2: "HL",
	},
	824: {
		0: "呼玛县",
		1: "huma",
		2: "HM",
	},
	2246: {
		0: "呼图壁县",
		1: "hutubi",
		2: "HTB",
	},
	2366: {
		0: "胡志明市",
		1: "hochiminh",
		2: "SGN",
	},
	597: {
		0: "壶关县",
		1: "huguan",
		2: "HG",
	},
	1050: {
		0: "湖口县",
		1: "hukou",
		2: "HK",
	},
	103: {
		0: "湖州",
		1: "huzhou",
		2: "HZ",
	},
	69: {
		0: "葫芦岛",
		1: "huludao",
		2: "HLD",
	},
	806: {
		0: "虎林市",
		1: "hulin",
		2: "HL",
	},
	2162: {
		0: "互助土族自治县",
		1: "huzhu",
		2: "HZ",
	},
	2006: {
		0: "鄠邑区",
		1: "huxian",
		2: "HX",
	},
	2336: {
		0: "花莲",
		1: "hualien",
		2: "HUN",
	},
	3619: {
		0: "花水湾",
		1: "huashuiwan",
		2: "HSW",
	},
	1459: {
		0: "花垣县",
		1: "huayuan",
		2: "HY",
	},
	1023: {
		0: "华安县",
		1: "huaan",
		2: "HA",
	},
	2115: {
		0: "华池县",
		1: "huachi",
		2: "HC",
	},
	1835: {
		0: "华宁县",
		1: "huaning",
		2: "HN",
	},
	1855: {
		0: "华坪县",
		1: "huapin",
		2: "HP",
	},
	1396: {
		0: "华容县",
		1: "huarong",
		2: "HR",
	},
	4090: {
		0: "华沙",
		1: "warsaw",
		2: "WAS",
	},
	3629: {
		0: "华山",
		1: "huashan",
		2: "HS",
	},
	3106: {
		0: "华盛顿",
		1: "Washington",
		2: "DC",
	},
	15166: {
		0: "华盛顿州",
		1: "WashingtonStat",
		2: "WS",
	},
	2123: {
		0: "华亭市",
		1: "huating",
		2: "HTS",
	},
	3230: {
		0: "华欣",
		1: "huahin",
		2: "HAH",
	},
	2021: {
		0: "华阴市",
		1: "huayin",
		2: "HY",
	},
	1636: {
		0: "华蓥市",
		1: "huayinshi",
		2: "HY",
	},
	2023: {
		0: "华州区",
		1: "huazhouqu",
		2: "HZ",
	},
	1248: {
		0: "滑县",
		1: "huaxian",
		2: "HX",
	},
	674: {
		0: "化德县",
		1: "huade",
		2: "HD",
	},
	2163: {
		0: "化隆回族自治县",
		1: "hualong",
		2: "HL",
	},
	1520: {
		0: "化州市",
		1: "huazhoushi",
		2: "HZ",
	},
	799: {
		0: "桦川县",
		1: "huachuan",
		2: "HC",
	},
	738: {
		0: "桦甸市",
		1: "huadian",
		2: "HD",
	},
	798: {
		0: "桦南县",
		1: "huanan",
		2: "HN",
	},
	463: {
		0: "怀安县",
		1: "huaianxian",
		2: "HA",
	},
	15176: {
		0: "怀俄明州",
		1: "Wyoming",
		2: "WYO",
	},
	202: {
		0: "怀化",
		1: "huaihua",
		2: "HH",
	},
	1510: {
		0: "怀集县",
		1: "huaiji",
		2: "HJ",
	},
	465: {
		0: "怀来县",
		1: "huailai",
		2: "HL",
	},
	952: {
		0: "怀宁县",
		1: "huaining",
		2: "HN",
	},
	581: {
		0: "怀仁市",
		1: "huairen",
		2: "HRS",
	},
	4453: {
		0: "怀柔区",
		1: "huairou",
		2: "HR",
	},
	4322: {
		0: "怀特岛",
		1: "isleofwight",
		2: "IW",
	},
	936: {
		0: "怀远县",
		1: "huaiyuan",
		2: "HY",
	},
	96: {
		0: "淮安",
		1: "huaian",
		2: "HA",
	},
	115: {
		0: "淮北",
		1: "huaibei",
		2: "HB",
	},
	1292: {
		0: "淮滨县",
		1: "huaibin",
		2: "HB",
	},
	113: {
		0: "淮南",
		1: "huainan",
		2: "HN",
	},
	1305: {
		0: "淮阳县",
		1: "huaiyang",
		2: "HY",
	},
	1595: {
		0: "环江毛南族自治县",
		1: "huanjiang",
		2: "HJ",
	},
	2114: {
		0: "环县",
		1: "huanxian",
		2: "HX",
	},
	704: {
		0: "桓仁满族自治县",
		1: "huanren",
		2: "HR",
	},
	1142: {
		0: "桓台县",
		1: "huantai",
		2: "HT",
	},
	2385: {
		0: "皇后镇",
		1: "queenstown",
		2: "QSN",
	},
	185: {
		0: "黄冈",
		1: "huanggang",
		2: "HG",
	},
	3624: {
		0: "黄果树",
		1: "huangguoshu",
		2: "HGS",
	},
	530: {
		0: "黄骅市",
		1: "huanghua",
		2: "HH",
	},
	2380: {
		0: "黄金海岸",
		1: "goldcoast",
		2: "OOL",
	},
	2019: {
		0: "黄陵县",
		1: "huangling",
		2: "HL",
	},
	2018: {
		0: "黄龙县",
		1: "huangliu",
		2: "HL",
	},
	1344: {
		0: "黄梅县",
		1: "huangmei",
		2: "HM",
	},
	316: {
		0: "黄南",
		1: "huangnan",
		2: "HN",
	},
	1780: {
		0: "黄平县",
		1: "huangping",
		2: "HP",
	},
	118: {
		0: "黄山",
		1: "huangshan",
		2: "HS",
	},
	177: {
		0: "黄石",
		1: "huangshi",
		2: "HS",
	},
	3164: {
		0: "黄石国家公园",
		1: "Yellowstone",
		2: "YS",
	},
	2157: {
		0: "湟源县",
		1: "huangyuan",
		2: "HY",
	},
	2158: {
		0: "湟中县",
		1: "huangzhong",
		2: "HZ",
	},
	359: {
		0: "潢川县",
		1: "huangchuan",
		2: "HC",
	},
	362: {
		0: "珲春市",
		1: "huichun",
		2: "HC",
	},
	749: {
		0: "辉南县",
		1: "huinan",
		2: "HN",
	},
	1236: {
		0: "辉县市",
		1: "huixian",
		2: "HX",
	},
	2139: {
		0: "徽县",
		1: "huixianxian",
		2: "HX",
	},
	3095: {
		0: "会安",
		1: "hoian",
		2: "HA",
	},
	1074: {
		0: "会昌县",
		1: "huicang",
		2: "HC",
	},
	1727: {
		0: "会东县",
		1: "huidongxian",
		2: "HD",
	},
	1726: {
		0: "会理县",
		1: "huili",
		2: "HL",
	},
	2092: {
		0: "会宁县",
		1: "huining",
		2: "HN",
	},
	3221: {
		0: "会晒",
		1: "houeisay",
		2: "HOE",
	},
	1446: {
		0: "会同县",
		1: "huitong",
		2: "HT",
	},
	1831: {
		0: "会泽县",
		1: "huize",
		2: "HZ",
	},
	1011: {
		0: "惠安县",
		1: "huian",
		2: "HA",
	},
	1501: {
		0: "惠东县",
		1: "huidong",
		2: "HD",
	},
	1496: {
		0: "惠来县",
		1: "huilai",
		2: "HL",
	},
	2386: {
		0: "惠灵顿",
		1: "wellington",
		2: "WLG",
	},
	1195: {
		0: "惠民县",
		1: "huimin",
		2: "HM",
	},
	1805: {
		0: "惠水县",
		1: "huishui",
		2: "HS",
	},
	3300: {
		0: "惠斯勒",
		1: "whistler",
		2: "HSL",
	},
	4435: {
		0: "惠阳",
		1: "huiyang",
		2: "HY",
	},
	213: {
		0: "惠州",
		1: "huizhou",
		2: "HZ",
	},
	586: {
		0: "浑源县",
		1: "hunyuan",
		2: "HY",
	},
	1238: {
		0: "获嘉县",
		1: "huojia",
		2: "HJ",
	},
	4108: {
		0: "霍巴特",
		1: "hobart",
		2: "HBT",
	},
	2261: {
		0: "霍城县",
		1: "huocheng",
		2: "HC",
	},
	4473: {
		0: "霍尔果斯市",
		1: "huoerguosi",
		2: "HEG",
	},
	4034: {
		0: "霍基蒂卡",
		1: "hokitika",
		2: "HKK",
	},
	665: {
		0: "霍林郭勒市",
		1: "huolinguole",
		2: "HLG",
	},
	964: {
		0: "霍邱县",
		1: "huoqiu",
		2: "HQ",
	},
	967: {
		0: "霍山县",
		1: "huoshan",
		2: "HS",
	},
	631: {
		0: "霍州市",
		1: "huozhou",
		2: "HZ",
	},
	1043: {
		0: "柴桑区",
		1: "jiujiangxian",
		2: "JJX",
	},
	2210: {
		0: "伽师县",
		1: "jiashi",
		2: "JS",
	},
	808: {
		0: "鸡东县",
		1: "jidong",
		2: "JD",
	},
	81: {
		0: "鸡西",
		1: "jixi",
		2: "JX",
	},
	569: {
		0: "鸡泽县",
		1: "jizhe",
		2: "JZ",
	},
	11161: {
		0: "姬路",
		1: "Himeji",
		2: "HIM",
	},
	2147: {
		0: "积石山保安族东乡族撒拉族自治县",
		1: "jishishan",
		2: "JSS",
	},
	2387: {
		0: "基督城",
		1: "christchurch",
		2: "CHC",
	},
	2471: {
		0: "基拉尼",
		1: "killarney",
		2: "JLN",
	},
	3170: {
		0: "基隆",
		1: "keelung",
		2: "KEL",
	},
	4131: {
		0: "基律纳",
		1: "kiruna",
		2: "KRN",
	},
	980: {
		0: "绩溪县",
		1: "jixixian",
		2: "JX",
	},
	141: {
		0: "吉安",
		1: "jian",
		2: "JA",
	},
	1108: {
		0: "吉安县",
		1: "jianxian",
		2: "JAX",
	},
	3340: {
		0: "吉布提",
		1: "djibouti",
		2: "DJI",
	},
	3339: {
		0: "吉尔吉斯斯坦",
		1: "kyrgyzstan",
		2: "KGZ",
	},
	4110: {
		0: "吉朗",
		1: "geelong",
		2: "GLG",
	},
	4483: {
		0: "吉利区",
		1: "jili",
		2: "JL",
	},
	71: {
		0: "吉林",
		1: "jilin",
		2: "JL",
	},
	2359: {
		0: "吉隆坡",
		1: "kualalumpur",
		2: "KUL",
	},
	1993: {
		0: "吉隆县",
		1: "jilong",
		2: "JL",
	},
	2281: {
		0: "吉木乃县",
		1: "jimumai",
		2: "JMN",
	},
	2249: {
		0: "吉木萨尔县",
		1: "jimusaer",
		2: "JMS",
	},
	1456: {
		0: "吉首市",
		1: "jishou",
		2: "JS",
	},
	1109: {
		0: "吉水县",
		1: "jishui",
		2: "JS",
	},
	639: {
		0: "吉县",
		1: "lfjixian",
		2: "JX",
	},
	747: {
		0: "集安市",
		1: "jianshi",
		2: "JA",
	},
	802: {
		0: "集贤县",
		1: "sysjixianxian",
		2: "JX",
	},
	3277: {
		0: "几内亚",
		1: "guinea",
		2: "GIN",
	},
	22: {
		0: "济南",
		1: "jinan",
		2: "JN",
	},
	150: {
		0: "济宁",
		1: "jining",
		2: "JN",
	},
	1120: {
		0: "济阳区",
		1: "jiyang",
		2: "JYQ",
	},
	397: {
		0: "济源",
		1: "jiyuan",
		2: "JY",
	},
	2371: {
		0: "济州岛",
		1: "jeju",
		2: "JZD",
	},
	436: {
		0: "蓟州区",
		1: "jixian",
		2: "JX",
	},
	3521: {
		0: "稷山县",
		1: "jishanxian",
		2: "JSX",
	},
	518: {
		0: "冀州区",
		1: "jizhou",
		2: "JZ",
	},
	1975: {
		0: "加查县",
		1: "jiacha",
		2: "JC",
	},
	3408: {
		0: "加德满都",
		1: "kathmandu",
		2: "KMD",
	},
	3319: {
		0: "加尔各答",
		1: "calcutta",
		2: "CAT",
	},
	4470: {
		0: "加格达奇区",
		1: "jiagedaqi",
		2: "JGD",
	},
	10263: {
		0: "加勒",
		1: "Galle",
		2: "GAL",
	},
	15168: {
		0: "加利福尼亚州",
		1: "California",
		2: "CAL",
	},
	3301: {
		0: "加拿大",
		1: "canada",
		2: "CAN",
	},
	3304: {
		0: "加那利群岛",
		1: "canaryislands",
		2: "CRN",
	},
	3302: {
		0: "加纳",
		1: "ghana",
		2: "GHA",
	},
	3303: {
		0: "加蓬",
		1: "gabon",
		2: "GAB",
	},
	15259: {
		0: "加泰罗尼亚",
		1: "Catalonia",
		2: "CAT",
	},
	1649: {
		0: "夹江县",
		1: "jiajian",
		2: "JJ",
	},
	86: {
		0: "佳木斯",
		1: "jiamusi",
		2: "JMS",
	},
	2068: {
		0: "佳县",
		1: "jiaxianxian",
		2: "JX",
	},
	1418: {
		0: "嘉禾县",
		1: "jiahe",
		2: "JH",
	},
	1940: {
		0: "嘉黎县",
		1: "jiali",
		2: "JL",
	},
	879: {
		0: "嘉善县",
		1: "jiashan",
		2: "JS",
	},
	1187: {
		0: "嘉祥县",
		1: "jiaxiang",
		2: "JX",
	},
	102: {
		0: "嘉兴",
		1: "jiaxing",
		2: "JX",
	},
	3172: {
		0: "嘉义",
		1: "chiayi",
		2: "CHY",
	},
	795: {
		0: "嘉荫县",
		1: "jiayin",
		2: "JY",
	},
	1349: {
		0: "嘉鱼县",
		1: "jiayu",
		2: "JY",
	},
	300: {
		0: "嘉峪关",
		1: "jiayuguan",
		2: "JYG",
	},
	1279: {
		0: "郏县",
		1: "jiaxian",
		2: "JX",
	},
	2391: {
		0: "戛纳",
		1: "cannes",
		2: "CAN",
	},
	15048: {
		0: "甲府",
		1: "Kofu",
		2: "KOF",
	},
	3226: {
		0: "甲米",
		1: "krabitown",
		2: "KRT",
	},
	3321: {
		0: "贾沙梅尔",
		1: "jaisalmer",
		2: "JYS",
	},
	15247: {
		0: "贾斯珀国家公园",
		1: "jas",
		2: "JAS",
	},
	4476: {
		0: "贾汪区",
		1: "jiawang",
		2: "JW",
	},
	2170: {
		0: "尖扎县",
		1: "jianzha",
		2: "JZ",
	},
	1358: {
		0: "监利县",
		1: "jianli",
		2: "JL",
	},
	2316: {
		0: "柬埔寨",
		1: "cambodia",
		2: "KH",
	},
	1679: {
		0: "简阳市",
		1: "jianyang",
		2: "JY",
	},
	723: {
		0: "建昌县",
		1: "jiancang",
		2: "JC",
	},
	870: {
		0: "建德市",
		1: "jiande",
		2: "JD",
	},
	851: {
		0: "建湖县",
		1: "jianhu",
		2: "JH",
	},
	1007: {
		0: "建宁县",
		1: "jianning",
		2: "JN",
	},
	990: {
		0: "建瓯市",
		1: "jianou",
		2: "JO",
	},
	691: {
		0: "建平县",
		1: "jianping",
		2: "JP",
	},
	1370: {
		0: "建始县",
		1: "jianshixian",
		2: "JS",
	},
	1915: {
		0: "建水县",
		1: "jianshui",
		2: "JS",
	},
	991: {
		0: "建阳区",
		1: "jianyangqu",
		2: "JY",
	},
	1893: {
		0: "剑川县",
		1: "jianchuan",
		2: "JC",
	},
	1616: {
		0: "剑阁县",
		1: "jiange",
		2: "JG",
	},
	1787: {
		0: "剑河县",
		1: "jianhe",
		2: "JH",
	},
	2466: {
		0: "剑桥",
		1: "cambridge",
		2: "JQ",
	},
	15042: {
		0: "谏早",
		1: "Isahaya",
		2: "ISA",
	},
	1661: {
		0: "江安县",
		1: "jianan",
		2: "JA",
	},
	1863: {
		0: "江城哈尼族彝族自治县",
		1: "jiangcheng",
		2: "JC",
	},
	1832: {
		0: "江川区",
		1: "jiangchuan",
		2: "JC",
	},
	1950: {
		0: "江达县",
		1: "jianda",
		2: "JD",
	},
	425: {
		0: "江都区",
		1: "jiangdu",
		2: "JD",
	},
	1431: {
		0: "江华瑶族自治县",
		1: "jianghua",
		2: "JH",
	},
	4477: {
		0: "江津区",
		1: "jiangjin",
		2: "JJ",
	},
	1771: {
		0: "江口县",
		1: "jiankou",
		2: "JK",
	},
	11281: {
		0: "江陵",
		1: "Gangneung",
		2: "KAG",
	},
	1356: {
		0: "江陵县",
		1: "jianling",
		2: "JL",
	},
	209: {
		0: "江门",
		1: "jiangmen",
		2: "JM",
	},
	888: {
		0: "江山市",
		1: "jianshan",
		2: "JS",
	},
	427: {
		0: "江阴",
		1: "jiangyin",
		2: "JY",
	},
	1426: {
		0: "江永县",
		1: "jianyong",
		2: "JY",
	},
	1618: {
		0: "江油市",
		1: "jianyou",
		2: "JY",
	},
	3181: {
		0: "江原道",
		1: "kangwon-do",
		2: "KGW",
	},
	1981: {
		0: "江孜县",
		1: "jianzi",
		2: "JZ",
	},
	855: {
		0: "姜堰区",
		1: "jiangyan",
		2: "JY",
	},
	1005: {
		0: "将乐县",
		1: "jiangle",
		2: "JL",
	},
	3523: {
		0: "绛县",
		1: "jiangxian",
		2: "JX",
	},
	656: {
		0: "交城县",
		1: "jiaocheng",
		2: "JC",
	},
	655: {
		0: "交口县",
		1: "jiaokou",
		2: "JK",
	},
	1164: {
		0: "胶州市",
		1: "jiaozhou",
		2: "JZ",
	},
	3316: {
		0: "焦特布尔",
		1: "jodhpur",
		2: "JTB",
	},
	167: {
		0: "焦作",
		1: "jiaozuo",
		2: "JZ",
	},
	737: {
		0: "蛟河市",
		1: "jiaohe",
		2: "JH",
	},
	1489: {
		0: "蕉岭县",
		1: "jiaoling",
		2: "JL",
	},
	1495: {
		0: "揭西县",
		1: "jiexi",
		2: "JX",
	},
	222: {
		0: "揭阳",
		1: "jieyang",
		2: "JY",
	},
	4214: {
		0: "杰克逊",
		1: "jackson",
		2: "JKX",
	},
	4177: {
		0: "杰拉什",
		1: "jerash",
		2: "JER",
	},
	4012: {
		0: "捷克",
		1: "czech",
		2: "CZE",
	},
	620: {
		0: "介休市",
		1: "jiexiu",
		2: "JX",
	},
	931: {
		0: "界首市",
		1: "jieshou",
		2: "JS",
	},
	2364: {
		0: "金边",
		1: "phnompenh",
		2: "PNH",
	},
	301: {
		0: "金昌",
		1: "jinchang",
		2: "JC",
	},
	1700: {
		0: "金川县",
		1: "jinchuan",
		2: "JC",
	},
	841: {
		0: "金湖县",
		1: "jinhu",
		2: "JH",
	},
	105: {
		0: "金华",
		1: "jinhua",
		2: "JH",
	},
	3584: {
		0: "金门县",
		1: "jinmenxian",
		2: "JMX",
	},
	3324: {
		0: "金奈",
		1: "chennai",
		2: "CHN",
	},
	1921: {
		0: "金平苗族瑶族傣族自治县",
		1: "jinpingxian",
		2: "JP",
	},
	1765: {
		0: "金沙县",
		1: "jinsha",
		2: "JS",
	},
	3298: {
		0: "金斯顿",
		1: "kingston",
		2: "KST",
	},
	2104: {
		0: "金塔县",
		1: "jinta",
		2: "JT",
	},
	866: {
		0: "金坛区",
		1: "jintan",
		2: "JT",
	},
	1608: {
		0: "金堂县",
		1: "jintang",
		2: "JT",
	},
	1094: {
		0: "金溪县",
		1: "jinxi",
		2: "JX",
	},
	1186: {
		0: "金乡县",
		1: "jinxiang",
		2: "JX",
	},
	1600: {
		0: "金秀瑶族自治县",
		1: "jinxiu",
		2: "JX",
	},
	1731: {
		0: "金阳县",
		1: "jinyang",
		2: "JY",
	},
	15045: {
		0: "金泽",
		1: "kan",
		2: "KAN",
	},
	966: {
		0: "金寨县",
		1: "jinzhai",
		2: "JZ",
	},
	4102: {
		0: "津巴布韦",
		1: "zimbabwe",
		2: "ZIM",
	},
	1382: {
		0: "津市市",
		1: "jinshi",
		2: "JS",
	},
	1786: {
		0: "锦屏县",
		1: "jinping",
		2: "JP",
	},
	62: {
		0: "锦州",
		1: "jinzhou",
		2: "JZ",
	},
	1041: {
		0: "进贤县",
		1: "jinxian",
		2: "JX",
	},
	39: {
		0: "晋城",
		1: "jincheng",
		2: "JC",
	},
	1009: {
		0: "晋江",
		1: "jinjiang",
		2: "JJ",
	},
	1817: {
		0: "晋宁区",
		1: "jinning",
		2: "JN",
	},
	41: {
		0: "晋中",
		1: "jinzhong",
		2: "JZ",
	},
	441: {
		0: "晋州市",
		1: "jinzhoushi",
		2: "JZ",
	},
	913: {
		0: "缙云县",
		1: "jinyun",
		2: "JY",
	},
	2373: {
		0: "京都",
		1: "kyoto",
		2: "KTO",
	},
	4446: {
		0: "京畿道",
		1: "Gyeonggi-do",
		2: "GGD",
	},
	1330: {
		0: "京山市",
		1: "jingshan",
		2: "JSS",
	},
	2120: {
		0: "泾川县",
		1: "jingchuan",
		2: "JC",
	},
	978: {
		0: "泾县",
		1: "jingxianxian",
		2: "JX",
	},
	2033: {
		0: "泾阳县",
		1: "jingyang",
		2: "JY",
	},
	2198: {
		0: "泾源县",
		1: "jingyuanxian",
		2: "JY",
	},
	182: {
		0: "荆门",
		1: "jinmen",
		2: "JM",
	},
	184: {
		0: "荆州",
		1: "jingzhou",
		2: "JZ",
	},
	979: {
		0: "旌德县",
		1: "jingde",
		2: "JD",
	},
	2241: {
		0: "精河县",
		1: "jinghe",
		2: "JH",
	},
	1107: {
		0: "井冈山市",
		1: "jinggangshan",
		2: "JGS",
	},
	444: {
		0: "井陉县",
		1: "jingjing",
		2: "JJ",
	},
	1648: {
		0: "井研县",
		1: "jingyan",
		2: "JY",
	},
	135: {
		0: "景德镇",
		1: "jingdezhen",
		2: "JDZ",
	},
	1860: {
		0: "景东彝族自治县",
		1: "jingdong",
		2: "JD",
	},
	1861: {
		0: "景谷傣族彝族自治县",
		1: "jinggu",
		2: "JG",
	},
	1908: {
		0: "景洪市",
		1: "jinghong",
		2: "JH",
	},
	919: {
		0: "景宁畲族自治县",
		1: "jingning",
		2: "JN",
	},
	2093: {
		0: "景泰县",
		1: "jingtai",
		2: "JT",
	},
	526: {
		0: "景县",
		1: "jingxian",
		2: "JX",
	},
	1105: {
		0: "靖安县",
		1: "jingan",
		2: "JA",
	},
	2064: {
		0: "靖边县",
		1: "jingbian",
		2: "JB",
	},
	853: {
		0: "靖江",
		1: "jingjian",
		2: "JJ",
	},
	1579: {
		0: "靖西市",
		1: "jingxi",
		2: "JX",
	},
	754: {
		0: "靖宇县",
		1: "jingyu",
		2: "JY",
	},
	2091: {
		0: "靖远县",
		1: "jingyuan",
		2: "JY",
	},
	1450: {
		0: "靖州苗族侗族自治县",
		1: "jingzhouxian",
		2: "JZ",
	},
	3187: {
		0: "静冈",
		1: "shizuoka",
		2: "SZK",
	},
	438: {
		0: "静海区",
		1: "jinghai",
		2: "JH",
	},
	613: {
		0: "静乐县",
		1: "jingle",
		2: "JL",
	},
	2125: {
		0: "静宁县",
		1: "jingningxian",
		2: "JN",
	},
	3612: {
		0: "九华山",
		1: "jiuhuashan",
		2: "JHS",
	},
	137: {
		0: "九江",
		1: "jiujiang",
		2: "JJ",
	},
	1709: {
		0: "九龙县",
		1: "jiuliu",
		2: "JL",
	},
	725: {
		0: "九台区",
		1: "jiutai",
		2: "JT",
	},
	1699: {
		0: "九寨沟县",
		1: "jiuzhaigou",
		2: "JZG",
	},
	2177: {
		0: "久治县",
		1: "jiuzhi",
		2: "JZ",
	},
	307: {
		0: "酒泉",
		1: "jiuquan",
		2: "JQ",
	},
	2396: {
		0: "旧金山",
		1: "sanfrancisco",
		2: "SFO",
	},
	1173: {
		0: "莒南县",
		1: "junan",
		2: "JN",
	},
	1170: {
		0: "莒县",
		1: "juxian",
		2: "JX",
	},
	865: {
		0: "句容市",
		1: "jurong",
		2: "JR",
	},
	552: {
		0: "巨鹿县",
		1: "julu",
		2: "JL",
	},
	1205: {
		0: "巨野县",
		1: "juye",
		2: "JY",
	},
	1207: {
		0: "鄄城县",
		1: "juancheng",
		2: "JC",
	},
	1664: {
		0: "筠连县",
		1: "junlian",
		2: "JL",
	},
	4013: {
		0: "克鲁姆洛夫",
		1: "ceskykrumlov",
		2: "CSK",
	},
	3536: {
		0: "喀喇沁旗",
		1: "keqinqi",
		2: "KQQ",
	},
	692: {
		0: "喀喇沁左翼蒙古族自治县",
		1: "kalaqinzuiyi",
		2: "KLQ",
	},
	3343: {
		0: "喀麦隆",
		1: "cameroon",
		2: "CMR",
	},
	334: {
		0: "喀什地区",
		1: "kashidiqu",
		2: "KSD",
	},
	2201: {
		0: "喀什市",
		1: "kashi",
		2: "KS",
	},
	4053: {
		0: "卡昂",
		1: "caen",
		2: "CAE",
	},
	4311: {
		0: "卡迪夫",
		1: "cardiff",
		2: "CAD",
	},
	3294: {
		0: "卡尔加里",
		1: "calgary",
		2: "CRR",
	},
	4083: {
		0: "卡尔卡松",
		1: "carcassonne",
		2: "CRC",
	},
	3468: {
		0: "卡尔斯鲁厄",
		1: "karlsruhe",
		2: "KA",
	},
	2432: {
		0: "卡罗维发利",
		1: "karlovyvary",
		2: "KLW",
	},
	4249: {
		0: "卡梅尔",
		1: "carmel",
		2: "KME",
	},
	3347: {
		0: "卡帕多奇亚",
		1: "cappadocia",
		2: "CAP",
	},
	3488: {
		0: "卡普里岛",
		1: "capri",
		2: "CAP",
	},
	1949: {
		0: "卡若区",
		1: "changdu",
		2: "KR",
	},
	2477: {
		0: "卡萨布兰卡",
		1: "casablanca",
		2: "KSB",
	},
	3255: {
		0: "卡尚",
		1: "kashan",
		2: "KSH",
	},
	4359: {
		0: "卡斯蒂利亚-拉曼恰",
		1: "castilelamancha",
		2: "CLM",
	},
	4360: {
		0: "卡斯蒂利亚-莱昂",
		1: "castileleon",
		2: "CLN",
	},
	4353: {
		0: "卡斯凯什",
		1: "cascais",
		2: "CAS",
	},
	3310: {
		0: "卡塔尔",
		1: "qatar",
		2: "QAT",
	},
	3495: {
		0: "卡塔尼亚",
		1: "catania",
		2: "CZA",
	},
	161: {
		0: "开封",
		1: "kaifeng",
		2: "KF",
	},
	890: {
		0: "开化县",
		1: "kaihua",
		2: "KH",
	},
	1676: {
		0: "开江县",
		1: "kaijian",
		2: "KJ",
	},
	666: {
		0: "开鲁县",
		1: "kailu",
		2: "KL",
	},
	2472: {
		0: "开罗",
		1: "cairo",
		2: "KL",
	},
	3430: {
		0: "开曼群岛",
		1: "caymanislands",
		2: "CYM",
	},
	1505: {
		0: "开平市",
		1: "kaiping",
		2: "KP",
	},
	2478: {
		0: "开普敦",
		1: "capetown",
		2: "KPD",
	},
	3352: {
		0: "开塞利",
		1: "kayseri",
		2: "KSR",
	},
	1741: {
		0: "开阳县",
		1: "kaiyang",
		2: "KY",
	},
	696: {
		0: "开原市",
		1: "kaiyuan",
		2: "KY",
	},
	1913: {
		0: "开远市",
		1: "kaiyuanshi",
		2: "KY",
	},
	2293: {
		0: "开州区",
		1: "kaizhouqu",
		2: "KX",
	},
	2383: {
		0: "凯恩斯",
		1: "cairns",
		2: "CNS",
	},
	4028: {
		0: "凯库拉",
		1: "kaikoura",
		2: "KKR",
	},
	1779: {
		0: "凯里市",
		1: "kaili",
		2: "KL",
	},
	2382: {
		0: "堪培拉",
		1: "canberra",
		2: "CBR",
	},
	2482: {
		0: "坎昆",
		1: "cancun",
		2: "KK",
	},
	458: {
		0: "康保县",
		1: "kangbao",
		2: "KB",
	},
	383: {
		0: "康定市",
		1: "kangding",
		2: "KD",
	},
	2142: {
		0: "康乐县",
		1: "kangle",
		2: "KL",
	},
	1989: {
		0: "康马县",
		1: "kangma",
		2: "KM",
	},
	15178: {
		0: "康涅狄格州",
		1: "Connecticut",
		2: "CON",
	},
	686: {
		0: "康平县",
		1: "kangping",
		2: "KP",
	},
	3455: {
		0: "康斯坦茨",
		1: "konstanz",
		2: "KZT",
	},
	10062: {
		0: "康提",
		1: "Kandy",
		2: "KAN",
	},
	15252: {
		0: "康沃尔",
		1: "Cornwall",
		2: "COR",
	},
	2134: {
		0: "康县",
		1: "kangxian",
		2: "KX",
	},
	4317: {
		0: "考文垂",
		1: "coventry",
		2: "CVT",
	},
	2221: {
		0: "柯坪县",
		1: "kepin",
		2: "KP",
	},
	886: {
		0: "柯桥区",
		1: "shaoxingxian",
		2: "KQ",
	},
	3448: {
		0: "科布伦茨",
		1: "koblenz",
		2: "KLZ",
	},
	15254: {
		0: "科茨沃尔德",
		1: "Cotswold",
		2: "COT",
	},
	4364: {
		0: "科尔多瓦",
		1: "cordoba",
		2: "ODB",
	},
	4078: {
		0: "科尔马",
		1: "colmar",
		2: "CLM",
	},
	3565: {
		0: "科尔沁右翼前旗",
		1: "keyouqianqi",
		2: "KYQ",
	},
	3566: {
		0: "科尔沁右翼中旗",
		1: "keyouzhongqi",
		2: "KYZ",
	},
	3539: {
		0: "科尔沁左翼后旗",
		1: "kezuohouqi",
		2: "KZH",
	},
	3538: {
		0: "科尔沁左翼中旗",
		1: "kezuozhongqi",
		2: "KZZ",
	},
	2425: {
		0: "科隆",
		1: "cologne",
		2: "KL",
	},
	10604: {
		0: "科伦",
		1: "Coron",
		2: "COR",
	},
	10080: {
		0: "科伦坡",
		1: "Colombo",
		2: "COL",
	},
	15177: {
		0: "科罗拉多州",
		1: "Colorado",
		2: "COL",
	},
	12205: {
		0: "科罗纳多",
		1: "Coronado",
		2: "COR",
	},
	4166: {
		0: "科摩罗",
		1: "comoros",
		2: "ANJ",
	},
	3483: {
		0: "科莫",
		1: "como",
		2: "CO",
	},
	4167: {
		0: "科特迪瓦",
		1: "cotedivoire",
		2: "CIV",
	},
	4165: {
		0: "科威特",
		1: "kuwait",
		2: "KWT",
	},
	15119: {
		0: "可爱岛",
		1: "Kauai",
		2: "KAU",
	},
	4490: {
		0: "可克达拉市",
		1: "kekedalashi",
		2: "KKD",
	},
	616: {
		0: "岢岚县",
		1: "kelan",
		2: "KL",
	},
	781: {
		0: "克东县",
		1: "kedong",
		2: "KD",
	},
	4091: {
		0: "克拉科夫",
		1: "krakow",
		2: "KLK",
	},
	326: {
		0: "克拉玛依",
		1: "kelamayi",
		2: "KLM",
	},
	2453: {
		0: "克里特岛",
		1: "creteisland",
		2: "KLT",
	},
	4274: {
		0: "克利夫兰",
		1: "cleveland",
		2: "CLL",
	},
	3267: {
		0: "克罗地亚",
		1: "croatia",
		2: "HRV",
	},
	780: {
		0: "克山县",
		1: "keshan",
		2: "KS",
	},
	3534: {
		0: "克什克腾旗",
		1: "ketengqi",
		2: "KTQ",
	},
	333: {
		0: "克孜勒苏",
		1: "kezilesu",
		2: "KZL",
	},
	2497: {
		0: "肯尼亚",
		1: "kenya",
		2: "KNY",
	},
	2406: {
		0: "垦丁",
		1: "kenting",
		2: "KD",
	},
	1139: {
		0: "垦利区",
		1: "kenli",
		2: "KL",
	},
	2215: {
		0: "库车县",
		1: "kunche",
		2: "KC",
	},
	355: {
		0: "库尔勒市",
		1: "kuerle",
		2: "KEL",
	},
	3429: {
		0: "库克群岛",
		1: "cookislands",
		2: "COK",
	},
	3540: {
		0: "库伦旗",
		1: "kulunqi",
		2: "KLQ",
	},
	3350: {
		0: "库萨达斯",
		1: "kusadasi",
		2: "KUS",
	},
	2487: {
		0: "库斯科",
		1: "cuzco",
		2: "KSK",
	},
	4014: {
		0: "库特纳霍拉",
		1: "kutnahora",
		2: "KH",
	},
	475: {
		0: "宽城满族自治县",
		1: "kuancheng",
		2: "KC",
	},
	712: {
		0: "宽甸满族自治县",
		1: "kuandian",
		2: "KD",
	},
	354: {
		0: "奎屯市",
		1: "kuitun",
		2: "KT",
	},
	3286: {
		0: "魁北克",
		1: "quebec",
		2: "QBC",
	},
	267: {
		0: "昆明",
		1: "kunming",
		2: "KM",
	},
	416: {
		0: "昆山",
		1: "kunshan",
		2: "KS",
	},
	15237: {
		0: "昆士兰",
		1: "Queensland",
		2: "QUE",
	},
	4489: {
		0: "昆玉市",
		1: "kunyushi",
		2: "KYS",
	},
	10691: {
		0: "拉巴特",
		1: "Rabat",
		2: "RAB",
	},
	3318: {
		0: "拉贾斯坦邦",
		1: "rajasthan",
		2: "RAJ",
	},
	283: {
		0: "拉萨",
		1: "lasa",
		2: "LS",
	},
	3489: {
		0: "拉斯佩齐亚",
		1: "laspezia",
		2: "SPA",
	},
	2398: {
		0: "拉斯维加斯",
		1: "lasvegas",
		2: "LAS",
	},
	4003: {
		0: "拉脱维亚",
		1: "latvia",
		2: "LVA",
	},
	1984: {
		0: "拉孜县",
		1: "lazi",
		2: "LZ",
	},
	942: {
		0: "来安县",
		1: "laian",
		2: "LA",
	},
	398: {
		0: "来宾",
		1: "laibin",
		2: "LB",
	},
	1374: {
		0: "来凤县",
		1: "laifeng",
		2: "LF",
	},
	510: {
		0: "涞水县",
		1: "laishui",
		2: "LS",
	},
	505: {
		0: "涞源县",
		1: "laiyuan",
		2: "LY",
	},
	3438: {
		0: "莱比锡",
		1: "leipzig",
		2: "LBX",
	},
	4341: {
		0: "莱顿",
		1: "leiden",
		2: "LID",
	},
	4326: {
		0: "莱斯特",
		1: "leicester",
		2: "LEC",
	},
	4348: {
		0: "莱索托",
		1: "lesotho",
		2: "LS",
	},
	154: {
		0: "莱芜",
		1: "laiwu",
		2: "LW",
	},
	1168: {
		0: "莱西市",
		1: "laixi",
		2: "LX",
	},
	1156: {
		0: "莱阳市",
		1: "laiyang",
		2: "LY",
	},
	3450: {
		0: "莱茵兰-普法尔茨",
		1: "palatinate",
		2: "RPT",
	},
	1157: {
		0: "莱州市",
		1: "laizhou",
		2: "LZ",
	},
	15098: {
		0: "濑户内海",
		1: "SetoNaikai",
		2: "SET",
	},
	4101: {
		0: "兰达岛",
		1: "kolanta",
		2: "KOL",
	},
	2361: {
		0: "兰卡威",
		1: "langkawi",
		2: "LGK",
	},
	1259: {
		0: "兰考县",
		1: "lankao",
		2: "LK",
	},
	1172: {
		0: "兰陵县",
		1: "lanling",
		2: "LL",
	},
	1882: {
		0: "兰坪白族普米族自治县",
		1: "lanping",
		2: "LP",
	},
	4077: {
		0: "兰斯",
		1: "reims",
		2: "RMS",
	},
	819: {
		0: "兰西县",
		1: "lanxixian",
		2: "LX",
	},
	892: {
		0: "兰溪市",
		1: "lanxi",
		2: "LX",
	},
	299: {
		0: "兰州",
		1: "lanzhou",
		2: "LZ",
	},
	2076: {
		0: "岚皋县",
		1: "langao",
		2: "LG",
	},
	4482: {
		0: "岚山区",
		1: "lanshanqu",
		2: "LSQ",
	},
	654: {
		0: "岚县",
		1: "lanxian",
		2: "LX",
	},
	3406: {
		0: "蓝毗尼",
		1: "lumbini",
		2: "LUM",
	},
	15241: {
		0: "蓝山",
		1: "Blue-Mountain",
		2: "BLU",
	},
	1427: {
		0: "蓝山县",
		1: "lanshan",
		2: "LS",
	},
	2004: {
		0: "蓝田县",
		1: "lantian",
		2: "LT",
	},
	1865: {
		0: "澜沧拉祜族自治县",
		1: "lancang",
		2: "LC",
	},
	976: {
		0: "郎溪县",
		1: "langxi",
		2: "LX",
	},
	33: {
		0: "廊坊",
		1: "langfang",
		2: "LF",
	},
	3218: {
		0: "琅勃拉邦",
		1: "luangprabang",
		2: "LPR",
	},
	4114: {
		0: "朗塞斯顿",
		1: "launceston",
		2: "LCT",
	},
	1966: {
		0: "朗县",
		1: "langxian",
		2: "LX",
	},
	1630: {
		0: "阆中市",
		1: "langzhong",
		2: "LZ",
	},
	1978: {
		0: "浪卡子县",
		1: "kalangzi",
		2: "LKZ",
	},
	10099: {
		0: "劳德代尔堡",
		1: "FortLauderdale",
		2: "FL",
	},
	4144: {
		0: "劳特布龙嫩",
		1: "lauterbrunnen",
		2: "LTB",
	},
	1322: {
		0: "老河口市",
		1: "laohekou",
		2: "LHK",
	},
	3217: {
		0: "老街",
		1: "Lao-cai",
		2: "LAO",
	},
	2490: {
		0: "老挝",
		1: "laos",
		2: "LW",
	},
	1092: {
		0: "乐安县",
		1: "lean",
		2: "LA",
	},
	1471: {
		0: "乐昌市",
		1: "lecang",
		2: "LC",
	},
	399: {
		0: "乐东",
		1: "ledong",
		2: "LD",
	},
	1129: {
		0: "乐陵市",
		1: "leling",
		2: "LL",
	},
	1052: {
		0: "乐平市",
		1: "leping",
		2: "LP",
	},
	246: {
		0: "乐山",
		1: "leshan",
		2: "LS",
	},
	485: {
		0: "乐亭县",
		1: "leting",
		2: "LT",
	},
	1582: {
		0: "乐业县",
		1: "leye",
		2: "LY",
	},
	1680: {
		0: "乐至县",
		1: "lezhi",
		2: "LZ",
	},
	1738: {
		0: "雷波县",
		1: "leibo",
		2: "LB",
	},
	4084: {
		0: "雷恩",
		1: "rennes",
		2: "RM",
	},
	3466: {
		0: "雷根斯堡",
		1: "regensburg",
		2: "RDG",
	},
	3276: {
		0: "雷克雅未克",
		1: "reykjavik",
		2: "LKY",
	},
	10662: {
		0: "雷诺",
		1: "Reno",
		2: "REN",
	},
	1792: {
		0: "雷山县",
		1: "leishan",
		2: "LS",
	},
	1526: {
		0: "雷州市",
		1: "leizhou",
		2: "LZ",
	},
	1408: {
		0: "耒阳市",
		1: "leiyang",
		2: "LY",
	},
	1952: {
		0: "类乌齐县",
		1: "leiwuqi",
		2: "LMQ",
	},
	1452: {
		0: "冷水江市",
		1: "lengshuijiang",
		2: "LSJ",
	},
	743: {
		0: "梨树县",
		1: "lishu",
		2: "LS",
	},
	2491: {
		0: "黎巴嫩",
		1: "lebanon",
		2: "LBN",
	},
	596: {
		0: "黎城县",
		1: "licheng",
		2: "LC",
	},
	1089: {
		0: "黎川县",
		1: "lichuanxian",
		2: "LC",
	},
	1789: {
		0: "黎平县",
		1: "liping",
		2: "LP",
	},
	517: {
		0: "蠡县",
		1: "lixian",
		2: "LX",
	},
	2035: {
		0: "礼泉县",
		1: "liquan",
		2: "LQ",
	},
	2137: {
		0: "礼县",
		1: "lnlixian",
		2: "LX",
	},
	2393: {
		0: "里昂",
		1: "lyon",
		2: "LYN",
	},
	4071: {
		0: "里尔",
		1: "lille",
		2: "LIL",
	},
	4004: {
		0: "里加",
		1: "riga",
		2: "RIG",
	},
	10941: {
		0: "里贾纳",
		1: "Regina",
		2: "REG",
	},
	3492: {
		0: "里米尼",
		1: "rimini",
		2: "RMI",
	},
	4234: {
		0: "里士满",
		1: "richmond",
		2: "LSM",
	},
	2434: {
		0: "里斯本",
		1: "lisbon",
		2: "LSB",
	},
	2483: {
		0: "里约热内卢",
		1: "riodejaneiro",
		2: "LYR",
	},
	1719: {
		0: "理塘县",
		1: "litang",
		2: "LT",
	},
	1696: {
		0: "理县",
		1: "ablixian",
		2: "LX",
	},
	1385: {
		0: "澧县",
		1: "cdlixian",
		2: "LX",
	},
	1399: {
		0: "醴陵市",
		1: "liling",
		2: "LL",
	},
	4170: {
		0: "立陶宛",
		1: "lithuania",
		2: "LTU",
	},
	279: {
		0: "丽江",
		1: "lijiang",
		2: "LJ",
	},
	109: {
		0: "丽水",
		1: "lishui",
		2: "LS",
	},
	3284: {
		0: "利比里亚",
		1: "liberia",
		2: "LBR",
	},
	3283: {
		0: "利比亚",
		1: "libya",
		2: "LBY",
	},
	1369: {
		0: "利川市",
		1: "lichuan",
		2: "LC",
	},
	15245: {
		0: "利古里亚",
		1: "Liguria",
		2: "LIG",
	},
	1140: {
		0: "利津县",
		1: "lijin",
		2: "LJ",
	},
	2488: {
		0: "利马",
		1: "lima",
		2: "LM",
	},
	2469: {
		0: "利物浦",
		1: "liverpool",
		2: "LWP",
	},
	930: {
		0: "利辛县",
		1: "lixin",
		2: "LX",
	},
	4305: {
		0: "利兹",
		1: "leeds",
		2: "LIZ",
	},
	1797: {
		0: "荔波县",
		1: "libo",
		2: "LB",
	},
	1544: {
		0: "荔浦市",
		1: "lipu",
		2: "LPS",
	},
	415: {
		0: "溧水区",
		1: "lishuixian",
		2: "LS",
	},
	867: {
		0: "溧阳",
		1: "liyang",
		2: "LY",
	},
	1029: {
		0: "连城县",
		1: "liancheng",
		2: "LC",
	},
	983: {
		0: "连江县",
		1: "lianjiangxian",
		2: "LJ",
	},
	1470: {
		0: "连南瑶族自治县",
		1: "liannan",
		2: "LN",
	},
	1480: {
		0: "连平县",
		1: "lianping",
		2: "LP",
	},
	1469: {
		0: "连山壮族瑶族自治县",
		1: "lianshan",
		2: "LS",
	},
	95: {
		0: "连云港",
		1: "lianyuangang",
		2: "LYG",
	},
	1465: {
		0: "连州市",
		1: "lianzhou",
		2: "LZ",
	},
	844: {
		0: "涟水县",
		1: "lianshui",
		2: "LS",
	},
	1453: {
		0: "涟源市",
		1: "lianyuan",
		2: "LY",
	},
	1057: {
		0: "莲花县",
		1: "lianhua",
		2: "LH",
	},
	1525: {
		0: "廉江市",
		1: "lianjian",
		2: "LJ",
	},
	3504: {
		0: "濂溪区",
		1: "lushan",
		2: "LS",
	},
	3190: {
		0: "镰仓",
		1: "kamakura",
		2: "KMK",
	},
	677: {
		0: "凉城县",
		1: "liangcheng",
		2: "LC",
	},
	257: {
		0: "凉山",
		1: "liangshan",
		2: "LS",
	},
	1876: {
		0: "梁河县",
		1: "lianghe",
		2: "LH",
	},
	2292: {
		0: "梁平区",
		1: "liangping",
		2: "LP",
	},
	1190: {
		0: "梁山县",
		1: "liangshanxian",
		2: "LS",
	},
	2138: {
		0: "两当县",
		1: "liangdang",
		2: "LD",
	},
	65: {
		0: "辽阳",
		1: "liaoyang",
		2: "LY",
	},
	706: {
		0: "辽阳县",
		1: "liaoyangxian",
		2: "LYX",
	},
	73: {
		0: "辽源",
		1: "liaoyuan",
		2: "LY",
	},
	685: {
		0: "辽中区",
		1: "liaozhong",
		2: "LZ",
	},
	157: {
		0: "聊城",
		1: "liaocheng",
		2: "LC",
	},
	4046: {
		0: "列日",
		1: "liege",
		2: "LEI",
	},
	3279: {
		0: "列支敦士登",
		1: "liechtenstein",
		2: "LIE",
	},
	1639: {
		0: "邻水县",
		1: "linshui",
		2: "LS",
	},
	3392: {
		0: "林茨",
		1: "linz",
		2: "LIN",
	},
	3467: {
		0: "林道",
		1: "lindau",
		2: "LI",
	},
	790: {
		0: "林甸县",
		1: "lindian",
		2: "LD",
	},
	814: {
		0: "林口县",
		1: "linkou",
		2: "LK",
	},
	664: {
		0: "林西县",
		1: "linxixian",
		2: "LX",
	},
	289: {
		0: "林芝市",
		1: "linzhi",
		2: "LZ",
	},
	1245: {
		0: "林州市",
		1: "linzhou",
		2: "LZ",
	},
	1932: {
		0: "林周县",
		1: "linzhouxian",
		2: "LZ",
	},
	868: {
		0: "临安",
		1: "linan",
		2: "LA",
	},
	282: {
		0: "临沧",
		1: "linchang",
		2: "LC",
	},
	545: {
		0: "临城县",
		1: "lincheng",
		2: "LC",
	},
	44: {
		0: "临汾",
		1: "linfen",
		2: "LF",
	},
	400: {
		0: "临高县",
		1: "lingao",
		2: "LG",
	},
	898: {
		0: "临海市",
		1: "linhai",
		2: "LH",
	},
	751: {
		0: "临江市",
		1: "linjian",
		2: "LJ",
	},
	1386: {
		0: "临澧县",
		1: "linli",
		2: "LL",
	},
	1122: {
		0: "临清市",
		1: "linqing",
		2: "LQ",
	},
	1151: {
		0: "临朐县",
		1: "linqu",
		2: "LQ",
	},
	932: {
		0: "临泉县",
		1: "linquan",
		2: "LQ",
	},
	1179: {
		0: "临沭县",
		1: "linshu",
		2: "LS",
	},
	2149: {
		0: "临潭县",
		1: "lintan",
		2: "LT",
	},
	2127: {
		0: "临洮县",
		1: "lintao",
		2: "LT",
	},
	4484: {
		0: "临潼区",
		1: "lintong",
		2: "LT",
	},
	1419: {
		0: "临武县",
		1: "linwu",
		2: "LW",
	},
	558: {
		0: "临西县",
		1: "linxi",
		2: "LX",
	},
	2140: {
		0: "临夏市",
		1: "linxia",
		2: "LX",
	},
	2141: {
		0: "临夏县",
		1: "linxiaxian",
		2: "LXX",
	},
	311: {
		0: "临夏州",
		1: "linxiazhou",
		2: "LXZ",
	},
	651: {
		0: "临县",
		1: "linxian",
		2: "LX",
	},
	1394: {
		0: "临湘市",
		1: "linxiang",
		2: "LX",
	},
	3518: {
		0: "临猗县",
		1: "yclinyixian",
		2: "LYX",
	},
	155: {
		0: "临沂",
		1: "linyi",
		2: "LY",
	},
	1136: {
		0: "临邑县",
		1: "linyixian",
		2: "LY",
	},
	1273: {
		0: "临颍县",
		1: "linying",
		2: "LY",
	},
	2109: {
		0: "临泽县",
		1: "linze",
		2: "LZ",
	},
	561: {
		0: "临漳县",
		1: "linzhang",
		2: "LZ",
	},
	4444: {
		0: "临淄",
		1: "linzi",
		2: "LZ",
	},
	2048: {
		0: "麟游县",
		1: "linyou",
		2: "LY",
	},
	1216: {
		0: "灵宝市",
		1: "lingbao",
		2: "LB",
	},
	925: {
		0: "灵璧县",
		1: "lingbi",
		2: "LB",
	},
	1537: {
		0: "灵川县",
		1: "lingchuanxian",
		2: "LC",
	},
	585: {
		0: "灵丘县",
		1: "lingqiu",
		2: "LQ",
	},
	1564: {
		0: "灵山县",
		1: "lingshan",
		2: "LS",
	},
	629: {
		0: "灵石县",
		1: "lingshi",
		2: "LS",
	},
	448: {
		0: "灵寿县",
		1: "lingshou",
		2: "LS",
	},
	2121: {
		0: "灵台县",
		1: "lingtai",
		2: "LT",
	},
	2189: {
		0: "灵武市",
		1: "lingwu",
		2: "LW",
	},
	717: {
		0: "凌海市",
		1: "linghai",
		2: "LH",
	},
	689: {
		0: "凌源市",
		1: "lingyuan",
		2: "LY",
	},
	1581: {
		0: "凌云县",
		1: "lingyun",
		2: "LY",
	},
	1131: {
		0: "陵城区",
		1: "lingxian",
		2: "LX",
	},
	606: {
		0: "陵川县",
		1: "lingchuan",
		2: "LC",
	},
	401: {
		0: "陵水",
		1: "lingshui",
		2: "LS",
	},
	1376: {
		0: "浏阳",
		1: "liuyang",
		2: "LY",
	},
	2059: {
		0: "留坝县",
		1: "liuba",
		2: "LB",
	},
	4160: {
		0: "留尼汪",
		1: "reunion",
		2: "REU",
	},
	1548: {
		0: "柳城县",
		1: "liucheng",
		2: "LC",
	},
	750: {
		0: "柳河县",
		1: "liuhe",
		2: "LH",
	},
	1547: {
		0: "柳江区",
		1: "liujiang",
		2: "LJ",
	},
	653: {
		0: "柳林县",
		1: "liulin",
		2: "LL",
	},
	225: {
		0: "柳州",
		1: "liuzhou",
		2: "LZ",
	},
	123: {
		0: "六安",
		1: "liuan",
		2: "LA",
	},
	259: {
		0: "六盘水",
		1: "liupanshui",
		2: "LPS",
	},
	1479: {
		0: "龙川县",
		1: "liuchuan",
		2: "LC",
	},
	4365: {
		0: "龙达",
		1: "ronda",
		2: "RON",
	},
	1015: {
		0: "龙海",
		1: "liuhai",
		2: "LH",
	},
	3615: {
		0: "龙虎山",
		1: "longhushan",
		2: "LHS",
	},
	775: {
		0: "龙江县",
		1: "longjiang",
		2: "LJ",
	},
	758: {
		0: "龙井市",
		1: "liujing",
		2: "LJ",
	},
	1155: {
		0: "龙口市",
		1: "liukou",
		2: "LK",
	},
	1804: {
		0: "龙里县",
		1: "liuli",
		2: "LL",
	},
	1842: {
		0: "龙陵县",
		1: "liuling",
		2: "LL",
	},
	1502: {
		0: "龙门县",
		1: "liumen",
		2: "LM",
	},
	15256: {
		0: "龙目岛",
		1: "Lombok",
		2: "LOM",
	},
	1068: {
		0: "龙南县",
		1: "liunan",
		2: "LN",
	},
	912: {
		0: "龙泉市",
		1: "liuquan",
		2: "LQ",
	},
	14430: {
		0: "龙仁",
		1: "yon",
		2: "YON",
	},
	1463: {
		0: "龙山县",
		1: "liushan",
		2: "LS",
	},
	1545: {
		0: "龙胜各族自治县",
		1: "longsheng",
		2: "LS",
	},
	132: {
		0: "龙岩",
		1: "longyan",
		2: "LY",
	},
	891: {
		0: "龙游县",
		1: "liuyou",
		2: "LY",
	},
	1574: {
		0: "龙州县",
		1: "longzhou",
		2: "LZ",
	},
	1533: {
		0: "隆安县",
		1: "longan",
		2: "LA",
	},
	1645: {
		0: "隆昌市",
		1: "longcang",
		2: "LC",
	},
	2197: {
		0: "隆德县",
		1: "longde",
		2: "LD",
	},
	473: {
		0: "隆化县",
		1: "longhua",
		2: "LH",
	},
	1436: {
		0: "隆回县",
		1: "longhui",
		2: "LH",
	},
	1585: {
		0: "隆林各族自治县",
		1: "longlin",
		2: "LL",
	},
	548: {
		0: "隆尧县",
		1: "longrao",
		2: "LR",
	},
	1976: {
		0: "隆子县",
		1: "longzi",
		2: "LZ",
	},
	1878: {
		0: "陇川县",
		1: "longchuan",
		2: "LC",
	},
	310: {
		0: "陇南",
		1: "longnan",
		2: "LN",
	},
	2131: {
		0: "陇西县",
		1: "longxi",
		2: "LX",
	},
	2046: {
		0: "陇县",
		1: "longxian",
		2: "LX",
	},
	203: {
		0: "娄底",
		1: "loudi",
		2: "LD",
	},
	577: {
		0: "娄烦县",
		1: "loufan",
		2: "LF",
	},
	4022: {
		0: "卢布尔雅那",
		1: "ljubljana",
		2: "LBR",
	},
	4137: {
		0: "卢加诺",
		1: "lugano",
		2: "LJN",
	},
	3486: {
		0: "卢卡",
		1: "lucca",
		2: "LCV",
	},
	2475: {
		0: "卢克索",
		1: "luxor",
		2: "LKS",
	},
	479: {
		0: "卢龙县",
		1: "lulong",
		2: "LL",
	},
	2442: {
		0: "卢塞恩",
		1: "luzern",
		2: "LSE",
	},
	3312: {
		0: "卢森堡",
		1: "luxembourg",
		2: "LUX",
	},
	3313: {
		0: "卢森堡市",
		1: "luxembourgcity",
		2: "LSB",
	},
	1219: {
		0: "卢氏县",
		1: "lushi",
		2: "LS",
	},
	3311: {
		0: "卢旺达",
		1: "rwanda",
		2: "RWA",
	},
	968: {
		0: "庐江县",
		1: "lujian",
		2: "LJ",
	},
	1692: {
		0: "芦山县",
		1: "yalushan",
		2: "LS",
	},
	1059: {
		0: "芦溪县",
		1: "luxi",
		2: "LX",
	},
	1707: {
		0: "泸定县",
		1: "luding",
		2: "LD",
	},
	3623: {
		0: "泸沽湖",
		1: "luguhu",
		2: "LGH",
	},
	1879: {
		0: "泸水市",
		1: "lushui",
		2: "LS",
	},
	1918: {
		0: "泸西县",
		1: "hhluxi",
		2: "LX",
	},
	1457: {
		0: "泸溪县",
		1: "xxluxi",
		2: "LX",
	},
	1655: {
		0: "泸县",
		1: "luxian",
		2: "LX",
	},
	240: {
		0: "泸州",
		1: "luzhou",
		2: "LZ",
	},
	1712: {
		0: "炉霍县",
		1: "luhuo",
		2: "LH",
	},
	4050: {
		0: "鲁昂",
		1: "rouen",
		2: "REN",
	},
	1844: {
		0: "鲁甸县",
		1: "ludian",
		2: "LD",
	},
	1278: {
		0: "鲁山县",
		1: "pdslushan",
		2: "LS",
	},
	4045: {
		0: "鲁汶",
		1: "leuven",
		2: "LEU",
	},
	3599: {
		0: "甪直",
		1: "luzhi",
		2: "LZ",
	},
	1562: {
		0: "陆川县",
		1: "luchuan",
		2: "LC",
	},
	1497: {
		0: "陆丰市",
		1: "lufeng",
		2: "LF",
	},
	1499: {
		0: "陆河县",
		1: "luhe",
		2: "LH",
	},
	1830: {
		0: "陆良县",
		1: "luliang",
		2: "LL",
	},
	1400: {
		0: "渌口区",
		1: "zhuzhouxian",
		2: "LKQ",
	},
	3194: {
		0: "鹿儿岛",
		1: "kagoshima",
		2: "KGS",
	},
	443: {
		0: "鹿泉区",
		1: "luquan",
		2: "LQ",
	},
	2429: {
		0: "鹿特丹",
		1: "rotterdam",
		2: "LTD",
	},
	1303: {
		0: "鹿邑县",
		1: "luyi",
		2: "LY",
	},
	1549: {
		0: "鹿寨县",
		1: "luzhai",
		2: "LZ",
	},
	1907: {
		0: "禄丰县",
		1: "lufengxian",
		2: "LF",
	},
	1822: {
		0: "禄劝彝族苗族自治县",
		1: "luquanxian",
		2: "LQ",
	},
	2154: {
		0: "碌曲县",
		1: "luqu",
		2: "LQ",
	},
	591: {
		0: "潞城区",
		1: "lucheng",
		2: "LCQ",
	},
	3463: {
		0: "吕贝克",
		1: "lubeck",
		2: "LBK",
	},
	3470: {
		0: "吕德斯海姆",
		1: "rudesheim",
		2: "RDM",
	},
	45: {
		0: "吕梁",
		1: "lvliang",
		2: "LL",
	},
	1914: {
		0: "绿春县",
		1: "lvchun",
		2: "LC",
	},
	446: {
		0: "栾城区",
		1: "luancheng",
		2: "LC",
	},
	1223: {
		0: "栾川县",
		1: "luanchuan",
		2: "LC",
	},
	484: {
		0: "滦南县",
		1: "luannan",
		2: "LN",
	},
	472: {
		0: "滦平县",
		1: "luanping",
		2: "LP",
	},
	483: {
		0: "滦州市",
		1: "luanxian",
		2: "LZS",
	},
	2057: {
		0: "略阳县",
		1: "lueyang",
		2: "LY",
	},
	3478: {
		0: "伦巴第大区",
		1: "lombardy",
		2: "LOM",
	},
	2464: {
		0: "伦敦",
		1: "london",
		2: "LD",
	},
	2251: {
		0: "轮台县",
		1: "luntai",
		2: "LT",
	},
	1594: {
		0: "罗城仫佬族自治县",
		1: "luocheng",
		2: "LC",
	},
	1802: {
		0: "罗甸县",
		1: "luodian",
		2: "LD",
	},
	1513: {
		0: "罗定市",
		1: "luoding",
		2: "LD",
	},
	1628: {
		0: "罗江区",
		1: "luojian",
		2: "LJ",
	},
	2458: {
		0: "罗马",
		1: "rome",
		2: "LM",
	},
	4180: {
		0: "罗马尼亚",
		1: "romania",
		2: "ROU",
	},
	15251: {
		0: "罗讷河口",
		1: "bou",
		2: "BOU",
	},
	1828: {
		0: "罗平县",
		1: "luoping",
		2: "LP",
	},
	1296: {
		0: "罗山县",
		1: "luoshan",
		2: "LS",
	},
	3437: {
		0: "罗滕堡",
		1: "Rothenburg",
		2: "RTB",
	},
	1340: {
		0: "罗田县",
		1: "luotian",
		2: "LT",
	},
	4024: {
		0: "罗托鲁瓦",
		1: "rotorua",
		2: "LTL",
	},
	4295: {
		0: "罗瓦涅米",
		1: "rovaniemi",
		2: "RVN",
	},
	984: {
		0: "罗源县",
		1: "luoyuan",
		2: "LY",
	},
	792: {
		0: "萝北县",
		1: "luobei",
		2: "LB",
	},
	2016: {
		0: "洛川县",
		1: "luochuan",
		2: "LC",
	},
	1958: {
		0: "洛隆县",
		1: "luolong",
		2: "LL",
	},
	2081: {
		0: "洛南县",
		1: "luonan",
		2: "LN",
	},
	1227: {
		0: "洛宁县",
		1: "luoning",
		2: "LN",
	},
	2226: {
		0: "洛浦县",
		1: "luopu",
		2: "LP",
	},
	3122: {
		0: "洛桑",
		1: "lausanne",
		2: "LS",
	},
	2397: {
		0: "洛杉矶",
		1: "losangeles",
		2: "LAX",
	},
	162: {
		0: "洛阳",
		1: "luoyang",
		2: "LY",
	},
	1974: {
		0: "洛扎县",
		1: "luozha",
		2: "LZ",
	},
	170: {
		0: "漯河",
		1: "luohe",
		2: "LH",
	},
	1337: {
		0: "麻城市",
		1: "macheng",
		2: "MC",
	},
	1793: {
		0: "麻江县",
		1: "majian",
		2: "MJ",
	},
	1927: {
		0: "麻栗坡县",
		1: "malipo",
		2: "MLP",
	},
	1447: {
		0: "麻阳苗族自治县",
		1: "mayang",
		2: "MY",
	},
	4464: {
		0: "麻涌镇",
		1: "mayong",
		2: "MY",
	},
	114: {
		0: "马鞍山",
		1: "maanshan",
		2: "MAS",
	},
	1652: {
		0: "马边彝族自治县",
		1: "mabian",
		2: "MB",
	},
	2498: {
		0: "马达加斯加",
		1: "madagascar",
		2: "MDJ",
	},
	4391: {
		0: "马德拉群岛",
		1: "madeiraislands",
		2: "MDI",
	},
	2450: {
		0: "马德里",
		1: "madrid",
		2: "MDL",
	},
	2324: {
		0: "马尔代夫",
		1: "maldives",
		2: "MDV",
	},
	1694: {
		0: "马尔康市",
		1: "maerkang",
		2: "MEK",
	},
	2438: {
		0: "马尔默",
		1: "malmo",
		2: "MEM",
	},
	4409: {
		0: "马耳他",
		1: "malta",
		2: "MT",
	},
	1928: {
		0: "马关县",
		1: "maguan",
		2: "MG",
	},
	4366: {
		0: "马拉加",
		1: "malaga",
		2: "AGP",
	},
	2476: {
		0: "马拉喀什",
		1: "marrakech",
		2: "MLK",
	},
	4392: {
		0: "马拉维",
		1: "malawi",
		2: "MAW",
	},
	2312: {
		0: "马来西亚",
		1: "malaysia",
		2: "MY",
	},
	11852: {
		0: "马累",
		1: "Male",
		2: "MAL",
	},
	4411: {
		0: "马里",
		1: "mali",
		2: "MAL",
	},
	15133: {
		0: "马里兰州",
		1: "Maryland",
		2: "MAR",
	},
	15170: {
		0: "马林",
		1: "Marin",
		2: "MAR",
	},
	3033: {
		0: "马六甲",
		1: "malacca",
		2: "MLK",
	},
	1825: {
		0: "马龙区",
		1: "maliu",
		2: "MLQ",
	},
	2452: {
		0: "马略卡岛",
		1: "majorca",
		2: "MLK",
	},
	2354: {
		0: "马尼拉",
		1: "manila",
		2: "MNL",
	},
	4389: {
		0: "马其顿",
		1: "macedonia",
		2: "MKD",
	},
	2489: {
		0: "马丘比丘",
		1: "machupicchu",
		2: "MQB",
	},
	15134: {
		0: "马萨诸塞州",
		1: "Massachusetts",
		2: "MAS",
	},
	2392: {
		0: "马赛",
		1: "marseille",
		2: "MRS",
	},
	4290: {
		0: "马赛马拉国家保护区",
		1: "masaimara",
		2: "MMN",
	},
	1534: {
		0: "马山县",
		1: "mashan",
		2: "MS",
	},
	4342: {
		0: "马斯特里赫特",
		1: "maastricht",
		2: "MST",
	},
	4393: {
		0: "马提尼克",
		1: "martinique",
		2: "MTQ",
	},
	2178: {
		0: "玛多县",
		1: "maduo",
		2: "MD",
	},
	2247: {
		0: "玛纳斯县",
		1: "manasi",
		2: "MNS",
	},
	2173: {
		0: "玛沁县",
		1: "maqin",
		2: "MQ",
	},
	2153: {
		0: "玛曲县",
		1: "maqu",
		2: "MQ",
	},
	2402: {
		0: "迈阿密",
		1: "miami",
		2: "MIA",
	},
	4237: {
		0: "麦迪逊",
		1: "madison",
		2: "MDX",
	},
	2208: {
		0: "麦盖提县",
		1: "maigaiti",
		2: "MGT",
	},
	501: {
		0: "满城区",
		1: "mancheng",
		2: "KC",
	},
	667: {
		0: "满洲里市",
		1: "manzhouli",
		2: "MZL",
	},
	2467: {
		0: "曼彻斯特",
		1: "manchester",
		2: "MCS",
	},
	3225: {
		0: "曼德勒",
		1: "mandalay",
		2: "MDL",
	},
	2342: {
		0: "曼谷",
		1: "bangkok",
		2: "BKK",
	},
	3458: {
		0: "曼海姆",
		1: "mannheim",
		2: "MNH",
	},
	1957: {
		0: "芒康县",
		1: "mangkang",
		2: "MK",
	},
	1874: {
		0: "芒市",
		1: "luxishi",
		2: "MS",
	},
	4085: {
		0: "芒通",
		1: "menton",
		2: "MNT",
	},
	4491: {
		0: "茫崖市",
		1: "mangyashi",
		2: "MYS",
	},
	2329: {
		0: "毛里求斯",
		1: "mauritius",
		2: "MUS",
	},
	4047: {
		0: "毛里塔尼亚",
		1: "mauritania",
		2: "MRT",
	},
	211: {
		0: "茂名",
		1: "maoming",
		2: "MM",
	},
	1697: {
		0: "茂县",
		1: "maoxian",
		2: "MX",
	},
	15120: {
		0: "茂宜岛",
		1: "Maui",
		2: "MAU",
	},
	248: {
		0: "眉山",
		1: "meishan",
		2: "MS",
	},
	2045: {
		0: "眉县",
		1: "bjmeixian",
		2: "MX",
	},
	363: {
		0: "梅河口市",
		1: "meihekou",
		2: "MHK",
	},
	1484: {
		0: "梅县区",
		1: "meixian",
		2: "MX",
	},
	214: {
		0: "梅州",
		1: "meizhou",
		2: "MZ",
	},
	1752: {
		0: "湄潭县",
		1: "meitan",
		2: "MT",
	},
	1737: {
		0: "美姑县",
		1: "meigu",
		2: "MG",
	},
	2332: {
		0: "美国",
		1: "unitedstates",
		2: "USA",
	},
	11182: {
		0: "美娜多",
		1: "Manado",
		2: "MAN",
	},
	3212: {
		0: "美奈",
		1: "muine",
		2: "MIN",
	},
	10350: {
		0: "美蕊沙",
		1: "Mirissa",
		2: "MIR",
	},
	3436: {
		0: "美因茨",
		1: "mainz",
		2: "MYZ",
	},
	15028: {
		0: "美瑛",
		1: "Biei",
		2: "BIE",
	},
	4288: {
		0: "美属萨摩亚",
		1: "americansamoa",
		2: "AS",
	},
	4287: {
		0: "美属维尔京群岛",
		1: "usvirginislands",
		2: "USV",
	},
	4454: {
		0: "门头沟区",
		1: "mentougou",
		2: "MTG",
	},
	2168: {
		0: "门源回族自治县",
		1: "menyuan",
		2: "MY",
	},
	1909: {
		0: "勐海县",
		1: "menghai",
		2: "MH",
	},
	1910: {
		0: "勐腊县",
		1: "mengla",
		2: "ML",
	},
	4075: {
		0: "蒙彼利埃",
		1: "montpellier",
		2: "MOL",
	},
	929: {
		0: "蒙城县",
		1: "mengcheng",
		2: "MC",
	},
	15141: {
		0: "蒙大拿州",
		1: "Montana",
		2: "MON",
	},
	3178: {
		0: "蒙古",
		1: "mongolia",
		2: "MON",
	},
	1556: {
		0: "蒙山县",
		1: "mengshan",
		2: "MS",
	},
	4140: {
		0: "蒙特勒",
		1: "montreux",
		2: "MTX",
	},
	4421: {
		0: "蒙特雷",
		1: "monterrey",
		2: "MOY",
	},
	2412: {
		0: "蒙特利尔",
		1: "montreal",
		2: "MTL",
	},
	4354: {
		0: "蒙特塞拉特",
		1: "montserrat",
		2: "MNI",
	},
	1175: {
		0: "蒙阴县",
		1: "mengyin",
		2: "MY",
	},
	1911: {
		0: "蒙自市",
		1: "mengzi",
		2: "MZ",
	},
	541: {
		0: "孟村回族自治县",
		1: "mengcun",
		2: "MC",
	},
	3398: {
		0: "孟加拉国",
		1: "bangladesh",
		2: "BAN",
	},
	1221: {
		0: "孟津县",
		1: "mengjin",
		2: "MJ",
	},
	1864: {
		0: "孟连傣族拉祜族佤族自治县",
		1: "menglian",
		2: "ML",
	},
	2409: {
		0: "孟买",
		1: "mumbai",
		2: "MM",
	},
	1229: {
		0: "孟州市",
		1: "mengzhou",
		2: "MZ",
	},
	1889: {
		0: "弥渡县",
		1: "midu",
		2: "MD",
	},
	1917: {
		0: "弥勒市",
		1: "mile",
		2: "ML",
	},
	2456: {
		0: "米科诺斯",
		1: "mykonos",
		2: "MKN",
	},
	3124: {
		0: "米兰",
		1: "milano",
		2: "MIL",
	},
	1962: {
		0: "米林县",
		1: "milin",
		2: "ML",
	},
	1668: {
		0: "米易县",
		1: "miyi",
		2: "MY",
	},
	2067: {
		0: "米脂县",
		1: "mizhi",
		2: "MZ",
	},
	1393: {
		0: "汨罗市",
		1: "miluo",
		2: "ML",
	},
	3403: {
		0: "密克罗尼西亚",
		1: "micronesia",
		2: "FSM",
	},
	807: {
		0: "密山市",
		1: "mishan",
		2: "MS",
	},
	15140: {
		0: "密苏里州",
		1: "Missouri",
		2: "MIS",
	},
	15136: {
		0: "密歇根州",
		1: "Michigan",
		2: "MIC",
	},
	434: {
		0: "密云区",
		1: "miyun",
		2: "MY",
	},
	242: {
		0: "绵阳",
		1: "mianyang",
		2: "MY",
	},
	1627: {
		0: "绵竹市",
		1: "mianzhu",
		2: "MZ",
	},
	2448: {
		0: "棉花堡",
		1: "pamukkale",
		2: "MHB",
	},
	2055: {
		0: "勉县",
		1: "mianxian",
		2: "MX",
	},
	1734: {
		0: "冕宁县",
		1: "mianning",
		2: "MN",
	},
	2493: {
		0: "缅甸",
		1: "myanmar",
		2: "MD",
	},
	3177: {
		0: "苗栗",
		1: "miaoli",
		2: "MLI",
	},
	3325: {
		0: "民丹岛",
		1: "pulaubintan",
		2: "PBN",
	},
	2229: {
		0: "民丰县",
		1: "minfeng",
		2: "MF",
	},
	2161: {
		0: "民和回族土族自治县",
		1: "minhe",
		2: "MH",
	},
	2108: {
		0: "民乐县",
		1: "minle",
		2: "ML",
	},
	2099: {
		0: "民勤县",
		1: "minqin",
		2: "MQ",
	},
	1262: {
		0: "民权县",
		1: "minquan",
		2: "MQ",
	},
	2129: {
		0: "岷县",
		1: "minxian",
		2: "MX",
	},
	982: {
		0: "闽侯县",
		1: "minhou",
		2: "MH",
	},
	985: {
		0: "闽清县",
		1: "minqing",
		2: "MQ",
	},
	3080: {
		0: "名古屋",
		1: "nagoya",
		2: "NGO",
	},
	940: {
		0: "明光市",
		1: "mingguang",
		2: "MG",
	},
	4271: {
		0: "明尼阿波利斯",
		1: "minneapolis",
		2: "MNA",
	},
	15138: {
		0: "明尼苏达州",
		1: "Minnesota",
		2: "MIN",
	},
	822: {
		0: "明水县",
		1: "mingshui",
		2: "MS",
	},
	4162: {
		0: "明斯克",
		1: "minsk",
		2: "MSK",
	},
	999: {
		0: "明溪县",
		1: "mingxi",
		2: "MX",
	},
	3616: {
		0: "明月山",
		1: "mingyueshan",
		2: "MYS",
	},
	4015: {
		0: "摩尔多瓦",
		1: "moldova",
		2: "MDA",
	},
	7641: {
		0: "摩尔曼斯克",
		1: "Murmansk",
		2: "MUR",
	},
	4016: {
		0: "摩洛哥",
		1: "morocco",
		2: "MAR",
	},
	3156: {
		0: "摩纳哥",
		1: "monaco",
		2: "MNC",
	},
	3605: {
		0: "莫干山",
		1: "moganshan",
		2: "MGS",
	},
	3551: {
		0: "莫力达瓦达斡尔族自治旗",
		1: "molidawaqi",
		2: "MLD",
	},
	15171: {
		0: "莫诺",
		1: "Mono",
		2: "MON",
	},
	4347: {
		0: "莫桑比克",
		1: "mozambique",
		2: "MOZ",
	},
	3150: {
		0: "莫斯科",
		1: "moscow",
		2: "MOS",
	},
	826: {
		0: "漠河县",
		1: "mohe",
		2: "MH",
	},
	2322: {
		0: "墨尔本",
		1: "melbourne",
		2: "MEL",
	},
	1859: {
		0: "墨江哈尼族自治县",
		1: "mojiang",
		2: "MJ",
	},
	1963: {
		0: "墨脱县",
		1: "motuo",
		2: "MT",
	},
	3383: {
		0: "墨西哥",
		1: "mexico",
		2: "MEX",
	},
	2481: {
		0: "墨西哥城",
		1: "mexicocity",
		2: "MXG",
	},
	2224: {
		0: "墨玉县",
		1: "moyu",
		2: "MY",
	},
	1938: {
		0: "墨竹工卡县",
		1: "muzhugongka",
		2: "MZG",
	},
	1900: {
		0: "牟定县",
		1: "moding",
		2: "MD",
	},
	4437: {
		0: "牟平",
		1: "mouping",
		2: "MP",
	},
	88: {
		0: "牡丹江",
		1: "mudanjiang",
		2: "MDJ",
	},
	770: {
		0: "木兰县",
		1: "mulan",
		2: "ML",
	},
	2250: {
		0: "木垒哈萨克自治县",
		1: "mulei",
		2: "ML",
	},
	1739: {
		0: "木里藏族自治县",
		1: "muli",
		2: "ML",
	},
	1650: {
		0: "沐川县",
		1: "muchuan",
		2: "MC",
	},
	2427: {
		0: "慕尼黑",
		1: "munich",
		2: "MNH",
	},
	809: {
		0: "穆棱市",
		1: "muleng",
		2: "ML",
	},
	1217: {
		0: "渑池县",
		1: "shenchixian",
		2: "MC",
	},
	4223: {
		0: "罗利",
		1: "raleigh",
		2: "NLL",
	},
	3414: {
		0: "拿骚",
		1: "nassau",
		2: "NAS",
	},
	15143: {
		0: "内华达州",
		1: "Nevada",
		2: "NEV",
	},
	1249: {
		0: "内黄县",
		1: "neihuang",
		2: "NH",
	},
	245: {
		0: "内江",
		1: "neijiang",
		2: "NJ",
	},
	4289: {
		0: "内罗毕",
		1: "nairobi",
		2: "NRB",
	},
	546: {
		0: "内丘县",
		1: "neiqiu",
		2: "NQ",
	},
	1285: {
		0: "内乡县",
		1: "neixiang",
		2: "NX",
	},
	2461: {
		0: "那不勒斯",
		1: "naples",
		2: "NBL",
	},
	1580: {
		0: "那坡县",
		1: "napo",
		2: "NP",
	},
	287: {
		0: "那曲",
		1: "naqu",
		2: "NQ",
	},
	1939: {
		0: "那曲县",
		1: "naquxian",
		2: "NQX",
	},
	4291: {
		0: "纳库鲁",
		1: "nakuru",
		2: "NUU",
	},
	4178: {
		0: "纳米比亚",
		1: "namibia",
		2: "NAM",
	},
	4262: {
		0: "纳帕",
		1: "nappa",
		2: "NAP",
	},
	4420: {
		0: "纳什维尔",
		1: "nashville",
		2: "NAS",
	},
	1767: {
		0: "纳雍县",
		1: "nayong",
		2: "NY",
	},
	1967: {
		0: "乃东区",
		1: "naidong",
		2: "ND",
	},
	3034: {
		0: "奈良",
		1: "naraken",
		2: "NR",
	},
	3541: {
		0: "奈曼旗",
		1: "naimanqi",
		2: "NMQ",
	},
	4319: {
		0: "南安普敦",
		1: "southampton",
		2: "STE",
	},
	1010: {
		0: "南安市",
		1: "nanan",
		2: "NA",
	},
	1492: {
		0: "南澳县",
		1: "nanao",
		2: "NA",
	},
	1631: {
		0: "南部县",
		1: "nanbu",
		2: "NB",
	},
	134: {
		0: "南昌",
		1: "nanchang",
		2: "NC",
	},
	1038: {
		0: "南昌县",
		1: "nanchangxian",
		2: "NCX",
	},
	1088: {
		0: "南城县",
		1: "nancheng",
		2: "NC",
	},
	247: {
		0: "南充",
		1: "nanchong",
		2: "NC",
	},
	4431: {
		0: "南川区",
		1: "nanchuan",
		2: "NC",
	},
	3595: {
		0: "南戴河",
		1: "nandaihe",
		2: "NDH",
	},
	1587: {
		0: "南丹县",
		1: "nandan",
		2: "ND",
	},
	3307: {
		0: "南非",
		1: "southafrica",
		2: "ZAF",
	},
	1090: {
		0: "南丰县",
		1: "nanfeng",
		2: "NF",
	},
	542: {
		0: "南宫市",
		1: "nangong",
		2: "NG",
	},
	550: {
		0: "南和县",
		1: "nanhe",
		2: "NH",
	},
	1901: {
		0: "南华县",
		1: "nanhua",
		2: "NH",
	},
	1896: {
		0: "南涧彝族自治县",
		1: "nanjian",
		2: "NJ",
	},
	1671: {
		0: "南江县",
		1: "nanjiang",
		2: "NJ",
	},
	5: {
		0: "南京",
		1: "nanjing",
		2: "NJ",
	},
	1021: {
		0: "南靖县",
		1: "nanjingxian",
		2: "NJ",
	},
	1061: {
		0: "南康区",
		1: "nankang",
		2: "NK",
	},
	1251: {
		0: "南乐县",
		1: "nanle",
		2: "NL",
	},
	949: {
		0: "南陵县",
		1: "nanling",
		2: "NL",
	},
	1980: {
		0: "南木林县",
		1: "nanmulin",
		2: "NML",
	},
	224: {
		0: "南宁",
		1: "nanning",
		2: "NN",
	},
	538: {
		0: "南皮县",
		1: "nanpi",
		2: "NP",
	},
	131: {
		0: "南平",
		1: "nanping",
		2: "NP",
	},
	4459: {
		0: "南沙区",
		1: "nansha",
		2: "NS",
	},
	4054: {
		0: "南特",
		1: "nantes",
		2: "NAT",
	},
	94: {
		0: "南通",
		1: "nantong",
		2: "NT",
	},
	2504: {
		0: "南投",
		1: "riyuetan",
		2: "NT",
	},
	1390: {
		0: "南县",
		1: "nanxian",
		2: "NX",
	},
	1472: {
		0: "南雄市",
		1: "nanxiong",
		2: "NX",
	},
	172: {
		0: "南阳",
		1: "nanyang",
		2: "NY",
	},
	1325: {
		0: "南漳县",
		1: "nanzhang",
		2: "NZ",
	},
	1281: {
		0: "南召县",
		1: "nanzhao",
		2: "NZ",
	},
	2051: {
		0: "南郑区",
		1: "nanzheng",
		2: "NZ",
	},
	10522: {
		0: "楠迪",
		1: "Nadi",
		2: "NAD",
	},
	2183: {
		0: "囊谦县",
		1: "nangqian",
		2: "NQ",
	},
	774: {
		0: "讷河市",
		1: "nehe",
		2: "NH",
	},
	785: {
		0: "嫩江县",
		1: "nengjian",
		2: "NJ",
	},
	2333: {
		0: "尼泊尔",
		1: "nepal",
		2: "NPL",
	},
	4036: {
		0: "尼尔森",
		1: "nelson",
		2: "NLS",
	},
	10118: {
		0: "尼甘布",
		1: "Negombo",
		2: "NEG",
	},
	2266: {
		0: "尼勒克县",
		1: "nileke",
		2: "NLK",
	},
	1948: {
		0: "尼玛县",
		1: "nima",
		2: "NM",
	},
	4069: {
		0: "尼姆",
		1: "nimes",
		2: "NIM",
	},
	1934: {
		0: "尼木县",
		1: "nimu",
		2: "NM",
	},
	3405: {
		0: "尼日尔",
		1: "niger",
		2: "NIG",
	},
	15261: {
		0: "尼日利亚",
		1: "Nigeria",
		2: "NIG",
	},
	2390: {
		0: "尼斯",
		1: "nice",
		2: "NCE",
	},
	2414: {
		0: "尼亚加拉瀑布城(加拿大)",
		1: "niagarafalls",
		2: "NYJ",
	},
	10520: {
		0: "尼亚加拉瀑布城(美国)",
		1: "NiagaraFallsC",
		2: "NFC",
	},
	15019: {
		0: "鸟取",
		1: "Tottori",
		2: "TOT",
	},
	1994: {
		0: "聂拉木县",
		1: "nielamu",
		2: "NLM",
	},
	1942: {
		0: "聂荣县",
		1: "nierong",
		2: "NR",
	},
	812: {
		0: "宁安市",
		1: "ningan",
		2: "NA",
	},
	11: {
		0: "宁波",
		1: "ningbo",
		2: "NB",
	},
	663: {
		0: "宁城县",
		1: "ningcheng",
		2: "NC",
	},
	133: {
		0: "宁德",
		1: "ningde",
		2: "ND",
	},
	1071: {
		0: "宁都县",
		1: "ningdu",
		2: "ND",
	},
	1858: {
		0: "宁洱哈尼族彝族自治县",
		1: "ninger",
		2: "NE",
	},
	975: {
		0: "宁国市",
		1: "ningguo",
		2: "NG",
	},
	2308: {
		0: "宁海",
		1: "ninghai",
		2: "NH",
	},
	437: {
		0: "宁河区",
		1: "ninghe",
		2: "NH",
	},
	1001: {
		0: "宁化县",
		1: "ninghua",
		2: "NH",
	},
	1137: {
		0: "宁津县",
		1: "ningjin",
		2: "NJ",
	},
	551: {
		0: "宁晋县",
		1: "ningjing",
		2: "NJ",
	},
	1857: {
		0: "宁蒗彝族自治县",
		1: "ninglang",
		2: "NL",
	},
	1263: {
		0: "宁陵县",
		1: "ningling",
		2: "NL",
	},
	1573: {
		0: "宁明县",
		1: "ningming",
		2: "NM",
	},
	1728: {
		0: "宁南县",
		1: "ningnan",
		2: "NN",
	},
	2056: {
		0: "宁强县",
		1: "ningqiang",
		2: "NQ",
	},
	2074: {
		0: "宁陕县",
		1: "ningshan",
		2: "NS",
	},
	612: {
		0: "宁武县",
		1: "ningwu",
		2: "NW",
	},
	2118: {
		0: "宁县",
		1: "ningxian",
		2: "NX",
	},
	1379: {
		0: "宁乡市",
		1: "ningxiang",
		2: "NX",
	},
	1193: {
		0: "宁阳县",
		1: "ningyang",
		2: "NY",
	},
	1425: {
		0: "宁远县",
		1: "ningyuan",
		2: "NY",
	},
	2468: {
		0: "牛津",
		1: "oxford",
		2: "NJ",
	},
	4179: {
		0: "纽埃",
		1: "niue",
		2: "NIU",
	},
	4240: {
		0: "纽黑文",
		1: "newhaven",
		2: "NHW",
	},
	4307: {
		0: "纽卡斯尔",
		1: "newcastle",
		2: "NKS",
	},
	3443: {
		0: "纽伦堡",
		1: "nuremberg",
		2: "NUE",
	},
	2395: {
		0: "纽约",
		1: "New-York-City",
		2: "NEW",
	},
	15149: {
		0: "纽约州",
		1: "NewYorkState",
		2: "NYS",
	},
	727: {
		0: "农安县",
		1: "nongan",
		2: "NA",
	},
	280: {
		0: "怒江",
		1: "nujiang",
		2: "NJ",
	},
	11347: {
		0: "暖武里",
		1: "non",
		2: "NON",
	},
	4005: {
		0: "挪威",
		1: "norway",
		2: "NOR",
	},
	4303: {
		0: "诺丁汉",
		1: "nottingham",
		2: "NDH",
	},
	4056: {
		0: "诺曼底",
		1: "normandy",
		2: "NN",
	},
	3236: {
		0: "欧登塞",
		1: "odense",
		2: "PDS",
	},
	4100: {
		0: "帕岸岛",
		1: "kophangan",
		2: "KOP",
	},
	10348: {
		0: "帕多瓦",
		1: "Padua",
		2: "PAD",
	},
	3491: {
		0: "帕勒莫",
		1: "palermo",
		2: "PLM",
	},
	3411: {
		0: "帕坦",
		1: "patan",
		2: "PAT",
	},
	239: {
		0: "攀枝花",
		1: "panzhihua",
		2: "PZH",
	},
	66: {
		0: "盘锦",
		1: "panjin",
		2: "PJ",
	},
	716: {
		0: "盘山县",
		1: "panshan",
		2: "PS",
	},
	1744: {
		0: "盘州市",
		1: "panxian",
		2: "PX",
	},
	897: {
		0: "磐安县",
		1: "panan",
		2: "PA",
	},
	736: {
		0: "磐石市",
		1: "panshi",
		2: "PS",
	},
	3475: {
		0: "庞贝",
		1: "pompeii",
		2: "PMP",
	},
	832: {
		0: "沛县",
		1: "peixian",
		2: "PX",
	},
	3496: {
		0: "佩鲁贾",
		1: "perugia",
		2: "PRG",
	},
	4174: {
		0: "佩特拉",
		1: "petra",
		2: "PTR",
	},
	1683: {
		0: "彭山区",
		1: "pengshan",
		2: "PS",
	},
	2300: {
		0: "彭水苗族土家族自治县",
		1: "pengshui",
		2: "PS",
	},
	2199: {
		0: "彭阳县",
		1: "pengyang",
		2: "PY",
	},
	1051: {
		0: "彭泽县",
		1: "pengze",
		2: "PZ",
	},
	1605: {
		0: "彭州市",
		1: "pengzhou",
		2: "PZ",
	},
	1633: {
		0: "蓬安县",
		1: "pengan",
		2: "PA",
	},
	1158: {
		0: "蓬莱市",
		1: "penglai",
		2: "PL",
	},
	1640: {
		0: "蓬溪县",
		1: "pengxi",
		2: "PX",
	},
	15242: {
		0: "澎湖",
		1: "Penghu",
		2: "PEN",
	},
	828: {
		0: "邳州市",
		1: "pizhou",
		2: "PZ",
	},
	13999: {
		0: "皮尔",
		1: "Pierre",
		2: "PIE",
	},
	2347: {
		0: "皮皮岛",
		1: "kohphiphi",
		2: "PPI",
	},
	2225: {
		0: "皮山县",
		1: "pishan",
		2: "PS",
	},
	1610: {
		0: "郫都区",
		1: "pixian",
		2: "PX",
	},
	4186: {
		0: "匹兹堡",
		1: "pittsburgh",
		2: "PZB",
	},
	619: {
		0: "偏关县",
		1: "pianguan",
		2: "PG",
	},
	2159: {
		0: "平安区",
		1: "pingan",
		2: "PA",
	},
	1757: {
		0: "平坝区",
		1: "pingba",
		2: "PB",
	},
	1672: {
		0: "平昌县",
		1: "pingcang",
		2: "PC",
	},
	163: {
		0: "平顶山",
		1: "pingdingshan",
		2: "PDS",
	},
	589: {
		0: "平定县",
		1: "pingding",
		2: "PD",
	},
	1166: {
		0: "平度市",
		1: "pingdu",
		2: "PD",
	},
	4455: {
		0: "平谷区",
		1: "pinggu",
		2: "PG",
	},
	1577: {
		0: "平果县",
		1: "pingguo",
		2: "PG",
	},
	1022: {
		0: "平和县",
		1: "pinghe",
		2: "PH",
	},
	876: {
		0: "平湖市",
		1: "pinghu",
		2: "PH",
	},
	1398: {
		0: "平江县",
		1: "pingjian",
		2: "PJ",
	},
	1543: {
		0: "平乐县",
		1: "pingle",
		2: "PL",
	},
	2077: {
		0: "平利县",
		1: "pingli",
		2: "PL",
	},
	306: {
		0: "平凉",
		1: "pingliang",
		2: "PL",
	},
	3526: {
		0: "平陆县",
		1: "pingluxian",
		2: "PLX",
	},
	2192: {
		0: "平罗县",
		1: "pingluo",
		2: "PL",
	},
	1558: {
		0: "平南县",
		1: "pingnanxian",
		2: "PN",
	},
	471: {
		0: "平泉市",
		1: "pingquan",
		2: "PQ",
	},
	3180: {
		0: "平壤",
		1: "pyongyang",
		2: "PYY",
	},
	453: {
		0: "平山县",
		1: "pingshan",
		2: "PS",
	},
	595: {
		0: "平顺县",
		1: "pingshun",
		2: "PS",
	},
	987: {
		0: "平潭县",
		1: "pingtan",
		2: "PT",
	},
	1801: {
		0: "平塘县",
		1: "pingtang",
		2: "PT",
	},
	1624: {
		0: "平武县",
		1: "pingwu",
		2: "PW",
	},
	555: {
		0: "平乡县",
		1: "pingxiangxian",
		2: "PX",
	},
	908: {
		0: "平阳",
		1: "pingyang",
		2: "PY",
	},
	628: {
		0: "平遥县",
		1: "pingyao",
		2: "PY",
	},
	1176: {
		0: "平邑县",
		1: "pingyi",
		2: "PY",
	},
	1119: {
		0: "平阴县",
		1: "pingyin",
		2: "PY",
	},
	1313: {
		0: "平舆县",
		1: "pingyu",
		2: "PY",
	},
	1132: {
		0: "平原县",
		1: "pingyuan",
		2: "PY",
	},
	1488: {
		0: "平远县",
		1: "pingyuanxian",
		2: "PY",
	},
	1569: {
		0: "凭祥市",
		1: "pingxiangshi",
		2: "PX",
	},
	1923: {
		0: "屏边苗族自治县",
		1: "pingbian",
		2: "PB",
	},
	1035: {
		0: "屏南县",
		1: "pingnan",
		2: "PN",
	},
	1667: {
		0: "屏山县",
		1: "pingshanxian",
		2: "PS",
	},
	136: {
		0: "萍乡",
		1: "pingxiang",
		2: "PX",
	},
	1085: {
		0: "鄱阳县",
		1: "poyang",
		2: "PY",
	},
	4121: {
		0: "珀斯",
		1: "perth",
		2: "RTH",
	},
	127: {
		0: "莆田",
		1: "putian",
		2: "PT",
	},
	4351: {
		0: "葡萄牙",
		1: "portugal",
		2: "PRT",
	},
	2026: {
		0: "蒲城县",
		1: "puchengxian",
		2: "PC",
	},
	3224: {
		0: "蒲甘",
		1: "bagan",
		2: "BPA",
	},
	1612: {
		0: "蒲江县",
		1: "pujiangxian",
		2: "PJ",
	},
	641: {
		0: "蒲县",
		1: "puxian",
		2: "PX",
	},
	168: {
		0: "濮阳",
		1: "puyang",
		2: "PY",
	},
	1254: {
		0: "濮阳县",
		1: "puyangxian",
		2: "PY",
	},
	4321: {
		0: "朴茨茅斯",
		1: "portsmouth",
		2: "PTM",
	},
	1565: {
		0: "浦北县",
		1: "pubei",
		2: "PB",
	},
	993: {
		0: "浦城县",
		1: "pucheng",
		2: "PC",
	},
	896: {
		0: "浦江县",
		1: "pujiang",
		2: "PJ",
	},
	1809: {
		0: "普安县",
		1: "puan",
		2: "PA",
	},
	1758: {
		0: "普定县",
		1: "puding",
		2: "PD",
	},
	275: {
		0: "普洱",
		1: "puer",
		2: "PE",
	},
	1729: {
		0: "普格县",
		1: "puge",
		2: "PG",
	},
	2343: {
		0: "普吉岛",
		1: "phuket",
		2: "HKT",
	},
	430: {
		0: "普兰店区",
		1: "pulandian",
		2: "PLD",
	},
	1998: {
		0: "普兰县",
		1: "pulan",
		2: "PL",
	},
	4333: {
		0: "普利茅斯",
		1: "plymouth",
		2: "PLH",
	},
	3497: {
		0: "普利亚大区",
		1: "puglia",
		2: "PUG",
	},
	15250: {
		0: "普罗旺斯-阿尔卑斯-蓝色海岸",
		1: "pro-1",
		2: "PRO",
	},
	4419: {
		0: "普罗维登斯",
		1: "providence",
		2: "PRO",
	},
	1493: {
		0: "普宁市",
		1: "puning",
		2: "PN",
	},
	3608: {
		0: "普陀山",
		1: "putuoshan",
		2: "PTS",
	},
	1647: {
		0: "犍为县",
		1: "jianwei",
		2: "QW",
	},
	87: {
		0: "七台河",
		1: "qitaihe",
		2: "QTH",
	},
	1762: {
		0: "七星关区",
		1: "bijie",
		2: "QXG",
	},
	1153: {
		0: "栖霞市",
		1: "qixia",
		2: "QX",
	},
	1413: {
		0: "祁东县",
		1: "qidongxian",
		2: "QD",
	},
	2166: {
		0: "祁连县",
		1: "qilian",
		2: "QL",
	},
	962: {
		0: "祁门县",
		1: "qimen",
		2: "QM",
	},
	627: {
		0: "祁县",
		1: "qixian",
		2: "QX",
	},
	1430: {
		0: "祁阳县",
		1: "qiyang",
		2: "QY",
	},
	1135: {
		0: "齐河县",
		1: "qihe",
		2: "QH",
	},
	80: {
		0: "齐齐哈尔",
		1: "qiqihaer",
		2: "QQ",
	},
	3205: {
		0: "岐阜",
		1: "gifu",
		2: "QGU",
	},
	2043: {
		0: "岐山县",
		1: "qishan",
		2: "QS",
	},
	2248: {
		0: "奇台县",
		1: "qitai",
		2: "QT",
	},
	15014: {
		0: "埼玉",
		1: "Saitama",
		2: "SAI",
	},
	1244: {
		0: "淇县",
		1: "hbqixian",
		2: "QX",
	},
	2282: {
		0: "綦江区",
		1: "qijian",
		2: "QJ",
	},
	1343: {
		0: "蕲春县",
		1: "qichun",
		2: "QC",
	},
	858: {
		0: "启东市",
		1: "qidong",
		2: "QD",
	},
	1255: {
		0: "杞县",
		1: "kfqixian",
		2: "QX",
	},
	3355: {
		0: "恰纳卡莱",
		1: "canakkale",
		2: "CKZ",
	},
	3602: {
		0: "千岛湖",
		1: "qiandaohu",
		2: "QDH",
	},
	15030: {
		0: "千岁",
		1: "Chitose",
		2: "CHI",
	},
	2047: {
		0: "千阳县",
		1: "qianyang",
		2: "QY",
	},
	3208: {
		0: "千叶",
		1: "chiba",
		2: "CHB",
	},
	482: {
		0: "迁安市",
		1: "qianan",
		2: "QA",
	},
	486: {
		0: "迁西县",
		1: "qianxi",
		2: "QX",
	},
	1081: {
		0: "铅山县",
		1: "qianshanxian",
		2: "QS",
	},
	735: {
		0: "前郭尔罗斯蒙古族自治县",
		1: "qianguoerluo",
		2: "QGE",
	},
	734: {
		0: "乾安县",
		1: "qiananxian",
		2: "QA",
	},
	2034: {
		0: "乾县",
		1: "qianxian",
		2: "QX",
	},
	190: {
		0: "潜江",
		1: "qianjiang",
		2: "QJ",
	},
	954: {
		0: "潜山市",
		1: "qianshan",
		2: "QSS",
	},
	265: {
		0: "黔东南",
		1: "qiandongnan",
		2: "QDN",
	},
	4467: {
		0: "黔江区",
		1: "qianjiangcq",
		2: "QJ",
	},
	266: {
		0: "黔南",
		1: "qiannan",
		2: "QN",
	},
	263: {
		0: "黔西南",
		1: "qianxinan",
		2: "QXN",
	},
	1764: {
		0: "黔西县",
		1: "qianxixian",
		2: "QX",
	},
	15116: {
		0: "乔治亚州",
		1: "Georgia",
		2: "GEO",
	},
	1845: {
		0: "巧家县",
		1: "qiaojia",
		2: "QJ",
	},
	2254: {
		0: "且末县",
		1: "qiemo",
		2: "QM",
	},
	230: {
		0: "钦州",
		1: "qinzhou",
		2: "QZ",
	},
	2095: {
		0: "秦安县",
		1: "qinan",
		2: "QA",
	},
	26: {
		0: "秦皇岛",
		1: "qinhuangdao",
		2: "QHD",
	},
	604: {
		0: "沁水县",
		1: "qinshui",
		2: "QS",
	},
	600: {
		0: "沁县",
		1: "qinxian",
		2: "QX",
	},
	1230: {
		0: "沁阳市",
		1: "qinyang",
		2: "QY",
	},
	601: {
		0: "沁源县",
		1: "qinyuan",
		2: "QY",
	},
	4461: {
		0: "青白江区",
		1: "qingbaijiang",
		2: "QBJ",
	},
	3621: {
		0: "青城山",
		1: "qingchengshan",
		2: "QCS",
	},
	1615: {
		0: "青川县",
		1: "qingchuan",
		2: "QC",
	},
	21: {
		0: "青岛",
		1: "qingdao",
		2: "QD",
	},
	820: {
		0: "青冈县",
		1: "qinggang",
		2: "QG",
	},
	3630: {
		0: "青海湖",
		1: "qinghaihu",
		2: "QHH",
	},
	2280: {
		0: "青河县",
		1: "qinghexian",
		2: "QH",
	},
	480: {
		0: "青龙满族自治县",
		1: "qinglong",
		2: "QL",
	},
	3207: {
		0: "青森",
		1: "aomori",
		2: "AMR",
	},
	1686: {
		0: "青神县",
		1: "qingshen",
		2: "QS",
	},
	914: {
		0: "青田县",
		1: "qingtian",
		2: "QT",
	},
	2193: {
		0: "青铜峡市",
		1: "qingtongxia",
		2: "QTX",
	},
	533: {
		0: "青县",
		1: "qingxian",
		2: "QX",
	},
	974: {
		0: "青阳县",
		1: "qingyangxian",
		2: "QY",
	},
	1148: {
		0: "青州市",
		1: "qingzhou",
		2: "QZ",
	},
	15046: {
		0: "轻井泽",
		1: "Karuizawa",
		2: "KAR",
	},
	1250: {
		0: "清丰县",
		1: "qingfeng",
		2: "QF",
	},
	557: {
		0: "清河县",
		1: "qinghe",
		2: "QH",
	},
	2070: {
		0: "清涧县",
		1: "qingjian",
		2: "QJ",
	},
	2348: {
		0: "清莱",
		1: "chiangrai",
		2: "CR",
	},
	1000: {
		0: "清流县",
		1: "qingliu",
		2: "QL",
	},
	2345: {
		0: "清迈",
		1: "chiangmai",
		2: "CNX",
	},
	661: {
		0: "清水河县",
		1: "qingshuihe",
		2: "QSH",
	},
	2094: {
		0: "清水县",
		1: "qingshui",
		2: "QS",
	},
	575: {
		0: "清徐县",
		1: "qingxu",
		2: "QX",
	},
	702: {
		0: "清原满族自治县",
		1: "fsqingyuan",
		2: "QY",
	},
	218: {
		0: "清远",
		1: "qingyuan",
		2: "QY",
	},
	502: {
		0: "清苑区",
		1: "bdqingyuan",
		2: "QY",
	},
	1740: {
		0: "清镇市",
		1: "qingzhen",
		2: "QZ",
	},
	1810: {
		0: "晴隆县",
		1: "qinglongxian",
		2: "QL",
	},
	821: {
		0: "庆安县",
		1: "qingan",
		2: "QA",
	},
	2113: {
		0: "庆城县",
		1: "qingcheng",
		2: "QC",
	},
	4451: {
		0: "庆尚北道",
		1: "Gyeongbuk",
		2: "GSB",
	},
	4452: {
		0: "庆尚南道",
		1: "Gyeongnam",
		2: "GSN",
	},
	308: {
		0: "庆阳",
		1: "qingyang",
		2: "QY",
	},
	918: {
		0: "庆元县",
		1: "lsqingyuan",
		2: "QY",
	},
	1138: {
		0: "庆云县",
		1: "qingyun",
		2: "QY",
	},
	3185: {
		0: "庆州",
		1: "gyeongju",
		2: "GYG",
	},
	1606: {
		0: "邛崃市",
		1: "qionglai",
		2: "QL",
	},
	402: {
		0: "琼海",
		1: "qionghai",
		2: "QH",
	},
	1971: {
		0: "琼结县",
		1: "qiongjie",
		2: "QJ",
	},
	403: {
		0: "琼中",
		1: "qiongzhong",
		2: "QZ",
	},
	1929: {
		0: "丘北县",
		1: "qiubei",
		2: "QB",
	},
	568: {
		0: "邱县",
		1: "qiuxian",
		2: "QX",
	},
	1181: {
		0: "曲阜市",
		1: "qufu",
		2: "QF",
	},
	268: {
		0: "曲靖",
		1: "qujing",
		2: "QJ",
	},
	2184: {
		0: "曲麻莱县",
		1: "qumalai",
		2: "QML",
	},
	1935: {
		0: "曲水县",
		1: "qushui",
		2: "QS",
	},
	1972: {
		0: "曲松县",
		1: "qusong",
		2: "QS",
	},
	632: {
		0: "曲沃县",
		1: "quwo",
		2: "QW",
	},
	514: {
		0: "曲阳县",
		1: "quyang",
		2: "QY",
	},
	573: {
		0: "曲周县",
		1: "quzhouxian",
		2: "QZ",
	},
	1678: {
		0: "渠县",
		1: "quxian",
		2: "QX",
	},
	106: {
		0: "衢州",
		1: "quzhou",
		2: "QZ",
	},
	943: {
		0: "全椒县",
		1: "quanjiao",
		2: "QJ",
	},
	1070: {
		0: "全南县",
		1: "quannan",
		2: "QN",
	},
	10299: {
		0: "全州",
		1: "jeo",
		2: "CHN",
	},
	1538: {
		0: "全州县",
		1: "quanzhouxian",
		2: "QZ",
	},
	129: {
		0: "泉州",
		1: "quanzhou",
		2: "QZ",
	},
	1307: {
		0: "确山县",
		1: "queshan",
		2: "QS",
	},
	1703: {
		0: "壤塘县",
		1: "rangtang",
		2: "RT",
	},
	805: {
		0: "饶河县",
		1: "raohe",
		2: "RH",
	},
	1491: {
		0: "饶平县",
		1: "raoping",
		2: "RP",
	},
	523: {
		0: "饶阳县",
		1: "raoyang",
		2: "RY",
	},
	15107: {
		0: "热海",
		1: "Atami",
		2: "ATA",
	},
	3482: {
		0: "热那亚",
		1: "genoa",
		2: "GOA",
	},
	1988: {
		0: "仁布县",
		1: "renbu",
		2: "RB",
	},
	1474: {
		0: "仁化县",
		1: "renhua",
		2: "RH",
	},
	1746: {
		0: "仁怀市",
		1: "renhuai",
		2: "RH",
	},
	1682: {
		0: "仁寿县",
		1: "renshou",
		2: "RS",
	},
	529: {
		0: "任丘市",
		1: "renqiu",
		2: "RQ",
	},
	549: {
		0: "任县",
		1: "renxian",
		2: "RX",
	},
	2315: {
		0: "日本",
		1: "japan",
		2: "JP",
	},
	3196: {
		0: "日光",
		1: "nik",
		2: "NIK",
	},
	286: {
		0: "日喀则",
		1: "rikazediqu",
		2: "RKZ",
	},
	2440: {
		0: "日内瓦",
		1: "geneva",
		2: "RNW",
	},
	3331: {
		0: "日惹",
		1: "yogyakarta",
		2: "RIR",
	},
	2000: {
		0: "日土县",
		1: "ritou",
		2: "RT",
	},
	153: {
		0: "日照",
		1: "rizhao",
		2: "RZ",
	},
	2286: {
		0: "荣昌区",
		1: "rongcang",
		2: "RC",
	},
	1161: {
		0: "荣成",
		1: "rongcheng",
		2: "RC",
	},
	1653: {
		0: "荣县",
		1: "rongxianxian",
		2: "RX",
	},
	3517: {
		0: "容城县",
		1: "rongchengxian",
		2: "RCX",
	},
	1561: {
		0: "容县",
		1: "rongxian",
		2: "RX",
	},
	1790: {
		0: "榕江县",
		1: "rongjian",
		2: "RJ",
	},
	1550: {
		0: "融安县",
		1: "rongan",
		2: "RA",
	},
	1552: {
		0: "融水苗族自治县",
		1: "rongshui",
		2: "RS",
	},
	861: {
		0: "如东县",
		1: "rudong",
		2: "RD",
	},
	860: {
		0: "如皋市",
		1: "rugao",
		2: "RG",
	},
	1420: {
		0: "汝城县",
		1: "rucheng",
		2: "RC",
	},
	1312: {
		0: "汝南县",
		1: "runan",
		2: "RN",
	},
	1225: {
		0: "汝阳县",
		1: "ruyang",
		2: "RY",
	},
	1275: {
		0: "汝州市",
		1: "ruzhou",
		2: "RZ",
	},
	1162: {
		0: "乳山市",
		1: "rushan",
		2: "RS",
	},
	1477: {
		0: "乳源瑶族自治县",
		1: "ruyuan",
		2: "RY",
	},
	3527: {
		0: "芮城县",
		1: "ruichengxian",
		2: "RC",
	},
	904: {
		0: "瑞安",
		1: "ruian",
		2: "RA",
	},
	1042: {
		0: "瑞昌市",
		1: "ruicang",
		2: "RC",
	},
	4135: {
		0: "瑞典",
		1: "sweden",
		2: "SWE",
	},
	1060: {
		0: "瑞金市",
		1: "ruijin",
		2: "RJ",
	},
	1875: {
		0: "瑞丽市",
		1: "ruili",
		2: "RL",
	},
	4136: {
		0: "瑞士",
		1: "switzerland",
		2: "CHE",
	},
	1705: {
		0: "若尔盖县",
		1: "nuoergai",
		2: "REG",
	},
	2253: {
		0: "若羌县",
		1: "ruoqiang",
		2: "RQ",
	},
	1204: {
		0: "单县",
		1: "danxian",
		2: "SX",
	},
	2418: {
		0: "萨尔茨堡",
		1: "salzburg",
		2: "SEZ",
	},
	4349: {
		0: "萨尔瓦多",
		1: "elsalvador",
		2: "SLV",
	},
	1995: {
		0: "萨嘎县",
		1: "sagaxian",
		2: "SG",
	},
	3268: {
		0: "萨格勒布",
		1: "zagreb",
		2: "SGL",
	},
	1983: {
		0: "萨迦县",
		1: "sajia",
		2: "SJ",
	},
	4200: {
		0: "萨克拉门托",
		1: "sacramento",
		2: "SKL",
	},
	4370: {
		0: "萨拉戈萨",
		1: "zaragoza",
		2: "AZA",
	},
	4368: {
		0: "萨拉曼卡",
		1: "salamanca",
		2: "SLM",
	},
	10988: {
		0: "萨莱诺",
		1: "Salerno",
		2: "SAL",
	},
	4350: {
		0: "萨摩亚",
		1: "samoa",
		2: "WS",
	},
	10606: {
		0: "萨斯卡通",
		1: "Saskatoon",
		2: "SAS",
	},
	2326: {
		0: "塞班岛",
		1: "saipan",
		2: "SB",
	},
	3354: {
		0: "塞尔丘克",
		1: "selcuk",
		2: "SK",
	},
	3379: {
		0: "塞尔维亚",
		1: "serbia",
		2: "SRB",
	},
	4362: {
		0: "塞哥维亚",
		1: "segovia",
		2: "SEG",
	},
	3381: {
		0: "塞拉利昂",
		1: "sierraleone",
		2: "SLE",
	},
	3378: {
		0: "塞内加尔",
		1: "senegal",
		2: "SEN",
	},
	3382: {
		0: "塞浦路斯",
		1: "cyprus",
		2: "CY",
	},
	2334: {
		0: "塞舌尔",
		1: "seychelles",
		2: "SYC",
	},
	2451: {
		0: "塞维利亚",
		1: "seville",
		2: "SWL",
	},
	1806: {
		0: "三都水族自治县",
		1: "sandu",
		2: "SD",
	},
	490: {
		0: "三河市",
		1: "sanhe",
		2: "SH",
	},
	1551: {
		0: "三江侗族自治县",
		1: "sanjiang",
		2: "SJ",
	},
	171: {
		0: "三门峡",
		1: "sanmenxia",
		2: "SMX",
	},
	900: {
		0: "三门县",
		1: "sanmen",
		2: "SM",
	},
	128: {
		0: "三明",
		1: "sanming",
		2: "SM",
	},
	3514: {
		0: "三清山",
		1: "sanqingshan",
		2: "SQS",
	},
	2310: {
		0: "三沙",
		1: "sansha",
		2: "SS",
	},
	4480: {
		0: "三水区",
		1: "sanshui",
		2: "SS",
	},
	1782: {
		0: "三穗县",
		1: "sansui",
		2: "SS",
	},
	1619: {
		0: "三台县",
		1: "santai",
		2: "ST",
	},
	3516: {
		0: "三峡",
		1: "sanxia",
		2: "SX",
	},
	345: {
		0: "三亚",
		1: "sanya",
		2: "SY",
	},
	2032: {
		0: "三原县",
		1: "sanyuan",
		2: "SY",
	},
	15009: {
		0: "三重",
		1: "Mie",
		2: "MIE",
	},
	1970: {
		0: "桑日县",
		1: "sangri",
		2: "SR",
	},
	1381: {
		0: "桑植县",
		1: "sangzhi",
		2: "SZ",
	},
	1979: {
		0: "桑珠孜区",
		1: "rikaze",
		2: "SZZ",
	},
	1718: {
		0: "色达县",
		1: "seda",
		2: "SD",
	},
	2362: {
		0: "沙巴",
		1: "sabah",
		2: "SB",
	},
	4150: {
		0: "沙夫豪森",
		1: "schaffhausen",
		2: "SFH",
	},
	543: {
		0: "沙河市",
		1: "shahe",
		2: "SH",
	},
	4387: {
		0: "沙迦",
		1: "sharjah",
		2: "SEM",
	},
	4403: {
		0: "沙捞越",
		1: "sarawak",
		2: "SRW",
	},
	3372: {
		0: "沙姆沙伊赫",
		1: "sharmel-sheikh",
		2: "SEL",
	},
	4049: {
		0: "沙特阿拉伯",
		1: "saudiarabia",
		2: "KSA",
	},
	4468: {
		0: "沙田镇",
		1: "shatian",
		2: "ST",
	},
	2271: {
		0: "沙湾县",
		1: "shawan",
		2: "SW",
	},
	1004: {
		0: "沙县",
		1: "shaxian",
		2: "SX",
	},
	2216: {
		0: "沙雅县",
		1: "shaya",
		2: "SY",
	},
	1329: {
		0: "沙洋县",
		1: "shayang",
		2: "SY",
	},
	2206: {
		0: "莎车县",
		1: "shache",
		2: "SC",
	},
	4405: {
		0: "山打根",
		1: "sandakan",
		2: "SDK",
	},
	2111: {
		0: "山丹县",
		1: "shandan",
		2: "SD",
	},
	15023: {
		0: "山梨",
		1: "Yamanashi",
		2: "YAM",
	},
	285: {
		0: "山南",
		1: "shannan",
		2: "SN",
	},
	2084: {
		0: "山阳县",
		1: "shanyang",
		2: "SY",
	},
	578: {
		0: "山阴县",
		1: "shanyin",
		2: "SY",
	},
	1218: {
		0: "陕州区",
		1: "shanxian",
		2: "SX",
	},
	207: {
		0: "汕头",
		1: "shantou",
		2: "ST",
	},
	215: {
		0: "汕尾",
		1: "shanwei",
		2: "SW",
	},
	2231: {
		0: "鄯善县",
		1: "shanshan",
		2: "SS",
	},
	1295: {
		0: "商城县",
		1: "shangcheng",
		2: "SC",
	},
	675: {
		0: "商都县",
		1: "shangdu",
		2: "SD",
	},
	1121: {
		0: "商河县",
		1: "shanghe",
		2: "SH",
	},
	298: {
		0: "商洛",
		1: "shangluo",
		2: "SL",
	},
	2083: {
		0: "商南县",
		1: "shangnan",
		2: "SN",
	},
	173: {
		0: "商丘",
		1: "shangqiu",
		2: "SQ",
	},
	1301: {
		0: "商水县",
		1: "shangshui",
		2: "SS",
	},
	1311: {
		0: "上蔡县",
		1: "shangcha",
		2: "SC",
	},
	592: {
		0: "上党区",
		1: "changzhixian",
		2: "SDQ",
	},
	1103: {
		0: "上高县",
		1: "shanggao",
		2: "SG",
	},
	1: {
		0: "上海",
		1: "shanghai",
		2: "SH",
	},
	1027: {
		0: "上杭县",
		1: "shanghang",
		2: "SH",
	},
	4460: {
		0: "上街区",
		1: "shangjie",
		2: "SJ",
	},
	1058: {
		0: "上栗县",
		1: "shangli",
		2: "SL",
	},
	1532: {
		0: "上林县",
		1: "shanglin",
		2: "SL",
	},
	144: {
		0: "上饶",
		1: "shangrao",
		2: "SR",
	},
	1078: {
		0: "上饶县",
		1: "shangraoxian",
		2: "SRX",
	},
	15248: {
		0: "上萨瓦",
		1: "Haute-Savoie",
		2: "HAU",
	},
	1568: {
		0: "上思县",
		1: "shangsi",
		2: "SS",
	},
	1065: {
		0: "上犹县",
		1: "shangyou",
		2: "SY",
	},
	884: {
		0: "上虞区",
		1: "shangyu",
		2: "SY",
	},
	11434: {
		0: "尚佩恩",
		1: "Champaign",
		2: "CHA",
	},
	460: {
		0: "尚义县",
		1: "shangyi",
		2: "SY",
	},
	763: {
		0: "尚志市",
		1: "shangzhi",
		2: "SZ",
	},
	205: {
		0: "韶关",
		1: "shaoguan",
		2: "SG",
	},
	1405: {
		0: "韶山市",
		1: "shaoshan",
		2: "SS",
	},
	1433: {
		0: "邵东县",
		1: "shaodong",
		2: "SD",
	},
	988: {
		0: "邵武市",
		1: "shaowu",
		2: "SW",
	},
	195: {
		0: "邵阳",
		1: "shaoyang",
		2: "SY",
	},
	1434: {
		0: "邵阳县",
		1: "shaoyangxian",
		2: "SYX",
	},
	104: {
		0: "绍兴",
		1: "shaoxing",
		2: "SX",
	},
	3253: {
		0: "设拉子",
		1: "shiraz",
		2: "SRZ",
	},
	1287: {
		0: "社旗县",
		1: "sheqi",
		2: "SQ",
	},
	1641: {
		0: "射洪县",
		1: "shehong",
		2: "SH",
	},
	847: {
		0: "射阳县",
		1: "sheyang",
		2: "SY",
	},
	564: {
		0: "涉县",
		1: "shexian",
		2: "SX",
	},
	1944: {
		0: "申扎县",
		1: "shenzha",
		2: "SZ",
	},
	450: {
		0: "深泽县",
		1: "shenzhe",
		2: "SZ",
	},
	7: {
		0: "深圳",
		1: "shenzhen",
		2: "SZ",
	},
	519: {
		0: "深州市",
		1: "shenzhou",
		2: "SZ",
	},
	614: {
		0: "神池县",
		1: "shenchi",
		2: "SC",
	},
	3206: {
		0: "神户",
		1: "kobe",
		2: "KOB",
	},
	2061: {
		0: "神木市",
		1: "shenmu",
		2: "SM",
	},
	3186: {
		0: "神奈川",
		1: "kanagawa",
		2: "KNG",
	},
	404: {
		0: "神农架林区",
		1: "shennongjia",
		2: "SNJ",
	},
	1306: {
		0: "沈丘县",
		1: "shenqiu",
		2: "SQ",
	},
	18: {
		0: "沈阳",
		1: "shenyang",
		2: "SY",
	},
	4320: {
		0: "圣安德鲁斯",
		1: "standrews",
		2: "STA",
	},
	4187: {
		0: "圣安东尼奥",
		1: "sanantonio",
		2: "SAD",
	},
	4242: {
		0: "圣巴巴拉",
		1: "santabarbara",
		2: "SBB",
	},
	2484: {
		0: "圣保罗",
		1: "saopaulo",
		2: "SBL",
	},
	13150: {
		0: "圣保罗",
		1: "StPaul",
		2: "SP",
	},
	3151: {
		0: "圣彼得堡",
		1: "saintpetersburg",
		2: "SPB",
	},
	2486: {
		0: "圣地亚哥",
		1: "santiago",
		2: "SDY",
	},
	4182: {
		0: "圣地亚哥",
		1: "sandiego",
		2: "SDG",
	},
	3359: {
		0: "圣多美和普林西比",
		1: "standp",
		2: "STP",
	},
	3361: {
		0: "圣赫勒拿",
		1: "sainthelena",
		2: "SHN",
	},
	4093: {
		0: "圣胡安",
		1: "sanjuan",
		2: "SNJ",
	},
	3490: {
		0: "圣吉米尼亚诺",
		1: "sangimignano",
		2: "SNG",
	},
	4154: {
		0: "圣加仑",
		1: "stgallen",
		2: "STG",
	},
	4423: {
		0: "圣克鲁斯",
		1: "Santa-Cruz",
		2: "SAN",
	},
	4185: {
		0: "圣路易斯",
		1: "stlouis",
		2: "SLY",
	},
	3362: {
		0: "圣马力诺",
		1: "sanmarino",
		2: "SMR",
	},
	4080: {
		0: "圣马洛",
		1: "saint-malo",
		2: "STM",
	},
	13854: {
		0: "圣米歇尔山",
		1: "mon-2",
		2: "MON",
	},
	4156: {
		0: "圣莫里茨",
		1: "stmoritz",
		2: "STM",
	},
	2454: {
		0: "圣托里尼",
		1: "santorini",
		2: "STL",
	},
	3394: {
		0: "圣沃尔夫冈",
		1: "stwolfgang",
		2: "STW",
	},
	882: {
		0: "嵊泗县",
		1: "shengsi",
		2: "SS",
	},
	885: {
		0: "嵊州市",
		1: "shengzhou",
		2: "SZ",
	},
	1829: {
		0: "师宗县",
		1: "shizong",
		2: "SZ",
	},
	1781: {
		0: "施秉县",
		1: "shibing",
		2: "SB",
	},
	1840: {
		0: "施甸县",
		1: "shidian",
		2: "SD",
	},
	4143: {
		0: "施皮茨",
		1: "spiez",
		2: "ZSZ",
	},
	178: {
		0: "十堰",
		1: "shiyan",
		2: "SY",
	},
	1625: {
		0: "什邡市",
		1: "shifang",
		2: "SF",
	},
	1076: {
		0: "石城县",
		1: "shicheng",
		2: "SC",
	},
	4440: {
		0: "石岛",
		1: "shidao",
		2: "SD",
	},
	339: {
		0: "石河子",
		1: "shihezi",
		2: "SHZ",
	},
	24: {
		0: "石家庄",
		1: "shijiazhuang",
		2: "SJZ",
	},
	4463: {
		0: "石碣镇",
		1: "shijie",
		2: "SJ",
	},
	1821: {
		0: "石林彝族自治县",
		1: "shilin",
		2: "SL",
	},
	657: {
		0: "石楼县",
		1: "shilou",
		2: "SL",
	},
	1388: {
		0: "石门县",
		1: "shimen",
		2: "SM",
	},
	1690: {
		0: "石棉县",
		1: "shimian",
		2: "SM",
	},
	4466: {
		0: "石排镇",
		1: "shipai",
		2: "SP",
	},
	1916: {
		0: "石屏县",
		1: "shiping",
		2: "SP",
	},
	1772: {
		0: "石阡县",
		1: "shiqian",
		2: "SQ",
	},
	1717: {
		0: "石渠县",
		1: "shiqu",
		2: "SQ",
	},
	2073: {
		0: "石泉县",
		1: "shiquan",
		2: "SQ",
	},
	1008: {
		0: "石狮",
		1: "shishi",
		2: "SS",
	},
	1353: {
		0: "石首市",
		1: "shishou",
		2: "SS",
	},
	973: {
		0: "石台县",
		1: "shitai",
		2: "ST",
	},
	15043: {
		0: "石垣岛",
		1: "Ishigaki",
		2: "ISH",
	},
	2299: {
		0: "石柱土家族自治县",
		1: "shizhu",
		2: "SZ",
	},
	322: {
		0: "石嘴山",
		1: "shizuishan",
		2: "SZS",
	},
	1473: {
		0: "始兴县",
		1: "shixing",
		2: "SX",
	},
	2369: {
		0: "首尔",
		1: "seoul",
		2: "SEL",
	},
	1150: {
		0: "寿光市",
		1: "shouguang",
		2: "SG",
	},
	1032: {
		0: "寿宁县",
		1: "shouning",
		2: "SN",
	},
	963: {
		0: "寿县",
		1: "shouxian",
		2: "SX",
	},
	625: {
		0: "寿阳县",
		1: "shouyang",
		2: "SY",
	},
	2202: {
		0: "疏附县",
		1: "shufu",
		2: "SF",
	},
	2203: {
		0: "疏勒县",
		1: "shule",
		2: "SL",
	},
	965: {
		0: "舒城县",
		1: "shucheng",
		2: "SC",
	},
	739: {
		0: "舒兰市",
		1: "shulan",
		2: "SL",
	},
	10719: {
		0: "束草",
		1: "sok",
		2: "SOK",
	},
	838: {
		0: "沭阳县",
		1: "shuyang",
		2: "SY",
	},
	1899: {
		0: "双柏县",
		1: "shuangbo",
		2: "SB",
	},
	762: {
		0: "双城区",
		1: "shuangcheng",
		2: "SC",
	},
	1454: {
		0: "双峰县",
		1: "shuangfeng",
		2: "SF",
	},
	4488: {
		0: "双河市",
		1: "shuangheshi",
		2: "SHS",
	},
	3591: {
		0: "双湖县",
		1: "shuanghuxian",
		2: "SHX",
	},
	1871: {
		0: "双江拉祜族佤族布朗族傣族自治县",
		1: "shuangjiang",
		2: "SJ",
	},
	3628: {
		0: "双廊",
		1: "shuanglang",
		2: "SL",
	},
	741: {
		0: "双辽市",
		1: "shuangliao",
		2: "SL",
	},
	1609: {
		0: "双流区",
		1: "shuangliu",
		2: "SL",
	},
	1429: {
		0: "双牌县",
		1: "shuangpai",
		2: "SP",
	},
	83: {
		0: "双鸭山",
		1: "shuangyashan",
		2: "SYS",
	},
	4474: {
		0: "双阳区",
		1: "shuangyang",
		2: "SY",
	},
	3589: {
		0: "水城县",
		1: "shuichengxian",
		2: "SCX",
	},
	1853: {
		0: "水富市",
		1: "shuifu",
		2: "SFS",
	},
	4243: {
		0: "水牛城",
		1: "buffalo",
		2: "SNC",
	},
	10435: {
		0: "水原",
		1: "suw",
		2: "SUW",
	},
	992: {
		0: "顺昌县",
		1: "shuncang",
		2: "SC",
	},
	3508: {
		0: "顺德区",
		1: "shunde",
		2: "SD",
	},
	3214: {
		0: "顺化",
		1: "hue",
		2: "SHH",
	},
	507: {
		0: "顺平县",
		1: "shunping",
		2: "SP",
	},
	40: {
		0: "朔州",
		1: "shuozhou",
		2: "SZ",
	},
	1773: {
		0: "思南县",
		1: "sinan",
		2: "SN",
	},
	2436: {
		0: "斯德哥尔摩",
		1: "stockholm",
		2: "SDG",
	},
	4130: {
		0: "斯科纳",
		1: "skane",
		2: "SKN",
	},
	4390: {
		0: "斯科普里",
		1: "skopje",
		2: "SKP",
	},
	2330: {
		0: "斯里兰卡",
		1: "srilanka",
		2: "LKA",
	},
	4019: {
		0: "斯洛伐克",
		1: "slovakia",
		2: "SVK",
	},
	4021: {
		0: "斯洛文尼亚",
		1: "slovenia",
		2: "SVN",
	},
	3270: {
		0: "斯普利特",
		1: "split",
		2: "SPL",
	},
	4009: {
		0: "斯塔万格",
		1: "stavanger",
		2: "STV",
	},
	4058: {
		0: "斯特拉斯堡",
		1: "strasbourg",
		2: "SA",
	},
	4324: {
		0: "斯特灵",
		1: "sterling",
		2: "STL",
	},
	3439: {
		0: "斯图加特",
		1: "stuttgart",
		2: "STJ",
	},
	4327: {
		0: "斯旺西",
		1: "swansea",
		2: "SWS",
	},
	4175: {
		0: "死海",
		1: "deadsea",
		2: "DSM",
	},
	1508: {
		0: "四会市",
		1: "sihui",
		2: "SH",
	},
	72: {
		0: "四平",
		1: "siping",
		2: "SP",
	},
	15094: {
		0: "四日市",
		1: "Yokkaichi",
		2: "YOK",
	},
	3564: {
		0: "四子王旗",
		1: "siziwangqi",
		2: "SZW",
	},
	840: {
		0: "泗洪县",
		1: "sihong",
		2: "SH",
	},
	3326: {
		0: "泗水",
		1: "surabaya",
		2: "SUB",
	},
	1189: {
		0: "泗水县",
		1: "sishui",
		2: "SS",
	},
	926: {
		0: "泗县",
		1: "sixian",
		2: "SX",
	},
	839: {
		0: "泗阳县",
		1: "siyang",
		2: "SY",
	},
	4007: {
		0: "松恩峡湾",
		1: "sognefjord",
		2: "SOG",
	},
	15056: {
		0: "松江",
		1: "mat-2",
		2: "MAT",
	},
	1698: {
		0: "松潘县",
		1: "songpan",
		2: "SP",
	},
	15057: {
		0: "松山",
		1: "mat",
		2: "MAT",
	},
	1778: {
		0: "松桃苗族自治县",
		1: "songtao",
		2: "ST",
	},
	995: {
		0: "松溪县",
		1: "songxi",
		2: "SX",
	},
	917: {
		0: "松阳县",
		1: "songyang",
		2: "SY",
	},
	76: {
		0: "松原",
		1: "songyuan",
		2: "SY",
	},
	1355: {
		0: "松滋市",
		1: "songzi",
		2: "SZ",
	},
	1820: {
		0: "嵩明县",
		1: "songming",
		2: "SM",
	},
	1224: {
		0: "嵩县",
		1: "songxian",
		2: "SX",
	},
	4297: {
		0: "苏丹",
		1: "sudan",
		2: "SUD",
	},
	4302: {
		0: "苏格兰高地",
		1: "scottish",
		2: "HGL",
	},
	2439: {
		0: "苏黎世",
		1: "zurich",
		2: "SLS",
	},
	4298: {
		0: "苏里南",
		1: "surinam",
		2: "SUR",
	},
	2346: {
		0: "苏梅岛",
		1: "samui",
		2: "SUM",
	},
	3570: {
		0: "苏尼特右旗",
		1: "suyouqi",
		2: "SYQ",
	},
	3569: {
		0: "苏尼特左旗",
		1: "suzuoqi",
		2: "SZQ",
	},
	6: {
		0: "苏州",
		1: "suzhou",
		2: "SUZ",
	},
	2106: {
		0: "肃北蒙古族自治县",
		1: "subei",
		2: "SB",
	},
	2112: {
		0: "肃南裕固族自治县",
		1: "sunan",
		2: "SN",
	},
	537: {
		0: "肃宁县",
		1: "suning",
		2: "SN",
	},
	4095: {
		0: "素叻他尼",
		1: "suratthani",
		2: "SUT",
	},
	100: {
		0: "宿迁",
		1: "suqian",
		2: "SQ",
	},
	956: {
		0: "宿松县",
		1: "susong",
		2: "SS",
	},
	2356: {
		0: "宿雾",
		1: "cebu",
		2: "CEB",
	},
	121: {
		0: "宿州",
		1: "anhuisuzhou",
		2: "SZ",
	},
	831: {
		0: "睢宁县",
		1: "szsuining",
		2: "SN",
	},
	1264: {
		0: "睢县",
		1: "suixian",
		2: "SX",
	},
	927: {
		0: "濉溪县",
		1: "suixi",
		2: "SX",
	},
	793: {
		0: "绥滨县",
		1: "suibin",
		2: "SB",
	},
	2066: {
		0: "绥德县",
		1: "suide",
		2: "SD",
	},
	810: {
		0: "绥芬河市",
		1: "suifenhe",
		2: "SFH",
	},
	90: {
		0: "绥化",
		1: "suihua",
		2: "SH",
	},
	1849: {
		0: "绥江县",
		1: "suijian",
		2: "SJ",
	},
	823: {
		0: "绥棱县",
		1: "suileng",
		2: "SL",
	},
	1438: {
		0: "绥宁县",
		1: "zysuining",
		2: "SN",
	},
	1749: {
		0: "绥阳县",
		1: "suiyang",
		2: "SY",
	},
	722: {
		0: "绥中县",
		1: "suizhong",
		2: "SZ",
	},
	3587: {
		0: "随县",
		1: "szsuixian",
		2: "SX",
	},
	187: {
		0: "随州",
		1: "suizhou",
		2: "SZ",
	},
	916: {
		0: "遂昌县",
		1: "suicang",
		2: "SC",
	},
	1114: {
		0: "遂川县",
		1: "suichuan",
		2: "SC",
	},
	244: {
		0: "遂宁",
		1: "suining",
		2: "SN",
	},
	1309: {
		0: "遂平县",
		1: "suiping",
		2: "SP",
	},
	1527: {
		0: "遂溪县",
		1: "suixixian",
		2: "SX",
	},
	787: {
		0: "孙吴县",
		1: "sunwu",
		2: "SW",
	},
	3266: {
		0: "索非亚",
		1: "sofia",
		2: "SFY",
	},
	4422: {
		0: "索夫昂",
		1: "solvang",
		2: "SOL",
	},
	3485: {
		0: "索伦托",
		1: "sorrento",
		2: "RRO",
	},
	1945: {
		0: "索县",
		1: "suoxian",
		2: "SX",
	},
	959: {
		0: "歙县",
		1: "hsxixian",
		2: "SX",
	},
	1124: {
		0: "莘县",
		1: "xinxian",
		2: "SX",
	},
	337: {
		0: "塔城地区",
		1: "tachengdiqu",
		2: "TCD",
	},
	2268: {
		0: "塔城市",
		1: "tacheng",
		2: "TC",
	},
	825: {
		0: "塔河县",
		1: "tahe",
		2: "TH",
	},
	3377: {
		0: "塔吉克斯坦",
		1: "tajikistan",
		2: "TJK",
	},
	4125: {
		0: "塔林",
		1: "tallinn",
		2: "TLN",
	},
	2212: {
		0: "塔什库尔干塔吉克自治县",
		1: "tashikuergan",
		2: "TSK",
	},
	4105: {
		0: "塔斯马尼亚",
		1: "tasmania",
		2: "TMN",
	},
	708: {
		0: "台安县",
		1: "taianxian",
		2: "TA",
	},
	2335: {
		0: "台北",
		1: "taipei",
		2: "TPE",
	},
	3171: {
		0: "台东",
		1: "taitung",
		2: "TAT",
	},
	1788: {
		0: "台江县",
		1: "taijian",
		2: "TJ",
	},
	2338: {
		0: "台南",
		1: "tainan",
		2: "TNN",
	},
	1253: {
		0: "台前县",
		1: "taiqian",
		2: "TQ",
	},
	1504: {
		0: "台山市",
		1: "taishan",
		2: "TS",
	},
	340: {
		0: "台湾",
		1: "taiwan",
		2: "TW",
	},
	2341: {
		0: "台中",
		1: "taichung",
		2: "TCH",
	},
	108: {
		0: "台州",
		1: "zhejiangtaizhou",
		2: "TZ",
	},
	2050: {
		0: "太白县",
		1: "taibai",
		2: "TB",
	},
	420: {
		0: "太仓",
		1: "taicang",
		2: "TC",
	},
	626: {
		0: "太谷县",
		1: "taigu",
		2: "TG",
	},
	4268: {
		0: "太浩湖",
		1: "laketahoe",
		2: "LKT",
	},
	933: {
		0: "太和县",
		1: "taihe",
		2: "TH",
	},
	955: {
		0: "太湖县",
		1: "taihu",
		2: "TH",
	},
	1302: {
		0: "太康县",
		1: "taikang",
		2: "TK",
	},
	3573: {
		0: "太仆寺旗",
		1: "taipusiqi",
		2: "TPS",
	},
	3308: {
		0: "太阳城",
		1: "suncity",
		2: "SUC",
	},
	35: {
		0: "太原",
		1: "taiyuan",
		2: "TY",
	},
	15032: {
		0: "太宰府",
		1: "Dazaifu",
		2: "DAZ",
	},
	151: {
		0: "泰安",
		1: "taian",
		2: "TA",
	},
	2313: {
		0: "泰国",
		1: "thailand",
		2: "TH",
	},
	1113: {
		0: "泰和县",
		1: "taihexian",
		2: "TH",
	},
	777: {
		0: "泰来县",
		1: "tailai",
		2: "TL",
	},
	1006: {
		0: "泰宁县",
		1: "taining",
		2: "TN",
	},
	909: {
		0: "泰顺县",
		1: "taishun",
		2: "TS",
	},
	854: {
		0: "泰兴市",
		1: "taixing",
		2: "TX",
	},
	99: {
		0: "泰州",
		1: "taizhou",
		2: "TZ",
	},
	1171: {
		0: "郯城县",
		1: "tancheng",
		2: "TC",
	},
	10079: {
		0: "檀香山",
		1: "Honolulu",
		2: "HON",
	},
	4284: {
		0: "坦帕",
		1: "tampa",
		2: "TMP",
	},
	2499: {
		0: "坦桑尼亚",
		1: "tanzania",
		2: "TSN",
	},
	4048: {
		0: "汤加",
		1: "tonga",
		2: "TON",
	},
	1247: {
		0: "汤阴县",
		1: "tangyin",
		2: "TY",
	},
	800: {
		0: "汤原县",
		1: "tangyuan",
		2: "TY",
	},
	1288: {
		0: "唐河县",
		1: "tanghe",
		2: "TH",
	},
	25: {
		0: "唐山",
		1: "tangshan",
		2: "TS",
	},
	508: {
		0: "唐县",
		1: "tangxian",
		2: "TX",
	},
	10133: {
		0: "涛岛",
		1: "Koh-Tao",
		2: "KOH",
	},
	729: {
		0: "洮南市",
		1: "taonan",
		2: "TN",
	},
	1391: {
		0: "桃江县",
		1: "taojian",
		2: "TJ",
	},
	2339: {
		0: "桃园",
		1: "taoyuan",
		2: "TY",
	},
	1387: {
		0: "桃源县",
		1: "taoyuanxian",
		2: "TY",
	},
	4031: {
		0: "陶波湖",
		1: "taupo",
		2: "TAP",
	},
	3494: {
		0: "陶尔米纳",
		1: "taormina",
		2: "TAR",
	},
	4126: {
		0: "特克斯和凯科斯群岛",
		1: "tksandcci",
		2: "TC",
	},
	2265: {
		0: "特克斯县",
		1: "tekesi",
		2: "TKS",
	},
	3247: {
		0: "特拉维夫",
		1: "telaviv",
		2: "WLW",
	},
	3462: {
		0: "特里尔",
		1: "trier",
		2: "TRR",
	},
	4127: {
		0: "特立尼达和多巴哥",
		1: "trdandtob",
		2: "TTO",
	},
	4010: {
		0: "特罗姆瑟",
		1: "tromso",
		2: "TOS",
	},
	1841: {
		0: "腾冲市",
		1: "tengchong",
		2: "TC",
	},
	1180: {
		0: "滕州市",
		1: "tengzhou",
		2: "TZ",
	},
	1555: {
		0: "藤县",
		1: "tengxian",
		2: "TX",
	},
	941: {
		0: "天长市",
		1: "tianchang",
		2: "TC",
	},
	1572: {
		0: "天等县",
		1: "tiandeng",
		2: "TD",
	},
	1588: {
		0: "天峨县",
		1: "tiane",
		2: "TE",
	},
	10: {
		0: "天津",
		1: "tianjin",
		2: "TJ",
	},
	2188: {
		0: "天峻县",
		1: "tianjun",
		2: "TJ",
	},
	4313: {
		0: "天空岛",
		1: "isleofskye",
		2: "SKI",
	},
	191: {
		0: "天门",
		1: "tianmen",
		2: "TM",
	},
	3598: {
		0: "天目湖",
		1: "tianmuhu",
		2: "TMH",
	},
	3603: {
		0: "天目山",
		1: "tianmushan",
		2: "TMS",
	},
	1691: {
		0: "天全县",
		1: "tianquan",
		2: "TQ",
	},
	303: {
		0: "天水",
		1: "tianshui",
		2: "TS",
	},
	3622: {
		0: "天台山",
		1: "tiantaishan",
		2: "TTS",
	},
	901: {
		0: "天台县",
		1: "tiantai",
		2: "TT",
	},
	583: {
		0: "天镇县",
		1: "tianzhen",
		2: "TZ",
	},
	3609: {
		0: "天柱山",
		1: "tianzhushan",
		2: "TZS",
	},
	1785: {
		0: "天柱县",
		1: "tianzhu",
		2: "TZ",
	},
	2101: {
		0: "天祝藏族自治县",
		1: "tianzhuxian",
		2: "TR",
	},
	1576: {
		0: "田东县",
		1: "tiandong",
		2: "TD",
	},
	1584: {
		0: "田林县",
		1: "tianlin",
		2: "TL",
	},
	1575: {
		0: "田阳县",
		1: "tianyang",
		2: "TY",
	},
	794: {
		0: "铁力市",
		1: "tieli",
		2: "TL",
	},
	67: {
		0: "铁岭",
		1: "tieling",
		2: "TL",
	},
	697: {
		0: "铁岭县",
		1: "tielingxian",
		2: "TLX",
	},
	4472: {
		0: "铁门关市",
		1: "tiemenguan",
		2: "TMG",
	},
	1350: {
		0: "通城县",
		1: "tongchengxian",
		2: "TC",
	},
	1451: {
		0: "通道侗族自治县",
		1: "tongdao",
		2: "TD",
	},
	1834: {
		0: "通海县",
		1: "tonghai",
		2: "TH",
	},
	771: {
		0: "通河县",
		1: "tonghe",
		2: "TH",
	},
	74: {
		0: "通化",
		1: "tonghua",
		2: "TH",
	},
	748: {
		0: "通化县",
		1: "tonghuaxian",
		2: "THX",
	},
	1670: {
		0: "通江县",
		1: "tongjiangxian",
		2: "TJ",
	},
	50: {
		0: "通辽",
		1: "tongliao",
		2: "TL",
	},
	1352: {
		0: "通山县",
		1: "tongshanxian",
		2: "TS",
	},
	2126: {
		0: "通渭县",
		1: "tongwei",
		2: "TW",
	},
	1256: {
		0: "通许县",
		1: "tongxu",
		2: "TX",
	},
	731: {
		0: "通榆县",
		1: "tongyu",
		2: "TY",
	},
	859: {
		0: "通州区",
		1: "tongzhou",
		2: "TZ",
	},
	2304: {
		0: "同德县",
		1: "tongde",
		2: "TD",
	},
	796: {
		0: "同江市",
		1: "tongjiang",
		2: "TJ",
	},
	3600: {
		0: "同里",
		1: "tongli",
		2: "TL",
	},
	2169: {
		0: "同仁县",
		1: "tongrenxian",
		2: "TR",
	},
	2195: {
		0: "同心县",
		1: "tongxin",
		2: "TX",
	},
	1290: {
		0: "桐柏县",
		1: "tongbo",
		2: "TB",
	},
	951: {
		0: "桐城市",
		1: "tongcheng",
		2: "TC",
	},
	871: {
		0: "桐庐县",
		1: "tonglu",
		2: "TL",
	},
	878: {
		0: "桐乡市",
		1: "tongxiang",
		2: "TX",
	},
	1748: {
		0: "桐梓县",
		1: "tongzi",
		2: "TZ",
	},
	290: {
		0: "铜川",
		1: "tongchuan",
		2: "TC",
	},
	1106: {
		0: "铜鼓县",
		1: "tonggu",
		2: "TG",
	},
	2284: {
		0: "铜梁区",
		1: "tongliang",
		2: "TL",
	},
	116: {
		0: "铜陵",
		1: "tongling",
		2: "TL",
	},
	262: {
		0: "铜仁",
		1: "tongrendiqu",
		2: "TRD",
	},
	2024: {
		0: "潼关县",
		1: "tongguan",
		2: "TG",
	},
	2283: {
		0: "潼南区",
		1: "tongnan",
		2: "TN",
	},
	4169: {
		0: "突尼斯",
		1: "tunisia",
		2: "TUN",
	},
	681: {
		0: "突泉县",
		1: "tuquan",
		2: "TQ",
	},
	4146: {
		0: "图恩",
		1: "thun",
		2: "THN",
	},
	4072: {
		0: "图尔",
		1: "tours",
		2: "TRS",
	},
	4296: {
		0: "图尔库",
		1: "turku",
		2: "TK",
	},
	3387: {
		0: "图卢姆",
		1: "tulum",
		2: "TLM",
	},
	4070: {
		0: "图卢兹",
		1: "toulouse",
		2: "TLS",
	},
	756: {
		0: "图们市",
		1: "tumen",
		2: "TM",
	},
	405: {
		0: "图木舒克",
		1: "tumushuke",
		2: "TMS",
	},
	3346: {
		0: "土耳其",
		1: "turkey",
		2: "TUR",
	},
	3345: {
		0: "土库曼斯坦",
		1: "turkmenistan",
		2: "TKM",
	},
	3529: {
		0: "土默特右旗",
		1: "tuyouqi",
		2: "TYQ",
	},
	3528: {
		0: "土默特左旗",
		1: "tuzuoqi",
		2: "TZQ",
	},
	327: {
		0: "吐鲁番市",
		1: "tulufandiqu",
		2: "TLF",
	},
	1345: {
		0: "团风县",
		1: "tuanfeng",
		2: "TF",
	},
	406: {
		0: "屯昌县",
		1: "tunchang",
		2: "TC",
	},
	594: {
		0: "屯留区",
		1: "tunliu",
		2: "TLQ",
	},
	658: {
		0: "托克托县",
		1: "tuoketuo",
		2: "TKT",
	},
	2232: {
		0: "托克逊县",
		1: "tuokexun",
		2: "TKX",
	},
	4361: {
		0: "托莱多",
		1: "toledo",
		2: "TLD",
	},
	2272: {
		0: "托里县",
		1: "tuoli",
		2: "TL",
	},
	3477: {
		0: "托斯卡纳",
		1: "tuscany",
		2: "TSC",
	},
	3280: {
		0: "瓦杜兹",
		1: "vaduz",
		2: "WDZ",
	},
	429: {
		0: "瓦房店市",
		1: "wafangdian",
		2: "WFD",
	},
	2408: {
		0: "瓦拉纳西",
		1: "varanasi",
		2: "WLN",
	},
	4410: {
		0: "瓦莱塔",
		1: "valletta",
		2: "WLT",
	},
	4141: {
		0: "瓦莱州",
		1: "valais",
		2: "VL",
	},
	10049: {
		0: "瓦伦西亚",
		1: "Valencia",
		2: "VAL",
	},
	10485: {
		0: "瓦纳卡",
		1: "Wanaka",
		2: "WAN",
	},
	4159: {
		0: "瓦努阿图",
		1: "vanuatu",
		2: "VUT",
	},
	1115: {
		0: "万安县",
		1: "wanan",
		2: "WA",
	},
	2352: {
		0: "万隆",
		1: "bandung",
		2: "BDO",
	},
	1086: {
		0: "万年县",
		1: "wannian",
		2: "WN",
	},
	407: {
		0: "万宁",
		1: "wanning",
		2: "WN",
	},
	464: {
		0: "万全区",
		1: "wanquan",
		2: "WQ",
	},
	10901: {
		0: "万荣",
		1: "Vang-Vieng",
		2: "VAN",
	},
	3519: {
		0: "万荣县",
		1: "wanrongxian",
		2: "WRX",
	},
	3219: {
		0: "万象",
		1: "vientiane",
		2: "WTN",
	},
	1673: {
		0: "万源市",
		1: "wanyuan",
		2: "WY",
	},
	1102: {
		0: "万载县",
		1: "wanzai",
		2: "WZ",
	},
	4426: {
		0: "万州区",
		1: "wanzhou",
		2: "WZ",
	},
	760: {
		0: "汪清县",
		1: "wangqing",
		2: "WQ",
	},
	15024: {
		0: "网走",
		1: "Abashiri",
		2: "ABA",
	},
	1614: {
		0: "旺苍县",
		1: "wangcang",
		2: "WC",
	},
	509: {
		0: "望都县",
		1: "wangdu",
		2: "WD",
	},
	957: {
		0: "望江县",
		1: "wangjian",
		2: "WJ",
	},
	818: {
		0: "望奎县",
		1: "wangkui",
		2: "WK",
	},
	1812: {
		0: "望谟县",
		1: "wangmo",
		2: "WM",
	},
	152: {
		0: "威海",
		1: "weihai",
		2: "WH",
	},
	2460: {
		0: "威尼斯",
		1: "venice",
		2: "WNS",
	},
	15244: {
		0: "威尼托",
		1: "Veneto",
		2: "VEN",
	},
	1769: {
		0: "威宁彝族回族苗族自治县",
		1: "weining",
		2: "WN",
	},
	3471: {
		0: "威斯巴登",
		1: "wiesbaden",
		2: "WIE",
	},
	15175: {
		0: "威斯康星州",
		1: "Wisconsin",
		2: "WIS",
	},
	556: {
		0: "威县",
		1: "xtweixian",
		2: "WX",
	},
	1852: {
		0: "威信县",
		1: "weixin",
		2: "WX",
	},
	1643: {
		0: "威远县",
		1: "weiyuan",
		2: "WY",
	},
	1184: {
		0: "微山县",
		1: "weishan",
		2: "WS",
	},
	1897: {
		0: "巍山彝族回族自治县",
		1: "weishanxian",
		2: "WS",
	},
	476: {
		0: "围场满族蒙古族自治县",
		1: "weichang",
		2: "WC",
	},
	3617: {
		0: "涠洲岛",
		1: "weizhoudao",
		2: "WZD",
	},
	3285: {
		0: "维多利亚",
		1: "victoria",
		2: "VCT",
	},
	15235: {
		0: "维多利亚",
		1: "vic-2",
		2: "VIC",
	},
	3449: {
		0: "维尔茨堡",
		1: "wuerzburg",
		2: "WZB",
	},
	4171: {
		0: "维尔纽斯",
		1: "vilnius",
		2: "WEN",
	},
	3275: {
		0: "维克",
		1: "vic",
		2: "VIC",
	},
	3476: {
		0: "维罗纳",
		1: "verona",
		2: "WLN",
	},
	1885: {
		0: "维西傈僳族自治县",
		1: "weixi",
		2: "WX",
	},
	2417: {
		0: "维也纳",
		1: "vienna",
		2: "WYN",
	},
	149: {
		0: "潍坊",
		1: "weifang",
		2: "WF",
	},
	3397: {
		0: "委内瑞拉",
		1: "venezuela",
		2: "VEN",
	},
	1235: {
		0: "卫辉市",
		1: "weihui",
		2: "WH",
	},
	1257: {
		0: "尉氏县",
		1: "weishi",
		2: "WS",
	},
	293: {
		0: "渭南",
		1: "weinan",
		2: "WN",
	},
	2130: {
		0: "渭源县",
		1: "weiyuanxian",
		2: "WY",
	},
	11472: {
		0: "蔚山",
		1: "uls",
		2: "ULS",
	},
	3465: {
		0: "魏玛",
		1: "weimar",
		2: "WEI",
	},
	572: {
		0: "魏县",
		1: "hdweixian",
		2: "WX",
	},
	2415: {
		0: "温哥华",
		1: "vancouver",
		2: "WGH",
	},
	4425: {
		0: "温江区",
		1: "wenjiang",
		2: "WJ",
	},
	899: {
		0: "温岭市",
		1: "wenling",
		2: "WL",
	},
	10379: {
		0: "温尼伯",
		1: "Winnipeg",
		2: "WIN",
	},
	2242: {
		0: "温泉县",
		1: "wenquan",
		2: "WQ",
	},
	4304: {
		0: "温莎",
		1: "windsor",
		2: "WSH",
	},
	2214: {
		0: "温宿县",
		1: "wensu",
		2: "WS",
	},
	1234: {
		0: "温县",
		1: "wenxian",
		2: "WX",
	},
	101: {
		0: "温州",
		1: "wenzhou",
		2: "WZ",
	},
	495: {
		0: "文安县",
		1: "wenan",
		2: "WA",
	},
	408: {
		0: "文昌",
		1: "wenchang",
		2: "WC",
	},
	907: {
		0: "文成县",
		1: "wencheng",
		2: "WC",
	},
	1163: {
		0: "文登区",
		1: "wendeng",
		2: "WD",
	},
	4149: {
		0: "文根",
		1: "wengen",
		2: "WG",
	},
	2492: {
		0: "文莱",
		1: "brunei",
		2: "WL",
	},
	1924: {
		0: "文山市",
		1: "wenshanshi",
		2: "WSS",
	},
	274: {
		0: "文山州",
		1: "wenshan",
		2: "WS",
	},
	648: {
		0: "文水县",
		1: "wenshui",
		2: "WS",
	},
	2135: {
		0: "文县",
		1: "wenxianxian",
		2: "WX",
	},
	3520: {
		0: "闻喜县",
		1: "wenxixian",
		2: "WXX",
	},
	1695: {
		0: "汶川县",
		1: "wenchuan",
		2: "WC",
	},
	1188: {
		0: "汶上县",
		1: "wenshang",
		2: "WS",
	},
	3498: {
		0: "翁布里亚大区",
		1: "umbria",
		2: "UMB",
	},
	3535: {
		0: "翁牛特旗",
		1: "wenteqi",
		2: "WTQ",
	},
	1475: {
		0: "翁源县",
		1: "wengyuan",
		2: "WY",
	},
	1799: {
		0: "瓮安县",
		1: "wengan",
		2: "WA",
	},
	3452: {
		0: "沃尔夫斯堡",
		1: "wolfsburg",
		2: "WOB",
	},
	4147: {
		0: "沃韦",
		1: "vevey",
		2: "VVY",
	},
	4111: {
		0: "卧龙岗",
		1: "wollongong",
		2: "WLG",
	},
	2416: {
		0: "渥太华",
		1: "ottawa",
		2: "WTH",
	},
	3315: {
		0: "乌代布尔",
		1: "udaipur",
		2: "WDB",
	},
	4339: {
		0: "乌得勒支",
		1: "utrecht",
		2: "UTT",
	},
	3464: {
		0: "乌尔姆",
		1: "ulm",
		2: "Ulm",
	},
	3240: {
		0: "乌干达",
		1: "uganda",
		2: "UGA",
	},
	48: {
		0: "乌海",
		1: "wuhai",
		2: "WH",
	},
	3238: {
		0: "乌克兰",
		1: "ukraine",
		2: "UKR",
	},
	3241: {
		0: "乌拉圭",
		1: "uruguay",
		2: "URY",
	},
	3559: {
		0: "乌拉特后旗",
		1: "wuhouqi",
		2: "WHQ",
	},
	3557: {
		0: "乌拉特前旗",
		1: "wuqianqi",
		2: "WQQ",
	},
	3558: {
		0: "乌拉特中旗",
		1: "wuzhongqi",
		2: "WZQ",
	},
	55: {
		0: "乌兰察布",
		1: "wulanchabu",
		2: "WL",
	},
	368: {
		0: "乌兰浩特市",
		1: "wulanhaote",
		2: "WLH",
	},
	2186: {
		0: "乌兰县",
		1: "wulan",
		2: "WL",
	},
	325: {
		0: "乌鲁木齐",
		1: "wulumuqi",
		2: "WLM",
	},
	2200: {
		0: "乌鲁木齐县",
		1: "wulumuqixian",
		2: "WLM",
	},
	4134: {
		0: "乌普萨拉",
		1: "uppsala",
		2: "UPS",
	},
	2239: {
		0: "乌恰县",
		1: "wuqia",
		2: "WQ",
	},
	3548: {
		0: "乌审旗",
		1: "wushenqi",
		2: "WSQ",
	},
	2219: {
		0: "乌什县",
		1: "wushi",
		2: "WS",
	},
	2269: {
		0: "乌苏市",
		1: "wusu",
		2: "WS",
	},
	3513: {
		0: "乌镇",
		1: "wuzhen",
		2: "WZ",
	},
	3239: {
		0: "乌兹别克斯坦",
		1: "uzbekistan",
		2: "UZB",
	},
	2295: {
		0: "巫山县",
		1: "wushanxian",
		2: "WS",
	},
	2294: {
		0: "巫溪县",
		1: "wuxia",
		2: "WX",
	},
	1197: {
		0: "无棣县",
		1: "wudi",
		2: "WD",
	},
	452: {
		0: "无极县",
		1: "wuji",
		2: "WJ",
	},
	969: {
		0: "无为县",
		1: "wuweixian",
		2: "WW",
	},
	13: {
		0: "无锡",
		1: "wuxi",
		2: "WX",
	},
	2069: {
		0: "吴堡县",
		1: "wubao",
		2: "WB",
	},
	1524: {
		0: "吴川市",
		1: "wuchuan",
		2: "WC",
	},
	419: {
		0: "吴江",
		1: "wujiang",
		2: "WJ",
	},
	2013: {
		0: "吴起县",
		1: "wuqi",
		2: "WQ",
	},
	539: {
		0: "吴桥县",
		1: "wuqiao",
		2: "WQ",
	},
	323: {
		0: "吴忠",
		1: "wuzhong",
		2: "WZ",
	},
	111: {
		0: "芜湖",
		1: "wuhu",
		2: "WH",
	},
	947: {
		0: "芜湖县",
		1: "wuhuxian",
		2: "WHX",
	},
	227: {
		0: "梧州",
		1: "wuzhou",
		2: "WZ",
	},
	764: {
		0: "五常市",
		1: "wuchang",
		2: "WC",
	},
	784: {
		0: "五大连池市",
		1: "wudalianchi",
		2: "WDL",
	},
	1366: {
		0: "五峰土家族自治县",
		1: "wufeng",
		2: "WF",
	},
	937: {
		0: "五河县",
		1: "wuhe",
		2: "WH",
	},
	1487: {
		0: "五华县",
		1: "wuhua",
		2: "WH",
	},
	409: {
		0: "五家渠",
		1: "wujiaqu",
		2: "WJQ",
	},
	1169: {
		0: "五莲县",
		1: "wulian",
		2: "WL",
	},
	609: {
		0: "五台县",
		1: "wutai",
		2: "WT",
	},
	3479: {
		0: "五渔村",
		1: "cinqueterre",
		2: "CIT",
	},
	678: {
		0: "五原县",
		1: "wuyuanxian",
		2: "WY",
	},
	615: {
		0: "五寨县",
		1: "wuzai",
		2: "WZ",
	},
	410: {
		0: "五指山",
		1: "wuzhishan",
		2: "WZS",
	},
	559: {
		0: "武安市",
		1: "wuan",
		2: "WA",
	},
	1134: {
		0: "武城县",
		1: "wucheng",
		2: "WC",
	},
	659: {
		0: "武川县",
		1: "wuchuanxian",
		2: "WC",
	},
	3515: {
		0: "武当山",
		1: "wudangshan",
		2: "WDS",
	},
	1906: {
		0: "武定县",
		1: "wuding",
		2: "WD",
	},
	1432: {
		0: "武冈市",
		1: "wugangshi",
		2: "WG",
	},
	2041: {
		0: "武功县",
		1: "wugong",
		2: "WG",
	},
	16: {
		0: "武汉",
		1: "wuhan",
		2: "WH",
	},
	2289: {
		0: "武隆区",
		1: "wulong",
		2: "WL",
	},
	1529: {
		0: "武鸣区",
		1: "wuming",
		2: "WM",
	},
	1044: {
		0: "武宁县",
		1: "wuning",
		2: "WN",
	},
	1028: {
		0: "武平县",
		1: "wuping",
		2: "WP",
	},
	522: {
		0: "武强县",
		1: "wuqiang",
		2: "WQ",
	},
	4456: {
		0: "武清区",
		1: "wuqing",
		2: "WQ",
	},
	2097: {
		0: "武山县",
		1: "wushan",
		2: "WS",
	},
	1638: {
		0: "武胜县",
		1: "wusheng",
		2: "WS",
	},
	304: {
		0: "武威",
		1: "wuwei",
		2: "WW",
	},
	599: {
		0: "武乡县",
		1: "wuxiang",
		2: "WX",
	},
	1598: {
		0: "武宣县",
		1: "wuxuan",
		2: "WX",
	},
	1338: {
		0: "武穴市",
		1: "wuxue",
		2: "WX",
	},
	989: {
		0: "武夷山",
		1: "wuyishan",
		2: "WYS",
	},
	895: {
		0: "武义县",
		1: "wuyixian",
		2: "WY",
	},
	521: {
		0: "武邑县",
		1: "wuyi",
		2: "WY",
	},
	1233: {
		0: "武陟县",
		1: "wuzhi",
		2: "WZ",
	},
	1274: {
		0: "舞钢市",
		1: "wugang",
		2: "WG",
	},
	1272: {
		0: "舞阳县",
		1: "wuyang",
		2: "WY",
	},
	1756: {
		0: "务川仡佬族苗族自治县",
		1: "wuchuanzzxian",
		2: "WC",
	},
	1087: {
		0: "婺源县",
		1: "wuyuan",
		2: "WY",
	},
	1269: {
		0: "建安区",
		1: "xuchangxian",
		2: "XCX",
	},
	1243: {
		0: "浚县",
		1: "xunxian",
		2: "XX",
	},
	1048: {
		0: "庐山市",
		1: "xingzi",
		2: "XZ",
	},
	17: {
		0: "西安",
		1: "xian",
		2: "XA",
	},
	4356: {
		0: "西班牙",
		1: "spain",
		2: "ESP",
	},
	382: {
		0: "西昌市",
		1: "xichang",
		2: "XC",
	},
	1635: {
		0: "西充县",
		1: "xichong",
		2: "XC",
	},
	1926: {
		0: "西畴县",
		1: "xichou",
		2: "XC",
	},
	3356: {
		0: "西代",
		1: "side",
		2: "SDE",
	},
	3611: {
		0: "西递",
		1: "xidi",
		2: "XD",
	},
	698: {
		0: "西丰县",
		1: "xifeng",
		2: "XF",
	},
	2365: {
		0: "西哈努克",
		1: "sihanoukville",
		2: "KOS",
	},
	2136: {
		0: "西和县",
		1: "xihe",
		2: "XH",
	},
	1300: {
		0: "西华县",
		1: "xihua",
		2: "XH",
	},
	2196: {
		0: "西吉县",
		1: "xiji",
		2: "XJ",
	},
	3625: {
		0: "西江千户苗寨",
		1: "xijiangqianhu",
		2: "XJ",
	},
	4264: {
		0: "西礁岛",
		1: "keywest",
		2: "KWT",
	},
	1583: {
		0: "西林县",
		1: "xilin",
		2: "XL",
	},
	3620: {
		0: "西岭雪山",
		1: "xilingxueshan",
		2: "XLX",
	},
	1866: {
		0: "西盟佤族自治县",
		1: "ximeng",
		2: "XM",
	},
	15253: {
		0: "西米德兰兹",
		1: "West-Midlands",
		2: "WES",
	},
	313: {
		0: "西宁",
		1: "xining",
		2: "XN",
	},
	1310: {
		0: "西平县",
		1: "xiping",
		2: "XP",
	},
	276: {
		0: "西双版纳",
		1: "xishuangbanna",
		2: "XSB",
	},
	3512: {
		0: "西塘",
		1: "xitang",
		2: "XT",
	},
	3572: {
		0: "西乌珠穆沁旗",
		1: "xiwuqinqi",
		2: "XWQ",
	},
	3484: {
		0: "西西里",
		1: "sic",
		2: "SIC",
	},
	1283: {
		0: "西峡县",
		1: "xixia",
		2: "XX",
	},
	2054: {
		0: "西乡县",
		1: "xixiang",
		2: "XX",
	},
	2399: {
		0: "西雅图",
		1: "seattle",
		2: "SEA",
	},
	3426: {
		0: "希腊",
		1: "greece",
		2: "GRC",
	},
	624: {
		0: "昔阳县",
		1: "xiyang",
		2: "XY",
	},
	1743: {
		0: "息烽县",
		1: "xifengxian",
		2: "XF",
	},
	1291: {
		0: "息县",
		1: "xyxixian",
		2: "XX",
	},
	1342: {
		0: "浠水县",
		1: "xishui",
		2: "XS",
	},
	2379: {
		0: "悉尼",
		1: "sydney",
		2: "SYD",
	},
	1286: {
		0: "淅川县",
		1: "xichuan",
		2: "XC",
	},
	10066: {
		0: "锡拉库萨",
		1: "syr",
		2: "SYR",
	},
	54: {
		0: "锡林郭勒",
		1: "xilinguole",
		2: "XLG",
	},
	367: {
		0: "锡林浩特市",
		1: "xilinhaote",
		2: "XLH",
	},
	3480: {
		0: "锡耶纳",
		1: "siena",
		2: "SIN",
	},
	1754: {
		0: "习水县",
		1: "xishuixian",
		2: "XS",
	},
	644: {
		0: "隰县",
		1: "xixian",
		2: "XX",
	},
	1733: {
		0: "喜德县",
		1: "xide",
		2: "XD",
	},
	3627: {
		0: "喜洲",
		1: "xizhou",
		2: "XZ",
	},
	1110: {
		0: "峡江县",
		1: "xiajian",
		2: "XJ",
	},
	4079: {
		0: "霞慕尼",
		1: "chamonix",
		2: "CHM",
	},
	1033: {
		0: "霞浦县",
		1: "xiapu",
		2: "XP",
	},
	15077: {
		0: "下关",
		1: "shi",
		2: "SHI",
	},
	3211: {
		0: "下龙湾",
		1: "halongbay",
		2: "XHW",
	},
	15033: {
		0: "下吕",
		1: "Gero",
		2: "GER",
	},
	2155: {
		0: "夏河县",
		1: "xiahe",
		2: "XH",
	},
	1133: {
		0: "夏津县",
		1: "xiajin",
		2: "XJ",
	},
	4286: {
		0: "夏洛特",
		1: "charlotte",
		2: "XLT",
	},
	2404: {
		0: "夏威夷",
		1: "Hawaii",
		2: "HNL",
	},
	3525: {
		0: "夏县",
		1: "xiaxian",
		2: "XX",
	},
	1265: {
		0: "夏邑县",
		1: "xiayi",
		2: "XY",
	},
	15: {
		0: "厦门",
		1: "xiamen",
		2: "XM",
	},
	3614: {
		0: "仙都",
		1: "xiandu",
		2: "XD",
	},
	902: {
		0: "仙居县",
		1: "xianju",
		2: "XJ",
	},
	15076: {
		0: "仙台",
		1: "sen",
		2: "SEN",
	},
	189: {
		0: "仙桃",
		1: "xiantao",
		2: "XT",
	},
	997: {
		0: "仙游县",
		1: "xianyou",
		2: "XY",
	},
	2363: {
		0: "暹粒",
		1: "siemreap",
		2: "REP",
	},
	1373: {
		0: "咸丰县",
		1: "xianfeng",
		2: "XF",
	},
	186: {
		0: "咸宁",
		1: "xianning",
		2: "XN",
	},
	292: {
		0: "咸阳",
		1: "xianyang",
		2: "XY",
	},
	3213: {
		0: "岘港",
		1: "danang",
		2: "DAG",
	},
	540: {
		0: "献县",
		1: "xianxian",
		2: "XX",
	},
	1721: {
		0: "乡城县",
		1: "gzzxiangcheng",
		2: "XC",
	},
	640: {
		0: "乡宁县",
		1: "xiangning",
		2: "XN",
	},
	15074: {
		0: "相模原",
		1: "Sagamihara",
		2: "SAG",
	},
	341: {
		0: "香港",
		1: "hongkong",
		2: "HK",
	},
	1883: {
		0: "香格里拉市",
		1: "xianggelila",
		2: "XGL",
	},
	493: {
		0: "香河县",
		1: "xianghe",
		2: "XH",
	},
	193: {
		0: "湘潭",
		1: "xiangtan",
		2: "XT",
	},
	1406: {
		0: "湘潭县",
		1: "xiangtanxian",
		2: "XTX",
	},
	204: {
		0: "湘西",
		1: "xiangxi",
		2: "XX",
	},
	1404: {
		0: "湘乡市",
		1: "xiangxiang",
		2: "XX",
	},
	1397: {
		0: "湘阴县",
		1: "xiangyin",
		2: "XY",
	},
	2378: {
		0: "箱根",
		1: "hakone",
		2: "HAK",
	},
	1271: {
		0: "襄城县",
		1: "xcxiangcheng",
		2: "XC",
	},
	634: {
		0: "襄汾县",
		1: "xiangfen",
		2: "XF",
	},
	180: {
		0: "襄阳",
		1: "xiangyang",
		2: "XY",
	},
	593: {
		0: "襄垣县",
		1: "xiangyuan",
		2: "XY",
	},
	3574: {
		0: "镶黄旗",
		1: "xianghuangqi",
		2: "XHQ",
	},
	1258: {
		0: "祥符区",
		1: "xiangfuqu",
		2: "XFQ",
	},
	1887: {
		0: "祥云县",
		1: "xiangyun",
		2: "XY",
	},
	850: {
		0: "响水县",
		1: "xiangshui",
		2: "XS",
	},
	1298: {
		0: "项城市",
		1: "xiangcheng",
		2: "XC",
	},
	10122: {
		0: "象岛",
		1: "Ko-Chang",
		2: "KOC",
	},
	2309: {
		0: "象山",
		1: "xiangshan",
		2: "XS",
	},
	1597: {
		0: "象州县",
		1: "xiangzhou",
		2: "XZ",
	},
	924: {
		0: "萧县",
		1: "xiaoxian",
		2: "XX",
	},
	1701: {
		0: "小金县",
		1: "xiaojin",
		2: "XJ",
	},
	15069: {
		0: "小田原",
		1: "Odawara",
		2: "ODA",
	},
	15072: {
		0: "小樽",
		1: "Otaru",
		2: "OTA",
	},
	1334: {
		0: "孝昌县",
		1: "xiaocang",
		2: "XC",
	},
	183: {
		0: "孝感",
		1: "xiaogan",
		2: "XG",
	},
	646: {
		0: "孝义市",
		1: "xiaoyi",
		2: "XY",
	},
	4314: {
		0: "谢菲尔德",
		1: "sheffield",
		2: "SHF",
	},
	1986: {
		0: "谢通门县",
		1: "xietongmen",
		2: "XTM",
	},
	1599: {
		0: "忻城县",
		1: "xincheng",
		2: "XC",
	},
	43: {
		0: "忻州",
		1: "xinzhou",
		2: "XZ",
	},
	439: {
		0: "辛集市",
		1: "xinji",
		2: "XJ",
	},
	4352: {
		0: "辛特拉",
		1: "sintra",
		2: "SIR",
	},
	4285: {
		0: "辛辛那提",
		1: "cincinnati",
		2: "CCN",
	},
	1222: {
		0: "新安县",
		1: "xinan",
		2: "XA",
	},
	4239: {
		0: "新奥尔良",
		1: "neworleans",
		2: "NOL",
	},
	3556: {
		0: "新巴尔虎右旗",
		1: "chenhuyouqi",
		2: "XBY",
	},
	3555: {
		0: "新巴尔虎左旗",
		1: "chenhuzuoqi",
		2: "XBZ",
	},
	2340: {
		0: "新北",
		1: "newtaipei",
		2: "NTC",
	},
	701: {
		0: "新宾满族自治县",
		1: "xinbin",
		2: "XB",
	},
	1314: {
		0: "新蔡县",
		1: "xincha",
		2: "XC",
	},
	887: {
		0: "新昌县",
		1: "xincang",
		2: "XC",
	},
	2407: {
		0: "新德里",
		1: "newdelhi",
		2: "XDL",
	},
	4424: {
		0: "新都区",
		1: "xindu",
		2: "XD",
	},
	1476: {
		0: "新丰县",
		1: "xinfengxian",
		2: "XF",
	},
	1111: {
		0: "新干县",
		1: "jaxinganxian",
		2: "XG",
	},
	2217: {
		0: "新和县",
		1: "xinhexian",
		2: "XH",
	},
	553: {
		0: "新河县",
		1: "xinhe",
		2: "XH",
	},
	1455: {
		0: "新化县",
		1: "xinhua",
		2: "XH",
	},
	1448: {
		0: "新晃侗族自治县",
		1: "xinhuang",
		2: "XH",
	},
	4436: {
		0: "新会",
		1: "xinhui",
		2: "XH",
	},
	2311: {
		0: "新加坡",
		1: "singapore",
		2: "SG",
	},
	3522: {
		0: "新绛县",
		1: "xinjiangxian",
		2: "XJX",
	},
	1613: {
		0: "新津县",
		1: "xinjin",
		2: "XJ",
	},
	4023: {
		0: "新喀里多尼亚",
		1: "newcaledonia",
		2: "NCL",
	},
	442: {
		0: "新乐市",
		1: "xinle",
		2: "XL",
	},
	1714: {
		0: "新龙县",
		1: "xinliu",
		2: "XL",
	},
	1211: {
		0: "新密市",
		1: "xinmi",
		2: "XM",
	},
	684: {
		0: "新民市",
		1: "xinmin",
		2: "XM",
	},
	15236: {
		0: "新南威尔士",
		1: "New-South-Wales",
		2: "NEW",
	},
	1439: {
		0: "新宁县",
		1: "xinning",
		2: "XN",
	},
	1838: {
		0: "新平彝族傣族自治县",
		1: "xinping",
		2: "XP",
	},
	4400: {
		0: "新山",
		1: "johorbahru",
		2: "JBU",
	},
	1435: {
		0: "新邵县",
		1: "xinshao",
		2: "XS",
	},
	1191: {
		0: "新泰市",
		1: "xintai",
		2: "XT",
	},
	1428: {
		0: "新田县",
		1: "xintian",
		2: "XT",
	},
	2319: {
		0: "新西兰",
		1: "newzealand",
		2: "NZ",
	},
	4025: {
		0: "新西兰南岛",
		1: "newzealandsouth",
		2: "NZS",
	},
	15011: {
		0: "新潟",
		1: "Niigata",
		2: "NII",
	},
	1297: {
		0: "新县",
		1: "xinxianxian",
		2: "XX",
	},
	166: {
		0: "新乡",
		1: "xinxiang",
		2: "XX",
	},
	1237: {
		0: "新乡县",
		1: "xinxiangxian",
		2: "XXX",
	},
	1515: {
		0: "新兴县",
		1: "xinxing",
		2: "XX",
	},
	1289: {
		0: "新野县",
		1: "xinye",
		2: "XY",
	},
	829: {
		0: "新沂市",
		1: "xinyi",
		2: "XY",
	},
	138: {
		0: "新余",
		1: "xinyu",
		2: "XY",
	},
	2263: {
		0: "新源县",
		1: "xinyuan",
		2: "XY",
	},
	15147: {
		0: "新泽西州",
		1: "NewJersey",
		2: "NJ",
	},
	1209: {
		0: "新郑市",
		1: "xinzheng",
		2: "XZ",
	},
	4458: {
		0: "新洲区",
		1: "xinzhouwh",
		2: "XZ",
	},
	3174: {
		0: "新竹",
		1: "hsinchu",
		2: "HSC",
	},
	1063: {
		0: "信丰县",
		1: "xinfeng",
		2: "XF",
	},
	174: {
		0: "信阳",
		1: "xinyang",
		2: "XY",
	},
	1521: {
		0: "信宜市",
		1: "xinyishi",
		2: "XY",
	},
	53: {
		0: "兴安盟",
		1: "xingan",
		2: "XA",
	},
	1539: {
		0: "兴安县",
		1: "xinganxian",
		2: "XAX",
	},
	721: {
		0: "兴城市",
		1: "xingcheng",
		2: "XC",
	},
	1073: {
		0: "兴国县",
		1: "xingguo",
		2: "XG",
	},
	2306: {
		0: "兴海县",
		1: "xinghai",
		2: "XH",
	},
	676: {
		0: "兴和县",
		1: "xinghe",
		2: "XH",
	},
	856: {
		0: "兴化市",
		1: "xinghua",
		2: "XH",
	},
	470: {
		0: "兴隆县",
		1: "xinglong",
		2: "XL",
	},
	1483: {
		0: "兴宁市",
		1: "xingning",
		2: "XN",
	},
	2031: {
		0: "兴平市",
		1: "xingping",
		2: "XP",
	},
	1808: {
		0: "兴仁市",
		1: "xingren",
		2: "XRS",
	},
	1363: {
		0: "兴山县",
		1: "xingshan",
		2: "XS",
	},
	1666: {
		0: "兴文县",
		1: "xingwen",
		2: "XW",
	},
	650: {
		0: "兴县",
		1: "xingxian",
		2: "XX",
	},
	1560: {
		0: "兴业县",
		1: "xingye",
		2: "XY",
	},
	1807: {
		0: "兴义市",
		1: "xingyi",
		2: "XY",
	},
	447: {
		0: "行唐县",
		1: "xingtang",
		2: "XT",
	},
	28: {
		0: "邢台",
		1: "xingtai",
		2: "XT",
	},
	544: {
		0: "邢台县",
		1: "xingtaixian",
		2: "XTX",
	},
	3305: {
		0: "匈牙利",
		1: "hungary",
		2: "HUN",
	},
	513: {
		0: "雄县",
		1: "xiongxian",
		2: "XX",
	},
	3192: {
		0: "熊本",
		1: "kumamoto",
		2: "KMM",
	},
	960: {
		0: "休宁县",
		1: "xiuning",
		2: "XN",
	},
	4188: {
		0: "休斯顿",
		1: "houston",
		2: "XSD",
	},
	1045: {
		0: "修水县",
		1: "xiushui",
		2: "XS",
	},
	1742: {
		0: "修文县",
		1: "xiuwen",
		2: "XW",
	},
	1231: {
		0: "修武县",
		1: "xiuwu",
		2: "XW",
	},
	2302: {
		0: "秀山土家族苗族自治县",
		1: "xiushan",
		2: "XS",
	},
	709: {
		0: "岫岩满族自治县",
		1: "xiuyan",
		2: "XY",
	},
	842: {
		0: "盱眙县",
		1: "xuyi",
		2: "XY",
	},
	504: {
		0: "徐水区",
		1: "xushui",
		2: "XS",
	},
	1528: {
		0: "徐闻县",
		1: "xuwen",
		2: "XW",
	},
	92: {
		0: "徐州",
		1: "xuzhou",
		2: "XZ",
	},
	169: {
		0: "许昌",
		1: "xuchang",
		2: "XC",
	},
	15025: {
		0: "旭川",
		1: "Asahikawa",
		2: "ASA",
	},
	3335: {
		0: "叙利亚",
		1: "syria",
		2: "SIR",
	},
	1657: {
		0: "叙永县",
		1: "xuyong",
		2: "XY",
	},
	1659: {
		0: "叙州区",
		1: "yibinxian",
		2: "XZQ",
	},
	1444: {
		0: "溆浦县",
		1: "xupu",
		2: "XP",
	},
	126: {
		0: "宣城",
		1: "xuancheng",
		2: "XC",
	},
	1372: {
		0: "宣恩县",
		1: "xuanen",
		2: "XE",
	},
	1675: {
		0: "宣汉县",
		1: "xuanhan",
		2: "XH",
	},
	456: {
		0: "宣化区",
		1: "xuanhua",
		2: "XH",
	},
	1824: {
		0: "宣威市",
		1: "xuanwei",
		2: "XW",
	},
	4441: {
		0: "薛城",
		1: "xuecheng",
		2: "XC",
	},
	11596: {
		0: "雪城",
		1: "Syracuse",
		2: "SYR",
	},
	1823: {
		0: "寻甸回族彝族自治县",
		1: "xundian",
		2: "XD",
	},
	1075: {
		0: "寻乌县",
		1: "xunwu",
		2: "XW",
	},
	2079: {
		0: "旬阳县",
		1: "xunyang",
		2: "XY",
	},
	2039: {
		0: "旬邑县",
		1: "xunyi",
		2: "XY",
	},
	2164: {
		0: "循化撒拉族自治县",
		1: "xunhua",
		2: "XH",
	},
	786: {
		0: "逊克县",
		1: "xunke",
		2: "XK",
	},
	1213: {
		0: "荥阳市",
		1: "xingyang",
		2: "XY",
	},
	2474: {
		0: "阿斯旺",
		1: "aswan",
		2: "YSW",
	},
	905: {
		0: "乐清",
		1: "yueqing",
		2: "YQ",
	},
	2252: {
		0: "尉犁县",
		1: "weili",
		2: "YL",
	},
	461: {
		0: "蔚县",
		1: "weixian",
		2: "YX",
	},
	669: {
		0: "牙克石市",
		1: "yakeshi",
		2: "YKS",
	},
	2501: {
		0: "牙买加",
		1: "jamaica",
		2: "YMJ",
	},
	3094: {
		0: "芽庄",
		1: "nhatrang",
		2: "NT",
	},
	252: {
		0: "雅安",
		1: "yaan",
		2: "YA",
	},
	2455: {
		0: "雅典",
		1: "athens",
		2: "YD",
	},
	2353: {
		0: "雅加达",
		1: "jakarta",
		2: "CGK",
	},
	1710: {
		0: "雅江县",
		1: "yajian",
		2: "YJ",
	},
	4394: {
		0: "亚庇",
		1: "kotakinabalu",
		2: "KOK",
	},
	3597: {
		0: "亚布力",
		1: "yabuli",
		2: "YBL",
	},
	3451: {
		0: "亚琛",
		1: "aachen",
		2: "ACH",
	},
	3375: {
		0: "亚的斯亚贝巴",
		1: "addisababa",
		2: "ADA",
	},
	1992: {
		0: "亚东县",
		1: "yadong",
		2: "YD",
	},
	4176: {
		0: "亚喀巴",
		1: "aqaba",
		2: "AQB",
	},
	2473: {
		0: "亚历山大",
		1: "alexandria",
		2: "YLS",
	},
	15144: {
		0: "亚利桑那州",
		1: "Arizona",
		2: "ARI",
	},
	3244: {
		0: "亚美尼亚",
		1: "armenia",
		2: "AM",
	},
	3245: {
		0: "亚速尔群岛",
		1: "azores",
		2: "AZO",
	},
	4190: {
		0: "亚特兰大",
		1: "atlanta",
		2: "YTL",
	},
	3254: {
		0: "亚兹德",
		1: "yazd",
		2: "YZD",
	},
	148: {
		0: "烟台",
		1: "yantai",
		2: "YT",
	},
	2258: {
		0: "焉耆回族自治县",
		1: "yanqi",
		2: "YQ",
	},
	1270: {
		0: "鄢陵县",
		1: "yanling",
		2: "YL",
	},
	294: {
		0: "延安",
		1: "yanan",
		2: "YA",
	},
	78: {
		0: "延边",
		1: "yanbian",
		2: "YB",
	},
	2008: {
		0: "延长县",
		1: "yanchang",
		2: "YC",
	},
	2009: {
		0: "延川县",
		1: "yanchuan",
		2: "YC",
	},
	361: {
		0: "延吉市",
		1: "yanji",
		2: "YJ",
	},
	1240: {
		0: "延津县",
		1: "yanjin",
		2: "YJ",
	},
	435: {
		0: "延庆区",
		1: "yanqing",
		2: "YQ",
	},
	772: {
		0: "延寿县",
		1: "yanshou",
		2: "YS",
	},
	1777: {
		0: "沿河土家族自治县",
		1: "yanhe",
		2: "YH",
	},
	1403: {
		0: "炎陵县",
		1: "yanlingxian",
		2: "YL",
	},
	1669: {
		0: "盐边县",
		1: "yanbianxian",
		2: "YB",
	},
	97: {
		0: "盐城",
		1: "yancheng",
		2: "YC",
	},
	2194: {
		0: "盐池县",
		1: "yanchi",
		2: "YC",
	},
	4191: {
		0: "盐湖城",
		1: "saltlakecity",
		2: "YHC",
	},
	1846: {
		0: "盐津县",
		1: "yanjinxian",
		2: "YJ",
	},
	536: {
		0: "盐山县",
		1: "yanshan",
		2: "YS",
	},
	1620: {
		0: "盐亭县",
		1: "yanting",
		2: "YT",
	},
	1724: {
		0: "盐源县",
		1: "yanyuan",
		2: "YY",
	},
	4486: {
		0: "阎良区",
		1: "yanliang",
		2: "YL",
	},
	1182: {
		0: "兖州区",
		1: "yanzhou",
		2: "YZ",
	},
	1220: {
		0: "偃师市",
		1: "yanshi",
		2: "YS",
	},
	1925: {
		0: "砚山县",
		1: "yanshanxian",
		2: "YS",
	},
	3604: {
		0: "雁荡山",
		1: "yandangshan",
		2: "YDS",
	},
	863: {
		0: "扬中市",
		1: "yangzhong",
		2: "YZ",
	},
	12: {
		0: "扬州",
		1: "yangzhou",
		2: "YZ",
	},
	4338: {
		0: "羊角村",
		1: "giethoorn",
		2: "GTH",
	},
	605: {
		0: "阳城县",
		1: "yangcheng",
		2: "YC",
	},
	1517: {
		0: "阳春市",
		1: "yangchun",
		2: "YC",
	},
	1519: {
		0: "阳东区",
		1: "yangdong",
		2: "YD",
	},
	582: {
		0: "阳高县",
		1: "yanggao",
		2: "YG",
	},
	1123: {
		0: "阳谷县",
		1: "yanggu",
		2: "YG",
	},
	4113: {
		0: "阳光海岸",
		1: "sunshinecoast",
		2: "SSC",
	},
	217: {
		0: "阳江",
		1: "yangjiang",
		2: "YJ",
	},
	576: {
		0: "阳曲县",
		1: "yangqu",
		2: "YQ",
	},
	37: {
		0: "阳泉",
		1: "yangquan",
		2: "YQ",
	},
	1467: {
		0: "阳山县",
		1: "yangshan",
		2: "YS",
	},
	1535: {
		0: "阳朔县",
		1: "yangsu",
		2: "YS",
	},
	1518: {
		0: "阳西县",
		1: "yangxi",
		2: "YX",
	},
	1347: {
		0: "阳新县",
		1: "yangxinxian",
		2: "YX",
	},
	1196: {
		0: "阳信县",
		1: "yangxin",
		2: "YX",
	},
	462: {
		0: "阳原县",
		1: "yangyuan",
		2: "YY",
	},
	4485: {
		0: "杨陵区",
		1: "yangling",
		2: "YL",
	},
	2053: {
		0: "洋县",
		1: "yangxian",
		2: "YX",
	},
	3223: {
		0: "仰光",
		1: "yangon",
		2: "YGN",
	},
	1895: {
		0: "漾濞彝族自治县",
		1: "yangbi",
		2: "YB",
	},
	1902: {
		0: "姚安县",
		1: "yaoan",
		2: "YA",
	},
	3246: {
		0: "耶路撒冷",
		1: "jerusalem",
		2: "YRS",
	},
	2207: {
		0: "叶城县",
		1: "yecheng",
		2: "YC",
	},
	3262: {
		0: "叶卡捷琳堡",
		1: "ekaterinburg",
		2: "EKB",
	},
	1277: {
		0: "叶县",
		1: "yexian",
		2: "YX",
	},
	15228: {
		0: "一号公路",
		1: "cal-2",
		2: "CAL",
	},
	1228: {
		0: "伊川县",
		1: "yichuan",
		2: "YC",
	},
	85: {
		0: "伊春",
		1: "yichun",
		2: "YC",
	},
	15102: {
		0: "伊豆",
		1: "Izu",
		2: "IZU",
	},
	3264: {
		0: "伊尔库茨克",
		1: "irkutsk",
		2: "IRK",
	},
	3423: {
		0: "伊瓜苏",
		1: "fozdoiguacu",
		2: "YGS",
	},
	3549: {
		0: "伊金霍洛旗",
		1: "yijinqi",
		2: "YJQ",
	},
	3249: {
		0: "伊拉克",
		1: "iraq",
		2: "IRQ",
	},
	3250: {
		0: "伊朗",
		1: "iran",
		2: "IRI",
	},
	336: {
		0: "伊犁",
		1: "yili",
		2: "YL",
	},
	15122: {
		0: "伊利诺伊州",
		1: "Illinois",
		2: "ILL",
	},
	2259: {
		0: "伊宁市",
		1: "yining",
		2: "YN",
	},
	2260: {
		0: "伊宁县",
		1: "yiningxian",
		2: "YNX",
	},
	3252: {
		0: "伊斯法罕",
		1: "sfahan",
		2: "YSH",
	},
	2444: {
		0: "伊斯坦布尔",
		1: "istanbul",
		2: "YST",
	},
	744: {
		0: "伊通满族自治县",
		1: "yitong",
		2: "YT",
	},
	2234: {
		0: "伊吾县",
		1: "yiwuxian",
		2: "YW",
	},
	2447: {
		0: "伊兹密尔",
		1: "izmir",
		2: "YZM",
	},
	776: {
		0: "依安县",
		1: "yian",
		2: "YA",
	},
	766: {
		0: "依兰县",
		1: "yilan",
		2: "YL",
	},
	961: {
		0: "黟县",
		1: "hsyixian",
		2: "YX",
	},
	1634: {
		0: "仪陇县",
		1: "yilong",
		2: "YL",
	},
	424: {
		0: "仪征市",
		1: "yizheng",
		2: "YZ",
	},
	3505: {
		0: "夷陵区",
		1: "yiling",
		2: "YL",
	},
	1178: {
		0: "沂南县",
		1: "yinan",
		2: "YN",
	},
	1174: {
		0: "沂水县",
		1: "yishui",
		2: "YS",
	},
	1144: {
		0: "沂源县",
		1: "yiyuan",
		2: "YY",
	},
	249: {
		0: "宜宾",
		1: "yibin",
		2: "YB",
	},
	179: {
		0: "宜昌",
		1: "yichang",
		2: "YC",
	},
	1324: {
		0: "宜城市",
		1: "yicheng",
		2: "YC",
	},
	2017: {
		0: "宜川县",
		1: "yichuanxian",
		2: "YC",
	},
	142: {
		0: "宜春",
		1: "jiangxiyichun",
		2: "YC",
	},
	1360: {
		0: "宜都市",
		1: "yidu",
		2: "YD",
	},
	1104: {
		0: "宜丰县",
		1: "yifeng",
		2: "YF",
	},
	1093: {
		0: "宜黄县",
		1: "yihuang",
		2: "YH",
	},
	2020: {
		0: "宜君县",
		1: "yijun",
		2: "YJ",
	},
	3173: {
		0: "宜兰",
		1: "ilan",
		2: "ILA",
	},
	1819: {
		0: "宜良县",
		1: "yiliang",
		2: "YL",
	},
	428: {
		0: "宜兴",
		1: "yixing",
		2: "YX",
	},
	1226: {
		0: "宜阳县",
		1: "lyyiyang",
		2: "YY",
	},
	1417: {
		0: "宜章县",
		1: "yizhang",
		2: "YZ",
	},
	1586: {
		0: "宜州区",
		1: "yizhou",
		2: "YZ",
	},
	4396: {
		0: "怡保",
		1: "ipoh",
		2: "IPO",
	},
	1851: {
		0: "彝良县",
		1: "yiliangxian",
		2: "YL",
	},
	2494: {
		0: "以色列",
		1: "israel",
		2: "YSL",
	},
	950: {
		0: "义安区",
		1: "yianqu",
		2: "YAQ",
	},
	1215: {
		0: "义马市",
		1: "yima",
		2: "YM",
	},
	385: {
		0: "义乌",
		1: "yiwu",
		2: "YW",
	},
	720: {
		0: "义县",
		1: "jzyixian",
		2: "YX",
	},
	1083: {
		0: "弋阳县",
		1: "sryiyang",
		2: "YY",
	},
	1836: {
		0: "易门县",
		1: "yimen",
		2: "YM",
	},
	503: {
		0: "易县",
		1: "bdyixian",
		2: "YX",
	},
	199: {
		0: "益阳",
		1: "yiyang",
		2: "YY",
	},
	3474: {
		0: "意大利",
		1: "italy",
		2: "ITA",
	},
	633: {
		0: "翼城县",
		1: "yichengxian",
		2: "YC",
	},
	4037: {
		0: "因弗卡吉尔",
		1: "invercargill",
		2: "IVC",
	},
	4318: {
		0: "因弗内斯",
		1: "inverness",
		2: "IVN",
	},
	3472: {
		0: "因戈尔施塔特",
		1: "ingolstadt",
		2: "ING",
	},
	2419: {
		0: "因斯布鲁克",
		1: "innsbruck",
		2: "YSB",
	},
	2441: {
		0: "因特拉肯",
		1: "interlaken",
		2: "YTL",
	},
	321: {
		0: "银川",
		1: "yinchuan",
		2: "YC",
	},
	4207: {
		0: "印第安纳波利斯",
		1: "indianapolis",
		2: "YDN",
	},
	15124: {
		0: "印第安纳州",
		1: "Indiana",
		2: "IND",
	},
	3314: {
		0: "印度",
		1: "india",
		2: "IND",
	},
	2325: {
		0: "印度尼西亚",
		1: "indonesia",
		2: "IDN",
	},
	1776: {
		0: "印江土家族苗族自治县",
		1: "yinjiang",
		2: "YJ",
	},
	1331: {
		0: "应城市",
		1: "yingcheng",
		2: "YC",
	},
	579: {
		0: "应县",
		1: "yingxian",
		2: "YX",
	},
	1464: {
		0: "英德市",
		1: "yingde",
		2: "YD",
	},
	4152: {
		0: "英格堡",
		1: "engelberg",
		2: "EBG",
	},
	4299: {
		0: "英国",
		1: "unitedkingdom",
		2: "GBR",
	},
	2204: {
		0: "英吉沙县",
		1: "yingjisha",
		2: "YJS",
	},
	1341: {
		0: "英山县",
		1: "yingshan",
		2: "YS",
	},
	4336: {
		0: "英属维尔京群岛",
		1: "britishvirginis",
		2: "VG",
	},
	139: {
		0: "鹰潭",
		1: "yingtan",
		2: "YT",
	},
	1877: {
		0: "盈江县",
		1: "yingjian",
		2: "YJ",
	},
	1688: {
		0: "荥经县",
		1: "yingjing",
		2: "YJ",
	},
	63: {
		0: "营口",
		1: "yingkou",
		2: "YK",
	},
	1632: {
		0: "营山县",
		1: "yingshanxian",
		2: "YS",
	},
	935: {
		0: "颍上县",
		1: "yingshang",
		2: "YS",
	},
	998: {
		0: "永安市",
		1: "yongan",
		2: "YA",
	},
	2090: {
		0: "永昌县",
		1: "yongcang",
		2: "YC",
	},
	1260: {
		0: "永城市",
		1: "yongcheng",
		2: "YC",
	},
	4430: {
		0: "永川区",
		1: "yongchuan",
		2: "YC",
	},
	1013: {
		0: "永春县",
		1: "yongchun",
		2: "YC",
	},
	1869: {
		0: "永德县",
		1: "yongde",
		2: "YD",
	},
	2087: {
		0: "永登县",
		1: "yongdeng",
		2: "YD",
	},
	1026: {
		0: "永定区",
		1: "yongding",
		2: "YD",
	},
	1112: {
		0: "永丰县",
		1: "yongfeng",
		2: "YF",
	},
	1540: {
		0: "永福县",
		1: "yongfu",
		2: "YF",
	},
	643: {
		0: "永和县",
		1: "yonghe",
		2: "YH",
	},
	740: {
		0: "永吉县",
		1: "yongjixian",
		2: "YJ",
	},
	3501: {
		0: "永济市",
		1: "yongji",
		2: "YJ",
	},
	906: {
		0: "永嘉县",
		1: "yongjia",
		2: "YJ",
	},
	2143: {
		0: "永靖县",
		1: "yongjing",
		2: "YJ",
	},
	893: {
		0: "永康",
		1: "yongkang",
		2: "YK",
	},
	567: {
		0: "永年区",
		1: "yongnian",
		2: "YN",
	},
	2190: {
		0: "永宁县",
		1: "yongning",
		2: "YN",
	},
	1890: {
		0: "永平县",
		1: "yongping",
		2: "YP",
	},
	492: {
		0: "永清县",
		1: "yongqing",
		2: "YQ",
	},
	1904: {
		0: "永仁县",
		1: "yongren",
		2: "YR",
	},
	1848: {
		0: "永善县",
		1: "yongshan",
		2: "YS",
	},
	1854: {
		0: "永胜县",
		1: "yongsheng",
		2: "YS",
	},
	2036: {
		0: "永寿县",
		1: "yongshou",
		2: "YS",
	},
	1462: {
		0: "永顺县",
		1: "yongshun",
		2: "YS",
	},
	986: {
		0: "永泰县",
		1: "yongtai",
		2: "YT",
	},
	1117: {
		0: "永新县",
		1: "yongxin",
		2: "YX",
	},
	1416: {
		0: "永兴县",
		1: "yongxing",
		2: "YX",
	},
	1046: {
		0: "永修县",
		1: "yongxiu",
		2: "YX",
	},
	201: {
		0: "永州",
		1: "yongzhou",
		2: "YZ",
	},
	3165: {
		0: "优胜美地",
		1: "Yosemite",
		2: "YOS",
	},
	1401: {
		0: "攸县",
		1: "youxian",
		2: "YX",
	},
	3384: {
		0: "尤卡坦半岛",
		1: "yucatanpeninsul",
		2: "YUP",
	},
	1003: {
		0: "尤溪县",
		1: "youxi",
		2: "YX",
	},
	15097: {
		0: "由布",
		1: "Yufu",
		2: "YUF",
	},
	15163: {
		0: "犹他州",
		1: "Utah",
		2: "UTA",
	},
	803: {
		0: "友谊县",
		1: "youyi",
		2: "YY",
	},
	2301: {
		0: "酉阳土家族苗族自治县",
		1: "youyang",
		2: "YY",
	},
	580: {
		0: "右玉县",
		1: "youyu",
		2: "YY",
	},
	1072: {
		0: "于都县",
		1: "yudu",
		2: "YD",
	},
	2228: {
		0: "于田县",
		1: "yutianxian",
		2: "YT",
	},
	1084: {
		0: "余干县",
		1: "yugan",
		2: "YG",
	},
	1055: {
		0: "余江区",
		1: "yujian",
		2: "YJQ",
	},
	1753: {
		0: "余庆县",
		1: "yuqing",
		2: "YQ",
	},
	423: {
		0: "余姚",
		1: "yuyao",
		2: "YY",
	},
	590: {
		0: "盂县",
		1: "yuxian",
		2: "YX",
	},
	1185: {
		0: "鱼台县",
		1: "yutai",
		2: "YT",
	},
	4487: {
		0: "榆次区",
		1: "yuci",
		2: "YC",
	},
	296: {
		0: "榆林",
		1: "yulin",
		2: "YL",
	},
	621: {
		0: "榆社县",
		1: "yushe",
		2: "YS",
	},
	726: {
		0: "榆树市",
		1: "ccyushushi",
		2: "YS",
	},
	2089: {
		0: "榆中县",
		1: "yuzhong",
		2: "YZ",
	},
	1261: {
		0: "虞城县",
		1: "yuchengxian",
		2: "YC",
	},
	15093: {
		0: "宇都宫",
		1: "uts",
		2: "UTS",
	},
	1130: {
		0: "禹城市",
		1: "yucheng",
		2: "YC",
	},
	1267: {
		0: "禹州市",
		1: "yuzhou",
		2: "YZ",
	},
	903: {
		0: "玉环市",
		1: "yuhuan",
		2: "YH",
	},
	232: {
		0: "玉林",
		1: "guangxiyulin",
		2: "YL",
	},
	1856: {
		0: "玉龙纳西族自治县",
		1: "yulong",
		2: "YL",
	},
	2102: {
		0: "玉门市",
		1: "yumen",
		2: "YM",
	},
	1775: {
		0: "玉屏侗族自治县",
		1: "yuping",
		2: "YP",
	},
	1080: {
		0: "玉山县",
		1: "yushan",
		2: "YS",
	},
	319: {
		0: "玉树",
		1: "yushu",
		2: "YS",
	},
	2179: {
		0: "玉树市",
		1: "yushushi",
		2: "YSX",
	},
	487: {
		0: "玉田县",
		1: "yutian",
		2: "YT",
	},
	269: {
		0: "玉溪",
		1: "yuxi",
		2: "YX",
	},
	1516: {
		0: "郁南县",
		1: "yunanxian",
		2: "YN",
	},
	15034: {
		0: "御殿场",
		1: "Gotemba",
		2: "GOT",
	},
	2273: {
		0: "裕民县",
		1: "yumin",
		2: "YM",
	},
	1839: {
		0: "元江哈尼族彝族傣族自治县",
		1: "yuanjiang",
		2: "YJ",
	},
	1905: {
		0: "元谋县",
		1: "yuanmou",
		2: "YM",
	},
	454: {
		0: "元氏县",
		1: "yuanshi",
		2: "YS",
	},
	1919: {
		0: "元阳县",
		1: "yuanyangxian",
		2: "YY",
	},
	1389: {
		0: "沅江市",
		1: "yuanjian",
		2: "YJ",
	},
	1442: {
		0: "沅陵县",
		1: "yuanling",
		2: "YL",
	},
	3524: {
		0: "垣曲县",
		1: "hengquxian",
		2: "YQ",
	},
	607: {
		0: "原平市",
		1: "yuanping",
		2: "YP",
	},
	1239: {
		0: "原阳县",
		1: "yuanyang",
		2: "YY",
	},
	1362: {
		0: "远安县",
		1: "yuanan",
		2: "YA",
	},
	2495: {
		0: "约旦",
		1: "jordan",
		2: "YD",
	},
	2479: {
		0: "约翰内斯堡",
		1: "johannesburg",
		2: "YHN",
	},
	3128: {
		0: "约克",
		1: "york",
		2: "YK",
	},
	1637: {
		0: "岳池县",
		1: "yuechi",
		2: "YC",
	},
	2209: {
		0: "岳普湖县",
		1: "yuepuhu",
		2: "YPH",
	},
	958: {
		0: "岳西县",
		1: "yuexi",
		2: "YX",
	},
	196: {
		0: "岳阳",
		1: "yueyang",
		2: "YY",
	},
	1395: {
		0: "岳阳县",
		1: "yueyangxian",
		2: "YYX",
	},
	2317: {
		0: "越南",
		1: "vietnam",
		2: "VN",
	},
	1735: {
		0: "越西县",
		1: "yuexixian",
		2: "YX",
	},
	1514: {
		0: "云安区",
		1: "yunan",
		2: "YA",
	},
	223: {
		0: "云浮",
		1: "yunfu",
		2: "YF",
	},
	915: {
		0: "云和县",
		1: "yunhe",
		2: "YH",
	},
	1891: {
		0: "云龙县",
		1: "yunliu",
		2: "YL",
	},
	1336: {
		0: "云梦县",
		1: "yunmeng",
		2: "YM",
	},
	1868: {
		0: "云县",
		1: "yunxianxian",
		2: "YX",
	},
	1016: {
		0: "云霄县",
		1: "yunxiao",
		2: "YX",
	},
	2297: {
		0: "云阳县",
		1: "yunyang",
		2: "YY",
	},
	588: {
		0: "云州区",
		1: "datongxian",
		2: "YZQ",
	},
	1320: {
		0: "郧西县",
		1: "yunxi",
		2: "YX",
	},
	1317: {
		0: "郧阳区",
		1: "yunyangqu",
		2: "YYQ",
	},
	42: {
		0: "运城",
		1: "yuncheng",
		2: "YC",
	},
	1206: {
		0: "郓城县",
		1: "yunchengxian",
		2: "YC",
	},
	1747: {
		0: "播州区",
		1: "zunyixian",
		2: "ZYX",
	},
	953: {
		0: "枞阳县",
		1: "zongyang",
		2: "ZY",
	},
	2180: {
		0: "杂多县",
		1: "zaduo",
		2: "ZD",
	},
	4377: {
		0: "赞比亚",
		1: "zambia",
		2: "ZMB",
	},
	451: {
		0: "赞皇县",
		1: "zanhuang",
		2: "ZH",
	},
	520: {
		0: "枣强县",
		1: "zaoqiang",
		2: "ZQ",
	},
	1323: {
		0: "枣阳市",
		1: "zaoyang",
		2: "ZY",
	},
	146: {
		0: "枣庄",
		1: "zaozhuang",
		2: "ZZ",
	},
	2171: {
		0: "泽库县",
		1: "zekun",
		2: "ZK",
	},
	2205: {
		0: "泽普县",
		1: "zepu",
		2: "ZP",
	},
	603: {
		0: "泽州县",
		1: "zhezhou",
		2: "ZZ",
	},
	3567: {
		0: "扎赉特旗",
		1: "zhalaiteqi",
		2: "ZLT",
	},
	668: {
		0: "扎兰屯市",
		1: "zalantun",
		2: "ZLT",
	},
	3542: {
		0: "扎鲁特旗",
		1: "zhaluteqi",
		2: "ZLT",
	},
	1968: {
		0: "扎囊县",
		1: "zhanang",
		2: "ZN",
	},
	1999: {
		0: "札达县",
		1: "zhada",
		2: "ZD",
	},
	15075: {
		0: "札幌",
		1: "Sapporo",
		2: "SAP",
	},
	3242: {
		0: "乍得",
		1: "chad",
		2: "SRH",
	},
	2411: {
		0: "斋浦尔",
		1: "jaipur",
		2: "JPE",
	},
	1198: {
		0: "沾化区",
		1: "zhanhua",
		2: "ZH",
	},
	1826: {
		0: "沾益区",
		1: "zhanyi",
		2: "ZY",
	},
	210: {
		0: "湛江",
		1: "zhanjiang",
		2: "ZJ",
	},
	457: {
		0: "张北县",
		1: "zhangbei",
		2: "ZB",
	},
	2098: {
		0: "张家川回族自治县",
		1: "zhangjiachuan",
		2: "ZJC",
	},
	418: {
		0: "张家港",
		1: "zhangjiagang",
		2: "ZJG",
	},
	198: {
		0: "张家界",
		1: "zhangjiajie",
		2: "ZJJ",
	},
	30: {
		0: "张家口",
		1: "zhangjiakou",
		2: "ZJK",
	},
	305: {
		0: "张掖",
		1: "zhangye",
		2: "ZY",
	},
	1118: {
		0: "章丘",
		1: "zhangqiu",
		2: "ZQ",
	},
	3175: {
		0: "彰化",
		1: "zhanghua",
		2: "ZHH",
	},
	693: {
		0: "彰武县",
		1: "zhangwu",
		2: "ZW",
	},
	1024: {
		0: "漳平市",
		1: "zhangping",
		2: "ZP",
	},
	1017: {
		0: "漳浦县",
		1: "zhangpu",
		2: "ZP",
	},
	2128: {
		0: "漳县",
		1: "zhangxian",
		2: "ZX",
	},
	130: {
		0: "漳州",
		1: "zhangzhou",
		2: "ZZ",
	},
	1099: {
		0: "樟树市",
		1: "zhangshu",
		2: "ZS",
	},
	1159: {
		0: "招远市",
		1: "zhaoyuan",
		2: "ZY",
	},
	1732: {
		0: "昭觉县",
		1: "zhaojue",
		2: "ZJ",
	},
	1601: {
		0: "昭平县",
		1: "zhaoping",
		2: "ZP",
	},
	2264: {
		0: "昭苏县",
		1: "zhaosu",
		2: "ZS",
	},
	271: {
		0: "昭通",
		1: "zhaotong",
		2: "ZT",
	},
	1018: {
		0: "诏安县",
		1: "zhaoan",
		2: "ZA",
	},
	455: {
		0: "赵县",
		1: "zhaoxian",
		2: "ZX",
	},
	816: {
		0: "肇东市",
		1: "zhaodong",
		2: "ZD",
	},
	212: {
		0: "肇庆",
		1: "zhaoqing",
		2: "ZQ",
	},
	789: {
		0: "肇源县",
		1: "zhaoyuanxian",
		2: "ZY",
	},
	788: {
		0: "肇州县",
		1: "zhaozhou",
		2: "ZZ",
	},
	1266: {
		0: "柘城县",
		1: "zhecheng",
		2: "ZC",
	},
	1034: {
		0: "柘荣县",
		1: "zherong",
		2: "ZR",
	},
	1811: {
		0: "贞丰县",
		1: "zhenfeng",
		2: "ZF",
	},
	2085: {
		0: "镇安县",
		1: "zhenan",
		2: "ZA",
	},
	2058: {
		0: "镇巴县",
		1: "zhenba",
		2: "ZB",
	},
	4475: {
		0: "镇海区",
		1: "zhenhai",
		2: "ZH",
	},
	98: {
		0: "镇江",
		1: "zhenjiang",
		2: "ZJ",
	},
	1870: {
		0: "镇康县",
		1: "zhenkang",
		2: "ZK",
	},
	730: {
		0: "镇赉县",
		1: "zhenlai",
		2: "ZL",
	},
	1760: {
		0: "镇宁布依族苗族自治县",
		1: "zhenning",
		2: "ZN",
	},
	1284: {
		0: "镇平县",
		1: "zhenping",
		2: "ZP",
	},
	2078: {
		0: "镇坪县",
		1: "zhenpin",
		2: "ZP",
	},
	1850: {
		0: "镇雄县",
		1: "zhenxiong",
		2: "ZX",
	},
	1862: {
		0: "镇沅彝族哈尼族拉祜族自治县",
		1: "zhenyuanzzxian",
		2: "ZY",
	},
	2119: {
		0: "镇原县",
		1: "zhenyuanxian",
		2: "ZY",
	},
	1783: {
		0: "镇远县",
		1: "zhenyuan",
		2: "ZY",
	},
	1750: {
		0: "正安县",
		1: "zhengan",
		2: "ZA",
	},
	445: {
		0: "正定县",
		1: "zhengding",
		2: "ZD",
	},
	3576: {
		0: "正蓝旗",
		1: "zhenglanqi",
		2: "ZLQ",
	},
	2117: {
		0: "正宁县",
		1: "zhengning",
		2: "ZN",
	},
	3575: {
		0: "正镶白旗",
		1: "zhengbaiqi",
		2: "ZBQ",
	},
	1315: {
		0: "正阳县",
		1: "zhengyang",
		2: "ZY",
	},
	160: {
		0: "郑州",
		1: "zhengzhou",
		2: "ZZ",
	},
	996: {
		0: "政和县",
		1: "zhenghe",
		2: "ZH",
	},
	2400: {
		0: "芝加哥",
		1: "chicago",
		2: "CHI",
	},
	1359: {
		0: "枝江市",
		1: "zhijian",
		2: "ZJ",
	},
	1766: {
		0: "织金县",
		1: "zhijin",
		2: "ZJ",
	},
	1449: {
		0: "芷江侗族自治县",
		1: "zhijiang",
		2: "ZJ",
	},
	2012: {
		0: "志丹县",
		1: "zhidan",
		2: "ZD",
	},
	2182: {
		0: "治多县",
		1: "zhiduo",
		2: "ZD",
	},
	4039: {
		0: "智利",
		1: "chile",
		2: "CHL",
	},
	1445: {
		0: "中方县",
		1: "zhongfang",
		2: "ZF",
	},
	3233: {
		0: "中非",
		1: "centralafrica",
		2: "BCA",
	},
	1629: {
		0: "中江县",
		1: "zhongjian",
		2: "ZJ",
	},
	1214: {
		0: "中牟县",
		1: "zhongmo",
		2: "ZM",
	},
	3592: {
		0: "中宁县",
		1: "zhongningxian",
		2: "ZNX",
	},
	220: {
		0: "中山",
		1: "zhongshan",
		2: "ZS",
	},
	351: {
		0: "中卫",
		1: "zhongwei",
		2: "ZW",
	},
	649: {
		0: "中阳县",
		1: "zhongyang",
		2: "ZY",
	},
	4447: {
		0: "忠清北道",
		1: "Chungbuk",
		2: "CCB",
	},
	4448: {
		0: "忠清南道",
		1: "Chungnam",
		2: "CCN",
	},
	2298: {
		0: "忠县",
		1: "zhongxian",
		2: "ZX",
	},
	1602: {
		0: "钟山县",
		1: "zhongshanxian",
		2: "ZS",
	},
	1328: {
		0: "钟祥市",
		1: "zhongxiang",
		2: "ZX",
	},
	1991: {
		0: "仲巴县",
		1: "zhongba",
		2: "ZB",
	},
	2151: {
		0: "舟曲县",
		1: "zhouqu",
		2: "ZQ",
	},
	107: {
		0: "舟山",
		1: "zhoushan",
		2: "ZS",
	},
	4445: {
		0: "周村",
		1: "zhoucun",
		2: "ZC",
	},
	175: {
		0: "周口",
		1: "zhoukou",
		2: "ZK",
	},
	1037: {
		0: "周宁县",
		1: "zhouning",
		2: "ZN",
	},
	2005: {
		0: "周至县",
		1: "zhouzhi",
		2: "ZZ",
	},
	3511: {
		0: "周庄",
		1: "zhouzhuang",
		2: "ZZ",
	},
	3607: {
		0: "朱家尖",
		1: "zhujiajian",
		2: "ZJJ",
	},
	192: {
		0: "株洲",
		1: "zhuzhou",
		2: "ZZ",
	},
	206: {
		0: "珠海",
		1: "zhuhai",
		2: "ZH",
	},
	1149: {
		0: "诸城市",
		1: "zhucheng",
		2: "ZC",
	},
	883: {
		0: "诸暨",
		1: "zhuji",
		2: "ZJ",
	},
	1318: {
		0: "竹山县",
		1: "zhushan",
		2: "ZS",
	},
	1321: {
		0: "竹溪县",
		1: "zhuxi",
		2: "ZX",
	},
	176: {
		0: "驻马店",
		1: "zhumadian",
		2: "ZMD",
	},
	431: {
		0: "庄河市",
		1: "zhuanghe",
		2: "ZH",
	},
	2124: {
		0: "庄浪县",
		1: "zhuanglang",
		2: "ZL",
	},
	3544: {
		0: "准格尔旗",
		1: "zhungeerqi",
		2: "ZGE",
	},
	2150: {
		0: "卓尼县",
		1: "zhuoni",
		2: "ZN",
	},
	673: {
		0: "卓资县",
		1: "zhuozi",
		2: "ZZ",
	},
	466: {
		0: "涿鹿县",
		1: "zhuolu",
		2: "ZL",
	},
	498: {
		0: "涿州市",
		1: "zhuozhou",
		2: "ZZ",
	},
	1095: {
		0: "资溪县",
		1: "zixi",
		2: "ZX",
	},
	1414: {
		0: "资兴市",
		1: "zixing",
		2: "ZX",
	},
	254: {
		0: "资阳",
		1: "ziyang",
		2: "ZY",
	},
	1542: {
		0: "资源县",
		1: "ziyuan",
		2: "ZY",
	},
	1644: {
		0: "资中县",
		1: "zizhong",
		2: "ZZ",
	},
	145: {
		0: "淄博",
		1: "zibo",
		2: "ZB",
	},
	4443: {
		0: "淄川",
		1: "zichuan",
		2: "ZC",
	},
	15015: {
		0: "滋贺",
		1: "Shiga",
		2: "SHI",
	},
	2010: {
		0: "子长县",
		1: "zichang",
		2: "ZC",
	},
	2071: {
		0: "子洲县",
		1: "zizhou",
		2: "ZZ",
	},
	1364: {
		0: "秭归县",
		1: "zigui",
		2: "ZG",
	},
	1622: {
		0: "梓潼县",
		1: "zitong",
		2: "ZT",
	},
	1478: {
		0: "紫金县",
		1: "zijin",
		2: "ZJ",
	},
	2075: {
		0: "紫阳县",
		1: "ziyangxian",
		2: "ZY",
	},
	1761: {
		0: "紫云苗族布依族自治县",
		1: "ziyun",
		2: "ZY",
	},
	238: {
		0: "自贡",
		1: "zigong",
		2: "ZG",
	},
	4269: {
		0: "棕榈泉",
		1: "palmsprings",
		2: "ZLQ",
	},
	1183: {
		0: "邹城市",
		1: "zoucheng",
		2: "ZC",
	},
	1200: {
		0: "邹平市",
		1: "zouping",
		2: "ZPS",
	},
	481: {
		0: "遵化市",
		1: "zunhua",
		2: "ZH",
	},
	260: {
		0: "遵义",
		1: "zunyi",
		2: "ZY",
	},
	1956: {
		0: "左贡县",
		1: "zuogong",
		2: "ZG",
	},
	622: {
		0: "左权县",
		1: "zuoquan",
		2: "ZQ",
	},
	587: {
		0: "左云县",
		1: "zuoyun",
		2: "ZY",
	},
	15013: {
		0: "佐贺",
		1: "Saga",
		2: "SAG",
	},
	12811: {
		0: "佐世保",
		1: "Sasebo",
		2: "SAS",
	},
	2086: {
		0: "柞水县",
		1: "zuoshui",
		2: "ZS",
	},
	20: {
		0: "其它城市",
		1: "more",
		2: "QT",
	},
}
